{
    "ABBV": [
        {
            "symbol": "ABBV",
            "time": 1706832000000000000,
            "displayTime": "Friday, February 2 2024",
            "title": "Abbvie Qtrly Adj EPS $2.79 Vs LSEG IBES Estimate $2.77",
            "text": "Feb 2 (Reuters) - Abbvie Inc <ABBV.N>::ABBVIE QTRLY ADJUSTED EARNINGS PER SHARE $2.79 VERSUS LSEG IBES ESTIMATE $2.77.ABBVIE QTRLY WORLDWIDE NET REVENUE $14.30 BILLION VERSUS LSEG IBES ESTIMATE $14.02 BILLION.ABBVIE QTRLY EARNINGS PER SHARE $0.46.FY2024 EARNINGS PER SHARE VIEW $11.24 -- LSEG IBES DATA.ABBVIE SEES 2024 ADJUSTED EARNINGS PER SHARE $11.05 TO $11.25.ABBVIE: REAFFIRMS VIEW FOR HIGH SINGLE-DIGIT COMPOUND ANNUAL REVENUE GROWTH RATE THROUGH 2029.ABBVIE: RAISES 2027 COMBINED SALES OUTLOOK FOR SKYRIZI & RINVOQ TO MORE THAN $27 BILLION.ABBVIE: RAISES PEAK SALES VIEW FOR UBRELVY & QULIPTA TO MORE THAN $3 BILLION COMBINED.ABBVIE QTRLY GLOBAL HUMIRA NET REVENUE $3.30 BILLION, DOWN 40.8%.ABBVIE: IMMUNOGEN & CEREVEL DEALS EXPECTED TO CLOSE IN MID-2024.ABBVIE QTRLY GLOBAL SKYRIZI NET REVENUE $2.39 BILLION, UP 51.9%.ABBVIE: 2024 ADJUSTED EARNINGS PER SHARE VIEW INCLUDES $0.32/SHARE DILUTIVE IMPACT FROM IMMUNOGEN & CEREVEL THERAPEUTICS DEALS.ABBVIE QTRLY GLOBAL RINVOQ NET REVENUE $1.26 BILLION, UP 62.9%.ABBVIE: QTRLY RESULTS INCLUDE UNFAVORABLE IMPACT OF $0.15/SHARE FROM ACQUIRED IPR&D & MILESTONES EXPENSE."
        },
        {
            "symbol": "ABBV",
            "time": 1706832000000000000,
            "displayTime": "Friday, February 2 2024",
            "title": "AbbVie expects Humira sales erosion of roughly 36% in the U.S. in 2024",
            "text": "Feb 2 (Reuters) - Abbvie Inc <ABBV.N>::ABBVIE EXEC SAYS SKYRIZI AND RINVOQ EXPECTED TO MAKE ABOUT $16 BLN IN 2024 - CONF. CALL.ABBVIE EXEC SAYS THERE WILL BE SOME STEP DOWN IN HUMIRA COVERAGE YEAR OVER YEAR, BUT DRUG WILL STILL HAVE PARITY ACCESS TO BIOSIMILARS FOR VAST MAJORITY OF US PATIENT LIVES - CONF. CALL.ABBVIE EXEC SAYS ANTICIPATE ECONOMIC HEADWINDS FOR AESTHETIC PORTFOLIO TO CONTINUE IN CHINA OVER THE NEAR TERM - CONF. CALL.ABBVIE EXEC SAYS 2024 FORECAST INCLUDES HUMIRA SALES OF $9.6 BILLION, INCLUDING US EROSION OF ROUGHLY 36% - CONF. CALL.ABBVIE EXEC SAYS EXPECT 2024 SKYRIZI REVENUE OF $10.5 BILLION AND RINVOQ SALES OF $5.5 BILLION - CONF. CALL.ABBVIE EXEC SAYS EXPECT HUMIRA GLOBAL REVENUE OF $2.2 BILLION IN Q1, INCLUDING US SALES OF $1.7 BILLION - CONF. CALL.ABBVIE EXEC SAYS STARTED TO SEE U.S. TOXIN MARKET RECOVER AT THE END OF 2023 AND EXPECT THAT TO CONTINUE IN 2024 - CONF. CALL.ABBVIE EXEC SAYS SEE SURGE IN DEMAND FOR GLP-1 WEIGHT-LOSS DRUGS AS A LONG-TERM TAILWIND FOR CO'S AESTHETICS BUSINESS - CONF. CALL.Further company coverage: ABBV.N. ((Reuters.Briefs@thomsonreuters.com;))."
        },
        {
            "symbol": "ABBV",
            "time": 1707696000000000000,
            "displayTime": "Monday, February 12 2024",
            "title": "Abbvie Completes Acquisition Of Immunogen",
            "text": "Feb 12 (Reuters) - Abbvie Inc <ABBV.N>::ABBVIE COMPLETES ACQUISITION OF IMMUNOGEN.ABBVIE REAFFIRMS PREVIOUSLY ISSUED 2024 FULL-YEAR ADJUSTED DILUTED EPS GUIDANCE RANGE OF $11.05-$11.25.UPDATES PREVIOUSLY ISSUED 2024 FIRST-QUARTER ADJUSTED DILUTED EPS GUIDANCE RANGE FROM $2.30-$2.34 TO $2.26-$2.30.FIRST-QUARTER ADJUSTED DILUTED EPS NOW INCLUDES A $0.04 PER SHARE DILUTIVE IMPACT RELATED TO IMMUNOGEN ACQUISITION.ABBVIE- 2024 ADJUSTED EPS GUIDANCE INCLUDES $0.42 PER SHARE DILUTIVE IMPACT RELATED TO COMPLETED IMMUNOGEN ACQUISITION,PENDING CEREVEL THERAPEUTICS ACQUISITION.Q1 EARNINGS PER SHARE VIEW $2.35 -- LSEG IBES DATA.FY2024 EARNINGS PER SHARE VIEW $11.19 -- LSEG IBES DATA."
        },
        {
            "symbol": "ABBV",
            "time": 1713225600000000000,
            "displayTime": "Tuesday, April 16 2024",
            "title": "Medincell Enters Into Strategic Co-Development And Licensing Agreement With Abbvie To Develop Next-Generation Long-Acting Injectable Therapies",
            "text": "April 16 (Reuters) - Medincell SA <MEDCL.PA>::MEDINCELL SA - MEDINCELL WILL RECEIVE AN UPFRONT PAYMENT OF $35 MILLION.MEDINCELL SA - WILL RECEIVE AN UPFRONT PAYMENT OF $35 MILLION.MEDINCELL ENTERS INTO STRATEGIC CO-DEVELOPMENT AND LICENSING AGREEMENT WITH ABBVIE TO DEVELOP NEXT-GENERATION LONG-ACTING INJECTABLE THERAPIES.MEDINCELL SA - MEDINCELL AND ABBVIE WILL CO-DEVELOP, AND ABBVIE WILL COMMERCIALIZE UP TO SIX CUTTING-EDGE LONG-ACTING INJECTABLES (LAI)..MEDINCELL SA - IS ELIGIBLE FOR UP TO $1.9 BILLION IN POTENTIAL DEVELOPMENT AND COMMERCIAL MILESTONES.MEDINCELL SA - MEDINCELL IS ALSO ELIGIBLE TO RECEIVE MID-SINGLE TO LOW-DOUBLE-DIGIT ROYALTIES ON NET SALES..MEDINCELL SA - MEDINCELL IS ALSO ELIGIBLE TO RECEIVE MID-SINGLE TO LOW-DOUBLE-DIGIT ROYALTIES ON NET SALES.MEDINCELL SA - CO-DEVELOPMENT AND LICENSING AGREEMENT COVERS UP TO 6 PROGRAMS."
        }
    ]
}