{
    "4597401": {
        "id": 4597401,
        "significance": "1",
        "headline": "Bob Chapek Says Confident That Best Place For ESPN Is In The Walt Disney Company - GS Tech Conference",
        "description": "Sept 14 (Reuters) - Walt Disney Co <DIS.N>::WALT DISNEY CO SAYS RECEIVED \"NO BLOWBACK WHATSOEVER\" INCORPORATING GENERAL ENTERTAINMENT ON DISNEY-BRANDED STREAMING SERVICE IN EUROPE  - GS TECH CONFERENCE.WALT DISNEY CO CEO SAYS CONFIDENT THAT THE BEST PLACE FOR ESPN IS IN THE WALT DISNEY COMPANY - GS TECH CONFERENCE.WALT DISNEY CO CEO SAYS PRETTY BULLISH ON SPORTS BETTING IN ESPN - GS TECH CONFERENCE.WALT DISNEY CO CEO SAYS BLOCKBUSTERS LIKE 'AVATAR' AND 'THE LITTLE MERMAID' \"BEST SERVED IN THEATERS\" - GS TECH CONFERENCE.WALT DISNEY CO CEO SAYS COMPANY SEES 'STRONG, STRONG DEMAND' FOR PARKS INTO THE FUTURE - GS TECH CONFERENCE.WALT DISNEY CO CEO SAYS NOT SEEING INDICATION THAT RECESSION, MACROECONOMIC FACTORS GOING TO BE IMPACTING PARKS BUSINESS - GS TECH CONFERENCE.WALT DISNEY CO CEO SAYS INTERNATIONAL PARKS ARE STARTING TO BOUNCE BACK FROM PANDEMIC - GS TECH CONFERENCE.WALT DISNEY CO CEO CALLS DISNEY A \"LIFESTYLE BRAND\" AT GS TECH CONFERENCE.WALT DISNEY CO CEO SAYS EMPHASIZES IMPORTANCE OF 'NEXT-GENERATION' STORYTELLING, ENABLED BY TECHNOLOGY - GS TECH CONFERENCE.Further company coverage: DIS.N. ((Reuters.Briefs@thomsonreuters.com;)).",
        "parentTopics": "Performance"
    },
    "4620687": {
        "id": 4620687,
        "significance": "1",
        "headline": "The Walt Disney Company Reports Fourth Quarter, Full Year Earnings For Fiscal 2022",
        "description": "Nov 8 (Reuters) - Walt Disney Co <DIS.N>::THE WALT DISNEY COMPANY REPORTS FOURTH QUARTER AND FULL YEAR EARNINGS FOR FISCAL 2022.",
        "parentTopics": "Performance"
    },
    "4628652": {
        "id": 4628652,
        "significance": "1",
        "headline": "Moody's Says Disney's Leadership Shuffle Does Not Impact Ratings",
        "description": "Nov 21 (Reuters) - Walt Disney Co <DIS.N>::MOODY'S SAYS DISNEY'S LEADERSHIP SHUFFLE DOES NOT IMPACT RATINGS.",
        "parentTopics": "Performance"
    },
    "4644715": {
        "id": 4644715,
        "significance": "1",
        "headline": "Trian Nominates Nelson Peltz For Election To Disney Board",
        "description": "Jan 11 (Reuters) - Trian Fund Management ::TRIAN NOMINATES NELSON PELTZ FOR ELECTION TO DISNEY BOARD.TRIAN FUND MANAGEMENT - INVESTMENT FUNDS COLLECTIVELY OWN APPROXIMATELY 9.4 MILLION COMMON SHARES OF WALT DISNEY COMPANY.TRIAN FUND MANAGEMENT- WILL FILE A PRELIM PROXY STATEMENT WITH SEC FOR ELECTION OF NELSON PELTZ TO DISNEY'S BOARD OF DIRECTORS AT 2023 ANNUAL MEETING.TRIAN FUND MANAGEMENT- TRIAN'S OBJECTIVE IS TO CREATE \"SUSTAINABLE, LONG-TERM\" VALUE AT DISNEY BY WORKING WITH BOB IGER AND DISNEY.TRIAN FUND MANAGEMENT- TRIAN IS NOT LOOKING TO REPLACE BOB IGER.TRIAN FUND MANAGEMENT - TRIAN IS LOOKING FOR ENSURING A SUCCESSFUL CEO SUCCESSION WITHIN 2 YEARS & NOT ADVOCATING FOR A BREAK-UP OF DISNEY.TRIAN FUND MANAGEMENT - TRIAN IS NOT ADVOCATING FOR A PERMANENT DIVIDEND CUT & IS FOR REINSTATING DIVIDEND BY FY 2025.",
        "parentTopics": "Performance"
    },
    "4645085": {
        "id": 4645085,
        "significance": "1",
        "headline": "Activist Investor Nelson Peltz Says Disney Offered Him Board Observer Position On Wednesday-CNBC Interview",
        "description": "Jan 12 (Reuters) - :ACTIVIST INVESTOR NELSON PELTZ SPEAKS ON CNBC.TRIAN'S NELSON PELTZ SAYS DISNEY'S SHARE RETURN HAS UNDERPERFORMED S&P - CNBC INTERVIEW.ACTIVIST INVESTOR NELSON PELTZ SAYS FOX HURT DISNEY AND TOOK DIVIDEND AWAY - CNBC INTERVIEW.ACTIVIST INVESTOR NELSON PELTZ SAYS DISNEY OFFERED HIM BOARD OBSERVER POSITION  ON WEDNESDAY.ACTIVIST INVESTOR NELSON PELTZ SAYS DISNEY DIDN'T MEET WITH HIM SEVERAL TIMES.ACTIVIST INVESTOR NELSON PELTZ SAYS DISNEY GAVE HIM A 5 MINUTE CONVERSATION.ACTIVIST INVESTOR NELSON PELTZ SAYS HAD ONE MEETING WITH DISNEY'S BOARD FOR 45 MINUTES, BOB IGER WAS NOT ON THE CALL.ACTIVIST INVESTOR NELSON PELTZ SAYS NEEDS JUST ONE BOARD SEAT AT DISNEY.ACTIVIST INVESTOR NELSON PELTZ SAYS DISNEY IS MORE THAN A MEDIA COMPANY  AND IS A CONSUMER COMPANY.ACTIVIST INVESTOR NELSON PELTZ SAYS WE ALREADY HAVE A POSITIVE IMPACT ON DISNEY, WE CAN DO MORE.ACTIVIST INVESTOR NELSON PELTZ SAYS DISNEY HAS TO BUY HULU.ACTIVIST INVESTOR NELSON PELTZ ON DISNEY+ SAYS THEY HAVE TO BUY HULU OR GET OUT OF THE STREAMING BUSINESS.ACTIVIST INVESTOR NELSON PELTZ ON DISNEY'S PARKS SAYS THEY PROBABLY PUSHED THE PRICE TOO HARD, PARKS PROBABLY NEED MORE CAPEX.Further company coverage: DIS.N. ((Reuters.Briefs@thomsonreuters.com;)).",
        "parentTopics": "Performance"
    },
    "4656741": {
        "id": 4656741,
        "significance": "1",
        "headline": "Disney Q1 Revenue Just Below Expectations, but Adj. EPS Beats",
        "description": "Feb 8 (Reuters) - Disney Q1 revenue USD 23,512 million vs. estimate USD 23,372 million.:.",
        "parentTopics": "Performance"
    },
    "4683009": {
        "id": 4683009,
        "significance": "1",
        "headline": "Walt Disney CEO Bob Iger Says Expects To Commence Final Round Of Job Cuts Notifications Before Beginning Of Summer",
        "description": "March 27 (Reuters) - Walt Disney Co <DIS.N>::WALT DISNEY CO CEO BOB IGER, IN LETTER TO EMPLOYEES, SAYS EXPECTS TO COMMENCE FINAL ROUND OF JOB REDUCTION NOTIFICATIONS BEFORE BEGINNING OF SUMMER.WALT DISNEY CEO BOB IGER, IN LETTER TO EMPLOYEES, SAYS TO BEGIN NOTIFYING EMPLOYEES IMPACTED BY ABOUT 7000 WORKFORCE CUT ANNOUNCED IN FEB THIS WEEK.WALT DISNEY CO CEO BOB IGER, IN LETTER TO EMPLOYEES, SAYS EXPECTS SECOND, LARGER ROUND OF NOTIFICATIONS REGARDING JOB CUTS IN APRIL.Further company coverage: DIS.N. ((Reuters.Briefs@thomsonreuters.com;)).",
        "parentTopics": "Restructuring\\/Reorganization\\/Related"
    },
    "4708017": {
        "id": 4708017,
        "significance": "1",
        "headline": "Disney Q2 Revenue Beats Estimates",
        "description": "May 10 (Reuters) - Disney Q2 EPS continuing operations USD 0.69.:.",
        "parentTopics": "Performance"
    },
    "4708111": {
        "id": 4708111,
        "significance": "1",
        "headline": "Walt Disney Co Posts Qtrly Adj Shr $0.93",
        "description": "May 10 (Reuters) - Walt Disney Co <DIS.N>::WALT DISNEY CO: QTRLY ADJUSTED EARNINGS PER SHARE $0.93 VERSUS. ESTIMATE $0.93.WALT DISNEY CO: QTRLY REVENUE $21.82 BILLION VERSUS. ESTIMATE $21.78 BILLION.WALT DISNEY CO: TOTAL DISNEY+ PAID SUBSCRIBERS 157.8 MILLION AT APRIL 1 VERSUS 161.8 MILLION AT DEC 31, 2022.WALT DISNEY CO: QTRLY EARNINGS PER SHARE FROM CONTINUING OPERATIONS $0.69.WALT DISNEY CO: IN QUARTER, RECORDED CHARGES OF $152 MILLION PRIMARILY FOR SEVERANCE.WALT DISNEY CO: QTRLY DISNEY PARKS, EXPERIENCES AND PRODUCTS REVENUE $7.78 BILLION VERSUS $6.65 BILLION REPORTED LAST YEAR.",
        "parentTopics": "Performance"
    },
    "4711010": {
        "id": 4711010,
        "significance": "1",
        "headline": "Hong Kong Disneyland Resort's Net Loss Narrows To HK$2.1 Bln In Fiscal 2022",
        "description": "May 15 (Reuters) - Hong Kong Disneyland Resort: :HONG KONG DISNEYLAND RESORT SAYS REVENUE FOR THE YEAR UP 31% Y\\/Y TO HK$2.2 BILLION  ($280.29 million) IN FISCAL 2022, NET LOSS NARROWS TO HK$2.1 BILLION.Further company coverage: DIS.N.($1 = 7.8489 Hong Kong dollars). (Reporting by Hong Kong newsroom). ((twinnie.siu@tr.com; 852-3462 7715;)).",
        "parentTopics": "Performance"
    },
    "4719983": {
        "id": 4719983,
        "significance": "1",
        "headline": "Walt Disney Removes Certain Produced Content From Its DTC Services",
        "description": "June 2 (Reuters) - Walt Disney Co <DIS.N>::WALT DISNEY CO- ON MAY 26, 2023, THE COMPANY REMOVED CERTAIN PRODUCED CONTENT FROM ITS DTC SERVICES..WALT DISNEY CO-  IS CONTINUING ITS REVIEW AND CURRENTLY ANTICIPATES ADDITIONAL PRODUCED CONTENT WILL BE REMOVED FROM ITS DTC AND OTHER PLATFORMS.WALT DISNEY CO - CURRENTLY ESTIMATES IT MAY INCUR FURTHER IMPAIRMENT CHARGES OF UP TO ABOUT $0.4 BILLION RELATED TO PRODUCED CONTENT.WALT DISNEY CO-  DOES NOT EXPECT ANY MATERIAL CASH EXPENDITURES IN CONNECTION WITH THE IMPAIRMENT CHARGES RELATED TO PRODUCED CONTENT..WALT DISNEY CO - MAY TERMINATE CERTAIN LICENSE AGREEMENTS FOR RIGHT TO USE CONTENT ON ITS PLATFORMS.WALT DISNEY- TO RECORD $1.5 BILLION IMPAIRMENT CHARGE IN FISCAL Q3 FINANCIAL STATEMENTS TO ADJUST CARRYING VALUE OF THESE CONTENT ASSETS TO FAIR VALUE.WALT DISNEY CO- CURRENTLY EXPECTS ANY CHARGES RELATED TO LICENSED CONTENT TO BE MEANINGFULLY LESS THAN IMPAIRMENT CHARGES RELATED TO PRODUCED CONTENT.",
        "parentTopics": "Performance"
    },
    "4748015": {
        "id": 4748015,
        "significance": "1",
        "headline": "Disney Q3 Revenue USD 22,330 Million",
        "description": "Aug 9 (Reuters) - Disney Q3 revenue USD 22,330 million vs. IBES estimate USD 22,501 million.:.",
        "parentTopics": "Performance"
    },
    "4774663": {
        "id": 4774663,
        "significance": "1",
        "headline": "Walt Disney Co Will Report Results Of Media & Entertainment Businesses In 2 Segments",
        "description": "Oct 18 (Reuters) - Walt Disney Co <DIS.N>::WALT DISNEY CO - DUE TO  REORGANIZATION, EFFECTIVE WITH Q4, FINANCIAL RESULTS OF MEDIA AND ENTERTAINMENT BUSINESSES WILL BE REPORTED IN 2 SEGMENTS.WALT DISNEY CO- FINANCIAL RESULTS OF MEDIA AND ENTERTAINMENT BUSINESSES WILL BE REPORTED IN TWO SEGMENTS, ENTERTAINMENT AND SPORTS.",
        "parentTopics": "Performance"
    },
    "4787098": {
        "id": 4787098,
        "significance": "1",
        "headline": "Disney Q4 adjusted EPS USD 0.82",
        "description": "Nov 8 (Reuters) - Disney Q4 revenue USD 21,241 million vs. IBES estimate USD 21,327 million.:.",
        "parentTopics": "Performance"
    },
    "4796795": {
        "id": 4796795,
        "significance": "1",
        "headline": "The Walt Disney Company Says Gorman And Darroch's Appointments Reflect Disney’s Commitment To Strong Board",
        "description": "Nov 30 (Reuters) - Walt Disney Co <DIS.N>::WALT DISNEY CO: STATEMENT FROM THE WALT DISNEY COMPANY IN RESPONSE TO THE STATEMENT RELEASED BY NELSON PELTZ.WALT DISNEY CO- WE ARE ON TRACK TO ACHIEVE ABOUT $7.5 BILLION IN COST SAVINGS – $2 BILLION MORE THAN OUR ORIGINAL TARGET.WALT DISNEY CO - DISNEY EXPECTS FREE CASH FLOW TO APPROACH PRE-COVID LEVELS IN FISCAL 2024.WALT DISNEY :  ISAAC PERLMUTTER OWNS 78% OF SHARES THAT  PELTZ CLAIMS BENEFICIAL OWNERSHIP OF.WALT DISNEY CO: PERLMUTTER WAS TERMINATED FROM HIS EMPLOYMENT BY DISNEY EARLIER THIS YEAR.WALT DISNEY CO: GORMAN AND DARROCH'S APPOINTMENTS REFLECT DISNEY’S COMMITMENT TO A STRONG BOARD FOCUSED ON THE LONG-TERM PERFORMANCE OF THE COMPANY.Further company coverage: DIS.N. ((Reuters.Briefs@thomsonreuters.com;)).",
        "parentTopics": "Restructuring\\/Reorganization\\/Related"
    },
    "4819721": {
        "id": 4819721,
        "significance": "1",
        "headline": "Walt Disney Currently Expects Fiscal 2024 Spend On Produced & Licensed Content, Including Sports Rights, To Be About $24 Billion Versus Fiscal 2023",
        "description": "Feb 7 (Reuters) - Walt Disney Co <DIS.N>::WALT DISNEY: CURRENTLY EXPECTS FISCAL 2024 SPEND ON PRODUCED & LICENSED CONTENT, INCLUDING SPORTS RIGHTS, TO BE ABOUT $24 BILLION VERSUS FISCAL 2023.WALT DISNEY CO: EXPECTS ITS FISCAL 2024 CAPITAL EXPENDITURES TO TOTAL APPROXIMATELY $6 BILLION.WALT DISNEY- EFFECTIVE FEB 7, BOARD AUTHORIZED NEW SHARE REPURCHASE PROGRAM FOR CO TO REPURCHASE A TOTAL OF 400 MILLION SHARES OF COMMON STOCK..WALT DISNEY- HULU’S EQUITY FAIR VALUE FOR PURPOSES OF DETERMINING REDEMPTION PAYMENT IS NOT EXPECTED TO BE FINALIZED UNTIL LATER IN CALENDAR 2024.",
        "parentTopics": "Performance"
    }
}