{
    "DIS": [
        {
            "symbol": "DIS",
            "time": 1707264000000000000,
            "displayTime": "Wednesday, February 7 2024",
            "title": "Walt Disney Say Plan To Target $3 Bln In Repurchases In 2024",
            "text": "Feb 7 (Reuters) - Walt Disney Co <DIS.N>::WALT DISNEY: QTRLY ADJUSTED EARNINGS PER SHARE $1.22 VERSUS LSEG IBES ESTIMATE $0.99.WALT DISNEY: QTRLY EARNINGS PER SHARE $1.04.WALT DISNEY: SEES FISCAL 2024 ADJUSTED EARNINGS PER SHARE ABOUT $4.60 VERSUS LSEG IBES ESTIMATE $4.28.WALT DISNEY: QTRLY REVENUE $23.55 BILLION VERSUS LSEG IBES ESTIMATE $23.64 BILLION.WALT DISNEY: PLAN TO TARGET $3 BILLION IN REPURCHASES IN FISCAL 2024.WALT DISNEY: ON TRACK TO MEET OR EXCEED $7.5 BILLION ANNUALIZED SAVINGS TARGET BY END OF FISCAL\t 2024.WALT DISNEY: CONTINUE TO LOOK FOR FURTHER EFFICIENCY OPPORTUNITIES.WALT DISNEY: DECLARED CASH DIVIDEND OF $0.45 PER SHARE, UP 50% VERSUS LAST DIVDEND PAID IN JAN.WALT DISNEY: EXPECT DISNEY+\tCORE SUBSCRIBER NET ADDITIONS OF BETWEEN\t5.5 MILLION AND 6 MILLION IN Q2.WALT DISNEY: REALIZATION OF\tOVER $500 MILLION IN SELLING, GENERAL AND ADMINISTRATIVE AND OTHER OPERATING EXPENSE SAVINGS IN Q1.WALT DISNEY: QTRLY ENTERTAINMENT REVENUE $9.98 BILLION VERSUS $10.68 BILLION LAST YEAR.WALT DISNEY: CONTINUE TO EXPECT FCF GENERATION IN FISCAL 2024 TO TOTAL ROUGHLY $8 BILLION.WALT DISNEY: CONTINUE TO EXPECT TO REACH PROFITABILITY AT COMBINED STREAMING BUSINESSES IN Q4.WALT DISNEY: QTRLY EXPERIENCES REVENUE $9.13 BILLION VERSUS $8.55 BILLION LAST YEAR.WALT DISNEY: QTRLY SPORTS REVENUE $4.84 BILLION VERSUS $4.64 BILLION LAST YEAR.WALT DISNEY: QUARTER-END DISNEY+ CORE PAID SUBSCRIBERS 111.3 MILLION, DOWN 1% SEQUENTIALLY."
        },
        {
            "symbol": "DIS",
            "time": 1708992000000000000,
            "displayTime": "Tuesday, February 27 2024",
            "title": "Disney Says Peltz Declined Invitations To Meet With Board In Late 2023",
            "text": "Feb 27 (Reuters) - Walt Disney Co <DIS.N>::DISNEY: NELSON PELTZ ENDED PROXY CONTEST IN FEB. 2023; BOARD MAINTAINED OPENED DIALOGUE WITH PELTZ, TRIAN GROUP.DISNEY: PELTZ DECLINED INVITATIONS TO MEET WITH BOARD, SEGMENT LEADERS IN LATE 2023.DISNEY: EXPECTS DISNEY+ TO ACHIEVE PROFITABILITY BY END OF FY 2024.Further company coverage: DIS.N. ((Reuters.Briefs@thomsonreuters.com;))."
        },
        {
            "symbol": "DIS",
            "time": 1709078400000000000,
            "displayTime": "Wednesday, February 28 2024",
            "title": "Disney Expects To Record Non-Cash Pre-Tax Impairment Charges of Upto $2.4 Bln",
            "text": "Feb 28 (Reuters) - Walt Disney Co <DIS.N>::DISNEY - CURRENTLY EXPECTS TO RECORD NON-CASH PRE-TAX IMPAIRMENT CHARGES ESTIMATED TO BE BETWEEN $1.8 BILLION TO $2.4 BILLION.DISNEY -  UNDER HELD-FOR-SALE ACCOUNTING, COMPANY WILL CONTINUE TO ADJUST NET BOOK VALUE OF STAR INDIA TO FAIR VALUE UNTIL CLOSING DATE OF TRANSACTION.DISNEY: COMPANY DOES NOT CURRENTLY EXPECT TRANSACTION TO CLOSE IN FISCAL 2024, BUT CURRENTLY EXPECTS TRANSACTION TO CLOSE IN FIRST HALF OF FISCAL 2025.DISNEY - UNDER AGREEMENT, RIL WILL HAVE FIVE SEATS ON BOARD OF DIRECTORS OF JV, COMPANY WILL HAVE THREE DIRECTORS.DISNEY: IMPAIRMENT CHARGES EXPECTED TO BE EXCLUDED FROM ADJUSTED EPS, THEREFORE ARE NOT EXPECTED TO IMPACT CO'S PREVIOUS GUIDANCE ON FISCAL 2024 ADJUSTED EPS.DISNEY: UNDER DEAL, RIL WILL HAVE 5 SEATS ON BOARD OF DIRECTORS OF JV, CO WILL HAVE 3 DIRECTORS AND THERE WILL BE TWO INDEPENDENT DIRECTORS.DISNEY-TO SEE INCREMENTAL GAINS/LOSSES EACH REPORTING PERIOD DUE TO CHANGES IN NET BOOK VALUE AND/OR ESTIMATED FAIR VALUE OF STAR INDIA TILL DEAL CLOSE.DISNEY -  EXPECTS TO RECORD NON-CASH PRE-TAX IMPAIRMENT CHARGES RELATED TO DEAL WITH RELIANCE INDUSTRIES LIMITED IN CURRENT QUARTER."
        },
        {
            "symbol": "DIS",
            "time": 1709856000000000000,
            "displayTime": "Friday, March 8 2024",
            "title": "Disney Says Right Now Trending To Exceed Fiscal 2024 Cash Flow Generation Guidance",
            "text": "March 8 (Reuters) - Walt Disney Co <DIS.N>::DISNEY - RIGHT NOW TRENDING TO EXCEED FISCAL 2024 CASH FLOW GENERATION GUIDANCE.DISNEY'S IGER ON STREAMING BUSINESS: \"WE ARE ON A PATH TO PROFITABILITY\".DISNEY - IGER HIGHLIGHTED ESPN HAS SHOWN CONTINUED STRENGTH AS A NETWORK.DISNEY: \"ULTIMATELY, WAY DOWN THE ROAD, ESPN WILL BE A FULL DIGITAL PLATFORM\".DISNEY - EXPECTS THAT MAKING HULU CONTENT AVAILABLE ON DISNEY+ FOR BUNDLE SUBSCRIBERS WILL GENERATE POSITIVE OUTCOMES FOR THE BUSINESS.DISNEY: WE’RE ALSO MANAGING OUR COSTS MORE AGGRESSIVELY AT FILM STUDIOS.DISNEY: \"FEEL THAT WE WILL RETURN THE STUDIO TO NOT ONLY EXCELLENCE CREATIVELY BUT EXCELLENCE IN TERMS OF THE BOTTOM LINE\".DISNEY'S IGER: \"WE HAVE GREAT PEOPLE RUNNING OUR FOUR KEY BUSINESSES AND WE’VE STRENGTHENED OUR EXECUTIVE TEAM SIGNIﬁCANTLY\".DISNEY - PLANS TO TURBOCHARGE GROWTH WITH ABOUT $60 BILLION INVESTMENT OVER NEXT DECADE IN EXPANDING DOMESTIC & INTERNATIONAL PARKS,DISNEY CRUISE LINE.DISNEY'S IGER ON ACTIVIST INVESTORS: “THIS IS A VERY COMPLEX COMPANY TO RUN. THERE ARE MANY MOVING PARTS. THERE ARE DIFFERENT MARKETS\".DISNEY'S IGER ON ESPN: TO CONTINUE TO “TAKE ADVANTAGE OF LINEAR IN TERMS OF REVENUE AND PROFITS THAT IT GENERATES,\" WHILE MAKING TRANSITION TO STREAMING.DISNEY'S IGER ON ACTIVIST INVESTORS: WORKING REALLY HARD TO NOT LET ACTIVIST INVESTORS \"DISTRACT ME\"."
        },
        {
            "symbol": "DIS",
            "time": 1707264000000000000,
            "displayTime": "Wednesday, February 7 2024",
            "title": "Walt Disney Currently Expects Fiscal 2024 Spend On Produced & Licensed Content, Including Sports Rights, To Be About $24 Billion Versus Fiscal 2023",
            "text": "Feb 7 (Reuters) - Walt Disney Co <DIS.N>::WALT DISNEY: CURRENTLY EXPECTS FISCAL 2024 SPEND ON PRODUCED & LICENSED CONTENT, INCLUDING SPORTS RIGHTS, TO BE ABOUT $24 BILLION VERSUS FISCAL 2023.WALT DISNEY CO: EXPECTS ITS FISCAL 2024 CAPITAL EXPENDITURES TO TOTAL APPROXIMATELY $6 BILLION.WALT DISNEY- EFFECTIVE FEB 7, BOARD AUTHORIZED NEW SHARE REPURCHASE PROGRAM FOR CO TO REPURCHASE A TOTAL OF 400 MILLION SHARES OF COMMON STOCK..WALT DISNEY- HULU’S EQUITY FAIR VALUE FOR PURPOSES OF DETERMINING REDEMPTION PAYMENT IS NOT EXPECTED TO BE FINALIZED UNTIL LATER IN CALENDAR 2024."
        }
    ]
}