{
    "symbol": "DLR",
    "instrumentInfo": {
        "technicalEvents": {
            "provider": "Trading Central",
            "sector": "Real Estate",
            "shortTermOutlook": {
                "stateDescription": "Recent bullish events outweigh bearish events.",
                "direction": "Bullish",
                "score": 2,
                "scoreDescription": "Bullish Evidence",
                "sectorDirection": "Bullish",
                "sectorScore": 2,
                "sectorScoreDescription": "Bullish Evidence",
                "indexDirection": "Bearish",
                "indexScore": 1,
                "indexScoreDescription": "Weak Bearish Evidence"
            },
            "intermediateTermOutlook": {
                "stateDescription": "Recent bearish events outweigh bullish events.",
                "direction": "Bearish",
                "score": 2,
                "scoreDescription": "Bearish Evidence",
                "sectorDirection": "Bearish",
                "sectorScore": 2,
                "sectorScoreDescription": "Bearish Evidence",
                "indexDirection": "Bearish",
                "indexScore": 4,
                "indexScoreDescription": "Very Strong Bearish Evidence"
            },
            "longTermOutlook": {
                "stateDescription": "Bullish events outweigh bearish events.",
                "direction": "Bullish",
                "score": 1,
                "scoreDescription": "Weak Bullish Evidence",
                "sectorDirection": "Bearish",
                "sectorScore": 3,
                "sectorScoreDescription": "Strong Bearish Evidence",
                "indexDirection": "Bullish",
                "indexScore": 1,
                "indexScoreDescription": "Weak Bullish Evidence"
            }
        },
        "keyTechnicals": {
            "provider": "Trading Central",
            "support": 135.94,
            "resistance": 144.035,
            "stopLoss": 128.277641
        },
        "valuation": {
            "color": 0.0,
            "description": "Overvalued",
            "discount": "-47%",
            "relativeValue": "Premium",
            "provider": "Trading Central"
        }
    },
    "companySnapshot": {
        "sectorInfo": "Real Estate",
        "company": {
            "innovativeness": 0.5117,
            "sustainability": 0.4082,
            "insiderSentiments": 0.46909999999999996,
            "earningsReports": 0.8966,
            "dividends": 0.1723
        },
        "sector": {
            "innovativeness": 0.5,
            "hiring": 0.5,
            "sustainability": 0.5,
            "insiderSentiments": 0.5,
            "earningsReports": 0.5,
            "dividends": 0.5
        }
    },
    "recommendation": {
        "targetPrice": 152.0,
        "provider": "Argus Research",
        "rating": "BUY"
    },
    "upsell": {
        "msBullishSummary": [
            "Digital Realty's shift toward connection and co-location exposes it to the most attractive parts of the data center business and the growth tailwinds of cloud providers and data connectivity.",
            "Digital Realty's global offering and high exposure to cloud providers gives it an advantage over competitors that operate in more narrow geographies or can only offer retail co-location space.",
            "Internet of Things, artificial intelligence, and other innovations that increase the public's demand for data and connectivity require more hardware and connections in data centers."
        ],
        "msBearishSummary": [
            "Equinix's foray into hyperscale eliminates Digital Realty's distinction as the biggest data center provider offering a full suite of services, from single cabinets to full, hyperscale data centers.",
            "Digital Realty is too dependent on cloud service providers, leaving it at the mercy of those companies.",
            "Technological advances will allow aggregate data needs to be met with less physical space and power and fewer direct connections, reducing data center needs."
        ],
        "companyName": "Digital Realty Trust, Inc.",
        "msBullishBearishSummariesPublishDate": 1714720593000,
        "upsellReportType": "MORNINGSTAR_ANALYST"
    },
    "upsellSearchDD": {
        "researchReports": {
            "reportId": "MS_0P000001Q1_AnalystReport_1714720593000",
            "provider": "Morningstar",
            "title": "Digital Realty Earnings: Long-Term Trajectory Is Steady Despite Signs of Huge Demand",
            "reportDate": "2024-05-03T07:16:33Z",
            "summary": "Digital Realty owns and operates over 300 data centers worldwide. It has nearly 40 million rentable square feet across five continents. Digital's offerings range from retail co-location, where an enterprise may rent a single cabinet and rely on Digital to provide all the accommodations, to \"cold shells,\" where hyperscale cloud service providers can simply rent much, or all, of a barren, power-connected building. In recent years, Digital Realty has de-emphasized cold shells and now primarily provides higher-level service to tenants, which outsource their related IT needs to Digital. The company operates as a real estate investment trust. ",
            "investmentRating": "Neutral"
        }
    },
    "events": [
        {
            "eventType": "Price Crosses Moving Average",
            "pricePeriod": "D",
            "tradingHorizon": "S",
            "tradeType": "L",
            "imageUrl": "https://s.yimg.com/uc/fin/img/assets/generic.svg",
            "startDate": 1714656600,
            "endDate": 1714656600
        }
    ],
    "reports": [
        {
            "id": "4555_Analyst Report_1708628101000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2024-02-22T18:55:01Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on cloud and carrier-neutral interconnected data centers, with a market cap of $41 billion. It also develops data center platforms for businesses involved in cloud software, financial services, social media, and mobile services. Digital Realty helps customers develop secure networks and cloud-neutral data center platforms, and is at the forefront of the secular transition from on-premises data centers to cloud colocation centers. It continues to expand through M&A, joint ventures, and new development projects, while also recycling capital through asset sales. \r\n\r\nDLR is based in Austin, Texas, and operates over 300 data centers in 27 countries and over 50 global metropolitan markets. About 60% of annual rents are from data centers greater than 1 megawatt and about one-fourth of revenue is from tenant reimbursements for expenses and utilities. The company must manage foreign exchange issues as only about half of revenues are in U.S. dollars. Recent acquisitions have included data center companies in Europe and Africa. The shares are a component of the S&P 500.",
            "targetPrice": 152.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "39195_Market Update_1708627201000",
            "headHtml": "Market Update: CNP, HD, AZN, DLR, LIN",
            "provider": "Argus Research",
            "reportDate": "2024-02-22T18:40:01Z",
            "reportTitle": "U.S. markets rallied on Thursday morning on stellar Nvidia results. On the housing front, existing home sales rose 3.1% to an annual rate of 4 million, this up from 3.8 million in December. The median home sales price was $379,100, 5.1% higher than a year ago, but down from $381,400 in December. As for economic trends, S&P Global's flash readings for February's PMI show expansion in both services and manufacturing. Services activity slowed to 51.3, down from 52.5 in January, but remained in expansion territory. Manufacturing PMI expanded more quickly in February with a reading of 51.7, up from 50.7 in January. The tech heavy Nasdaq rose 2.6%, the S&P 500 was up $1.8% and the Dow gained 0.8%",
            "tickers": [
                "LIN",
                "CNP",
                "AZN",
                "DLR",
                "HD"
            ]
        },
        {
            "id": "38393_Thematic Portfolio_1701197712000",
            "headHtml": "The Argus ESG Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2023-11-28T18:55:12Z",
            "reportTitle": "Sustainable Impact Investing, or ESG investing, is gaining traction not only with Argus Research clients but also with the global investment community. BlackRock CEO Lawrence Fink, who oversees approximately $9 trillion in assets, announced in January 2020 that his firm would be investing in companies that are making progress on sustainability. He doubled down in his January 2021 letter, calling on company managements to disclose their plans for making their businesses \"compatible with a net-zero economy\" by 2050. As assets have flowed in over the past 40 years, Sustainable Impact Investing has evolved. The discipline, originally known as Socially Responsible Investing, focused at first on excluding companies that conducted business in South Africa, or participated in industries such as tobacco, alcohol, and firearms. Performance of these initial strategies lagged, and the approach has been modified. Now, instead of merely identifying industries to avoid, the discipline promotes \"sustainable\" business practices across all industries that can have an \"impact\" on global issues such as climate, hunger, poverty, disease, shelter, and workers' rights.",
            "tickers": [
                "TT",
                "GOOGL",
                "DE",
                "AAPL",
                "AVGO",
                "JPM",
                "DLR",
                "ADP",
                "MSFT",
                "ABT",
                "MA",
                "QCOM",
                "LRCX",
                "LLY",
                "SPGI",
                "TRV",
                "CME",
                "KLAC",
                "NVDA",
                "COP",
                "BSX",
                "VRTX",
                "ECL",
                "TMUS",
                "CTAS",
                "HD",
                "ETN",
                "MRVL",
                "CRM",
                "WMT"
            ]
        },
        {
            "id": "38393_Thematic Portfolio_1701196812000",
            "headHtml": "The Argus ESG Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2023-11-28T18:40:12Z",
            "reportTitle": "Sustainable Impact Investing, or ESG investing, is gaining traction not only with Argus Research clients but also with the global investment community. BlackRock CEO Lawrence Fink, who oversees approximately $9 trillion in assets, announced in January 2020 that his firm would be investing in companies that are making progress on sustainability. He doubled down in his January 2021 letter, calling on company managements to disclose their plans for making their businesses \"compatible with a net-zero economy\" by 2050. As assets have flowed in over the past 40 years, Sustainable Impact Investing has evolved. The discipline, originally known as Socially Responsible Investing, focused at first on excluding companies that conducted business in South Africa, or participated in industries such as tobacco, alcohol, and firearms. Performance of these initial strategies lagged, and the approach has been modified. Now, instead of merely identifying industries to avoid, the discipline promotes \"sustainable\" business practices across all industries that can have an \"impact\" on global issues such as climate, hunger, poverty, disease, shelter, and workers' rights.",
            "tickers": [
                "TT",
                "GOOGL",
                "DE",
                "AAPL",
                "AVGO",
                "JPM",
                "DLR",
                "ADP",
                "MSFT",
                "ABT",
                "MA",
                "QCOM",
                "LRCX",
                "LLY",
                "SPGI",
                "TRV",
                "CME",
                "KLAC",
                "NVDA",
                "COP",
                "BSX",
                "VRTX",
                "ECL",
                "TMUS",
                "CTAS",
                "HD",
                "ETN",
                "MRVL",
                "CRM",
                "WMT"
            ]
        },
        {
            "id": "4555_Analyst Report_1698859730000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2023-11-01T17:28:50Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on cloud and carrier-neutral interconnected data centers, with a market cap of $37 billion. It also develops data center platforms for businesses involved in cloud software, financial services, social media, and mobile services. Digital Realty helps customers develop secure networks and cloud-neutral data center platforms, and is at the forefront of the secular transition from on-premises data centers to cloud colocation centers. It continues to expand through M&A, joint ventures, and new development projects, while also recycling capital through asset sales. \r\n\r\nDLR is based in Austin, Texas, and operates over 300 data centers in 27 countries. Domestic assets are concentrated in 50 metropolitan markets. About 60% of annual rents are from data centers greater than 1 megawatt and about one-fourth of revenue is from tenant reimbursements for expenses and utilities. The company must manage foreign exchange issues as only about half of revenues are in U.S. dollars. Recent acquisitions have included data center companies in Europe and Africa. The shares are a component of the S&P 500.",
            "targetPrice": 138.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "38154_Market Update_1698858830000",
            "headHtml": "Market Update: SWK, WDC, DLR, IGT",
            "provider": "Argus Research",
            "reportDate": "2023-11-01T17:13:50Z",
            "reportTitle": "Stocks rose on Wednesday morning as investors awaited the Fed's afternoon policy statement and follow-up comments from Chairman Jerome Powell. Given the impact of previous rate hikes and high Treasury yields, the Fed is widely expected to hold rates steady while leaving open the possibility of a further increase in December or in early 2024. The Dow rose 0.4%, the S&P 0.5%, and the Nasdaq 0.6%. Crude oil rose nearly 3% to $83 per barrel, while gold traded near $1994 per ounce.",
            "tickers": [
                "SWK",
                "IGT",
                "WDC",
                "DLR"
            ]
        },
        {
            "id": "4555_Analyst Report_1690909441000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2023-08-01T17:04:01Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers, with a market cap of $36 billion. It also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. Digital Realty helps customers develop secure networks and cloud-neutral data center platforms, and is at the forefront of the secular transition from on-premises data centers to cloud colocation centers. It continues to expand through M&A, joint ventures, and new development projects, while also recycling capital through asset sales. \r\n\r\nDLR is based in Austin, Texas, and operates 314 data centers in 27 countries. Domestic assets are concentrated in 50 metropolitan markets. About 60% of annual rents are from data centers greater than 1 megawatt and about one-fourth of revenue is from tenant reimbursements for expenses and utilities. Recent acquisitions have included data center companies in Europe and Africa. The shares are a component of the S&P 500.",
            "targetPrice": 138.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "37232_Market Update_1690908541000",
            "headHtml": "Market Update: GPN, VLO, DLR, AGNC, CC",
            "provider": "Argus Research",
            "reportDate": "2023-08-01T16:49:01Z",
            "reportTitle": "Stocks turned lower on Tuesday morning, led by sharp declines in the Energy and Consumer Discretionary sectors. On the earnings front, Caterpillar shares rose more than 7% after the company posted much better than expected 2Q earnings, despite warning of sequentially lower revenue in 3Q. Pfizer reported sharply lower sales and earnings due to weaker demand for COVID products, though EPS topped the consensus forecast. The Dow was flat, the S&P fell 0.3%, and the Nasdaq fell 0.4%. Crude oil fell nearly 1% to $81 per barrel, while gold traded near $1981 per ounce.",
            "tickers": [
                "CC",
                "GPN",
                "AGNC",
                "VLO",
                "DLR"
            ]
        },
        {
            "id": "4555_Analyst Report_1683136732000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2023-05-03T17:58:52Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers, with a market cap of $27 billion. It also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. Digital Realty helps customers develop secure networks and cloud-neutral data center platforms, and is at the forefront of the secular transition from on-premises data centers to cloud colocation centers. Given its substantial global presence, the company faces exchange rate risk. It continues to expand through M&A, joint ventures, and new development projects, while also recycling capital through asset sales. \r\n\r\nDLR is based in Austin, Texas, and operates 314 data centers in 27 countries. Domestic assets are concentrated in 50 metropolitan markets. About 60% of annual rents are from data centers greater than 1 megawatt. Recent acquisitions have included data center companies in Europe and Africa. The shares are a component of the S&P 500.",
            "targetPrice": 120.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "36356_Market Update_1683135832000",
            "headHtml": "Market Update: AMD, GPN, VIAV, MAT, SBUX, SYY, X, DLR, ELAN",
            "provider": "Argus Research",
            "reportDate": "2023-05-03T17:43:52Z",
            "reportTitle": "Stocks were little changed on Wednesday morning as investors awaited the Fed's interest rate announcement and follow-up comments from Fed Chair Jerome Powell. Employment data was strong. Payroll provider ADP said that U.S. companies added 296,000 jobs in April, up from 142,000 in March and above the Reuters consensus forecast of 148,000. The Dow fell 0.2%, the S&P was flat, and the Nasdaq fell 0.3%. Crude oil traded near $69 per barrel, while gold rose $7 to $2031 per ounce.",
            "tickers": [
                "VIAV",
                "MAT",
                "SYY",
                "ELAN",
                "GPN",
                "SBUX",
                "AMD",
                "X",
                "DLR"
            ]
        },
        {
            "id": "4555_Analyst Report_1677608553000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2023-02-28T18:22:33Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. It also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. Digital Realty helps customers develop secure networks and cloud-neutral data center platforms, and is at the forefront of the secular transition from on-premises data centers to cloud colocation centers. Given its substantial global presence, foreign exchange rates can affect earnings growth. The company continues to expand through M&A, joint ventures, and new development projects, while also recycling capital through asset sales. \r\n\r\nRecent acquisitions have included data center companies in Europe and Africa. The company purchased a majority interest in Teraco, a data center and colocation service provider in South Africa, in August 2022.\r\n\r\nDLR is based in Austin, Texas, and operates approximately 300 data centers in 27 countries. Domestic assets are concentrated in 50 metropolitan markets. About 60% of annual rents are from data centers greater than 1 megawatt.",
            "targetPrice": 120.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "35723_Market Update_1677607653000",
            "headHtml": "Market Update: IPG, PXD, DLR, ETSY",
            "provider": "Argus Research",
            "reportDate": "2023-02-28T18:07:33Z",
            "reportTitle": "Stocks were mixed on Tuesday morning as investors weighed new housing market and consumer confidence data. S&P Case-Shiller said that growth in U.S. home prices continued to slow. Prices rose 5.8% from the prior year in December, down from 7.6% growth in November and the smallest year-over-year gain since mid-2020. Consumer confidence fell. The Conference Board said that its consumer confidence index fell to 102.9 in February, down from 106.0 in January and below the Reuters consensus forecast of 108.5. On the earnings front, Target posted stronger-than-expected fiscal 4Q results but offered cautious full-year guidance. The Dow fell 0.3%, the S&P rose 0.1%, and the Nasdaq rose 0.2%. Crude oil rose 2% to $77 per barrel, while gold traded near $1832 per ounce.",
            "tickers": [
                "IPG",
                "ETSY",
                "DLR",
                "PXD"
            ]
        },
        {
            "id": "4555_Analyst Report_1667216353000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2022-10-31T11:39:13Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. It also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. Digital Realty helps customers develop secure networks and cloud-neutral data center platforms, and is at the forefront of the secular transition from on-premises data centers to cloud colocation centers. Given its substantial global presence, foreign exchange rates can affect earnings growth. The company continues to expand through M&A, joint ventures, and new development projects, while also recycling capital through asset sales. \r\n\r\nRecent acquisitions have included data center companies in Europe and Africa. The company purchased a majority interest in Teraco, a data center and colocation service provider in South Africa, in August 2022. \r\n\r\nDLR is based in Austin, Texas, and operates approximately 300 data centers in 27 countries. Domestic assets are concentrated in 50 metropolitan markets. About 60% of annual rents are from data centers greater than 1 megawatt.",
            "targetPrice": 120.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "34571_Market Summary_1667215453000",
            "headHtml": "Market Digest: NVS, ADM, AMP, AMZN, AVY, GE, HON, ITW, JNPR, LAZ, LUV, GM, META, HCA, DLR, PINS",
            "provider": "Argus Research",
            "reportDate": "2022-10-31T11:24:13Z",
            "reportTitle": "Monday Tee Up: The Fed, Jobs, Earnings Roll On",
            "tickers": [
                "META",
                "LAZ",
                "AMP",
                "AVY",
                "JNPR",
                "GM",
                "HON",
                "HCA",
                "ADM",
                "NVS",
                "DLR",
                "LUV",
                "ITW",
                "PINS",
                "AMZN",
                "GE"
            ]
        },
        {
            "id": "34168_Top/Bottom Insider Activity_1663669268000",
            "headHtml": "Daily – Vickers Top Buyers & Sellers for 09/20/2022",
            "provider": "Argus Research",
            "reportDate": "2022-09-20T10:21:08Z",
            "reportTitle": "The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions.",
            "tickers": [
                "THRD",
                "RILY",
                "GWRE",
                "MATV",
                "SKYT",
                "APG",
                "VRNT",
                "DLR",
                "OKTA",
                "WISH"
            ]
        },
        {
            "id": "33863_Thematic Portfolio_1660853633000",
            "headHtml": "The Argus High-Yield Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2022-08-18T20:13:53Z",
            "reportTitle": "Value stocks -- a market segment that includes high-yield stocks -- are outperforming growth stocks in 2022 for the first time since 2016. Indeed, for the past decade, the performance record has favored growth. In nine of the past 10 years, growth stocks have topped value stocks. But the tide may be turning. The rollout of COVID-19 vaccines has given a lift to some of the cyclical companies (energy companies and regional banks) that have lagged in recent quarters, and value stocks have kept up the pace with growth stocks in the past year. Now, the Federal Reserve lifting interest rates to fend off inflation, which will likely cap multiple expansion for growth companies. Regardless, the value sector is the place to achieve income. The current yield on the iShares Russell 1000 Value Index ETF is 2.1%, compared to the 0.8% current yield on the iShares Russell 1000 Growth Index ETF.  For our High-Yield Theme Model Portfolio, we are seeking stocks with yields of at least 3.0%.  This moves us deep into the value segment of the market.",
            "tickers": [
                "C",
                "CVX",
                "VZ",
                "AGNC",
                "DLR",
                "SPG",
                "SLF",
                "PPL",
                "PFE",
                "PRU",
                "LYB",
                "IBM",
                "VNO",
                "UL",
                "VLO",
                "NLY",
                "DUK",
                "SO",
                "SNY",
                "OMC",
                "BCE",
                "IP",
                "ABBV",
                "DOW",
                "PSX",
                "EIX",
                "BTI",
                "INTC",
                "XOM",
                "ENB",
                "GILD"
            ]
        },
        {
            "id": "4555_Analyst Report_1659979090000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2022-08-08T17:18:10Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. The REIT also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. Digital Realty helps customers develop secure networks and cloud-neutral data center platforms, and is at the forefront of the secular transition from on-premises data centers to cloud colocation centers. With its global presence, foreign exchange rates can affect earnings growth. The company continues to expand through M&A, joint ventures, and new development projects, while also recycling capital through asset sales. \r\n\r\nRecent acquisitions have included data center companies in Europe and Africa, including the purchase of a majority interest in Teraco, a data center and colocation service provider in South Africa, in August 2022. The company is based in Austin, Texas, and operates approximately 300 data centers in 27 countries. Domestic assets are concentrated in 50 metropolitan markets.",
            "targetPrice": 160.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "33741_Market Update_1659978190000",
            "headHtml": "Market Update: ENB, IPG, WDC, DLR",
            "provider": "Argus Research",
            "reportDate": "2022-08-08T17:03:10Z",
            "reportTitle": "Stocks rose on Monday morning as investors awaited key inflation data later in the week, including the July consumer price index on Wednesday. The current Bloomberg consensus calls for a year-over-year increase of 8.7% in the CPI, down from 9.1% in June due in part to lower gas prices. On the earnings front, Tyson shares fell more than 9% after the company reported below-consensus fiscal 3Q earnings, hurt by higher feed costs and the impact of rising meat prices on consumer spending. The Dow rose 0.8%, the S&P 0.8%, and the Nasdaq 1.1%. Crude oil fell slightly to $88.50 per barrel, while gold rose $13 to $1804 per ounce.",
            "tickers": [
                "IPG",
                "WDC",
                "ENB",
                "DLR"
            ]
        },
        {
            "id": "33083_Top/Bottom Insider Activity_1654063681000",
            "headHtml": "Daily – Vickers Top Buyers & Sellers for 06/01/2022",
            "provider": "Argus Research",
            "reportDate": "2022-06-01T06:08:01Z",
            "reportTitle": "The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions.",
            "tickers": [
                "KYMR",
                "FDP",
                "MCK",
                "ORI",
                "LLY",
                "RIVN",
                "CBSH",
                "DLR",
                "CMG",
                "CB"
            ]
        },
        {
            "id": "32997_Top/Bottom Insider Activity_1653288544000",
            "headHtml": "Daily – Vickers Top Buyers & Sellers for 05/23/2022",
            "provider": "Argus Research",
            "reportDate": "2022-05-23T06:49:04Z",
            "reportTitle": "The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions.",
            "tickers": [
                "TJX",
                "RDUS",
                "SWM",
                "CPNG",
                "PLD",
                "DLR",
                "K",
                "CMG",
                "ATEC"
            ]
        },
        {
            "id": "4555_Analyst Report_1651649068000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2022-05-04T07:24:28Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. The REIT also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. Digital Realty helps customers develop secure networks and cloud-neutral data center platforms, and is at the forefront of the secular transition from on-premises data centers to cloud colocation centers. With its global presence, foreign exchange rates can affect earnings growth. The company continues to expand through M&A, joint ventures, and new development projects, while also recycling capital through asset sales. The company is based in Austin, Texas, and operates in more than 42 metropolitan markets on five continents. Recent expansions have focused on Africa and Asia.",
            "targetPrice": 165.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "32810_Market Summary_1651648168000",
            "headHtml": "Market Digest: CLX, FIS, HON, INTC, ITW, KIM, QCOM, SIVB, STX, DLR",
            "provider": "Argus Research",
            "reportDate": "2022-05-04T07:09:28Z",
            "reportTitle": "April was a brutal month for stocks, with few equities escaping unscathed. The S&P 500 fell almost 11%, the Nasdaq and the QQQs both plummeted 15.6%, the DJIA fell 7%, the Russell 2000 tumbled 12.6%, and the S&P MidCap 400 dropped 10%. It was the worst month for the Nasdaq and QQQs since October 2008.  ",
            "tickers": [
                "FIS",
                "SIVB",
                "QCOM",
                "STX",
                "HON",
                "INTC",
                "DLR",
                "ITW",
                "CLX",
                "KIM"
            ]
        },
        {
            "id": "4555_Analyst Report_1645709895000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2022-02-24T13:38:15Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. Digital Realty Trust also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. The company is based in Austin, Texas, and operates in more than 42 metropolitan markets on five continents. Recent expansions have focused on Africa and Asia.",
            "targetPrice": 165.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "32233_Market Update_1645709895000",
            "headHtml": "Market Update: AMGN, CMI, LOW, CBOE, DLR",
            "provider": "Argus Research",
            "reportDate": "2022-02-24T13:38:15Z",
            "reportTitle": "Stocks fell on Thursday morning, but pared sharper early losses, as investors continued to watch the unfolding crisis in Ukraine. Russia launched a large-scale military attack on the country early Thursday morning, with shelling of the Ukrainian capital and other major cities. The attack ended weeks of diplomatic efforts to end the standoff. The U.S. and other Western countries are expected to announce additional sanctions on Russia later today. The Dow fell 1.8%, the S&P fell 0.9%, and the Nasdaq was flat. Crude oil jumped more than 6% to $98 per barrel, while gold rose $28 to $1939 per ounce.",
            "tickers": [
                "LOW",
                "CBOE",
                "DLR",
                "AMGN",
                "CMI"
            ]
        },
        {
            "id": "31685_Stock Picks_1639985968000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2021-12-20T07:39:28Z",
            "reportTitle": "Explosive growth in mobile and fixed-line traffic is driving demand for robust data centers that are enabled for artificial intelligence (AI) and can manage rising and increasingly-complex traffic flow. Two-thirds of the world will have internet access by 2023, while the number of connected devices is expected to grow to three-times the global population. IoT (machine to machine or M2M) connections are expected to grow at a 30% CAGR. Security is a top need, as \"denial of service\" attacks are set to double by 2023. To handle the challenges of managing, storing, and securing data amid this explosive traffic growth, data centers will need to harness the power of artificial intelligence. AI enhances data center capabilities though the power of machine learning, inference, and deep learning, all in an application-accelerated environment. The AI data center also makes use of non-traditional and emerging technologies that provide more computing power than traditional CPU-based architectures. These include GPU Compute from NVidia and Tensor cores from Google/Alphabet. As of mid-year 2021, about 600 hyperscale data centers were in operation around the world, up from about 500 at year-end 2019 and double the number from five years ago. The bulk of data center construction is by hyperscale providers including AWS from Amazon.com, Microsoft Azure, Google Cloud from Alphabet, as well as with Chinese companies including Baidu and Alibaba. Co-location companies are another major data center driver, including Equinix and Digital Realty Trust. International Business Machines is providing hybrid cloud services that bridge public and private clouds. Other data center suppliers include semiconductor companies Broadcom, Marvell Technology, Intel, and Advanced Micro Devices. Stocks on the Argus Research BUY list that are in position to benefit include the following.",
            "tickers": [
                "MSFT",
                "GOOGL",
                "NVDA",
                "AVGO",
                "IBM",
                "INTC",
                "AMD",
                "DLR",
                "EQIX",
                "AMZN",
                "MRVL"
            ]
        },
        {
            "id": "31551_Top/Bottom Insider Activity_1638513005000",
            "headHtml": "Daily – Vickers Top Buyers & Sellers for 12/03/2021",
            "provider": "Argus Research",
            "reportDate": "2021-12-03T06:30:05Z",
            "reportTitle": "The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions.",
            "tickers": [
                "ACVA",
                "OLMA",
                "NAUT",
                "KHC",
                "AESE",
                "STFC",
                "Y",
                "DNUT",
                "DOV",
                "DLR"
            ]
        },
        {
            "id": "4555_Analyst Report_1635752351000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2021-11-01T07:39:11Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. Digital Realty Trust also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. The company operates in more than 36 metropolitan markets on five continents. It is based in Austin, Texas.",
            "targetPrice": 180.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "31276_Market Summary_1635752351000",
            "headHtml": "Market Digest: BA, BMY, CME, GD, MCO, MRK, WDC, FB, DLR, LIN, CARR",
            "provider": "Argus Research",
            "reportDate": "2021-11-01T07:39:11Z",
            "reportTitle": "The stock market moved higher last week during the busiest days of earnings season. Tech stocks far outperformed blue chips, though a portion of the outperformance was attributable to Tesla, as its stock is included in the S&P 500 and Nasdaq Composite, but not the DJIA. During Friday's session, the Dow Jones Industrial Average increased 89 points, or 0.25%. The S&P 500 was up 0.19%, and the Nasdaq Composite was up 0.33%. For the week, the DJIA was up 143 points, or 0.40%, the S&P 500 was up 1.33%, and the Nasdaq Composite was up 2.70%. For the YTD, the DJIA is up 17.03%, the S&P 500 is up 22.61%, and the Nasdaq Composite is up 20.25%.",
            "tickers": [
                "LIN",
                "CARR",
                "META",
                "MRK",
                "WDC",
                "MCO",
                "CME",
                "DLR",
                "GD",
                "BA",
                "BMY"
            ]
        },
        {
            "id": "30806_Top/Bottom Insider Activity_1630653775000",
            "headHtml": "Daily – Vickers Top Buyers & Sellers for 09/03/2021",
            "provider": "Argus Research",
            "reportDate": "2021-09-03T07:22:55Z",
            "reportTitle": "The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions.",
            "tickers": [
                "QLYS",
                "AMAT",
                "SPNE",
                "FOA",
                "DNUT",
                "SMRT",
                "DLR",
                "VMC",
                "EVER",
                "CB"
            ]
        },
        {
            "id": "4555_Analyst Report_1628666343000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2021-08-11T07:19:03Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. Digital Realty Trust also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. The company operates in more than 36 metropolitan markets on five continents. It is based in Austin, Texas.",
            "targetPrice": 180.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "30601_Market Summary_1628665443000",
            "headHtml": "Market Digest: EOG, IART, VSH, DLR, CHTR, BHF, VNT",
            "provider": "Argus Research",
            "reportDate": "2021-08-11T07:04:03Z",
            "reportTitle": "Year-to-date sector leadership remains with the rotation favorites of early 2021. With the long bond spiking from 0.9% at year-end 2020 to 1.75% by the end of the first quarter, growth favorites retreated. But investors wanted to remain invested in equities in a reopening economy, and rotational favorites filled the void.",
            "tickers": [
                "BHF",
                "IART",
                "VSH",
                "DLR",
                "CHTR",
                "EOG",
                "VNT"
            ]
        },
        {
            "id": "4555_Analyst Report_1622638715000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2021-06-02T12:58:35Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. Digital Realty Trust also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. The company operates in more than 36 metropolitan markets on five continents. It is based in Austin, Texas.",
            "targetPrice": 180.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "30035_Market Update_1622637815000",
            "headHtml": "Market Update: TUP, DLR, CPRI",
            "provider": "Argus Research",
            "reportDate": "2021-06-02T12:43:35Z",
            "reportTitle": "Stocks rose modestly on Wednesday morning, led by the Technology and Energy sectors, as investors awaited the Fed's Beige Book report this afternoon and new employment data on Thursday and Friday. Meat producer JBS said that most of its beef, pork, and poultry plants would be operational on Wednesday after some production was stopped by a ransomware attack earlier in the week. The Dow rose 0.3%, the S&P 0.3%, and the Nasdaq 0.2%. Crude oil traded near $68 per barrel, while gold rose slightly to $1906 per ounce.",
            "tickers": [
                "DLR",
                "CPRI",
                "TUP"
            ]
        },
        {
            "id": "29819_Top/Bottom Insider Activity_1620371466000",
            "headHtml": "Daily – Vickers Top Buyers & Sellers for 05/07/2021",
            "provider": "Argus Research",
            "reportDate": "2021-05-07T07:11:06Z",
            "reportTitle": "The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions.",
            "tickers": [
                "RILY",
                "WY",
                "HCA",
                "EL",
                "SCHW",
                "AMG",
                "DLR",
                "FHN",
                "CYCN",
                "ATGE"
            ]
        },
        {
            "id": "29339_Top/Bottom Insider Activity_1615360505000",
            "headHtml": "Daily – Vickers Top Buyers & Sellers for 03/10/2021",
            "provider": "Argus Research",
            "reportDate": "2021-03-10T07:15:05Z",
            "reportTitle": "The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions.",
            "tickers": [
                "NTAP",
                "SNOW",
                "LLY",
                "TAST",
                "DLR",
                "KW",
                "VNDA",
                "BLI",
                "AMCX"
            ]
        },
        {
            "id": "29266_Top/Bottom Insider Activity_1614667148000",
            "headHtml": "Daily – Vickers Top Buyers & Sellers for 03/02/2021",
            "provider": "Argus Research",
            "reportDate": "2021-03-02T06:39:08Z",
            "reportTitle": "The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions.",
            "tickers": [
                "GOOG",
                "FLXS",
                "RHI",
                "CAR",
                "ATEX",
                "SLG-PI",
                "DLR",
                "SATS",
                "EVER",
                "KFY"
            ]
        },
        {
            "id": "4555_Analyst Report_1614065104000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2021-02-23T07:25:04Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. Digital Realty Trust also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. The company operates in more than 36 metropolitan markets on five continents. The company is headquartered in Austin, TX after relocating from San Francisco, CA in January 2021.",
            "targetPrice": 180.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "29208_Market Summary_1614064204000",
            "headHtml": "Market Digest: ATO, DE, HIG, LGF/A, MGM, MTB, NEM, DLR, BHF",
            "provider": "Argus Research",
            "reportDate": "2021-02-23T07:10:04Z",
            "reportTitle": "Insider sentiment continues to suggest a reasonable degree of caution. As we have said for several weeks now, this caution does not mean that a major correction is bound to occur. But it does suggest that there are few near-term catalysts that insiders see as likely to drive stock prices (around all-time highs already) quickly higher.  ",
            "tickers": [
                "BHF",
                "DE",
                "MGM",
                "HIG",
                "NEM",
                "MTB",
                "DLR",
                "ATO",
                "LGF-A"
            ]
        },
        {
            "id": "4555_Analyst Report_1605078153000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2020-11-11T07:02:33Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. Digital Realty Trust also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. The company operates in more than 36 metropolitan markets on five continents.",
            "targetPrice": 180.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "28394_Market Summary_1605078153000",
            "headHtml": "Market Digest: AIG, HSY, MDRX, NYT, PRGO, DISCA, DLR, HLT, MRNA",
            "provider": "Argus Research",
            "reportDate": "2020-11-11T07:02:33Z",
            "reportTitle": "A new era (kinda, sorta) has started, as Joe Biden has been declared the winner of the U.S. presidential election. The market responded positively to expected gridlock, with a Democratic president and the Republican senate forecast to relive the stalemate of the Obama years.",
            "tickers": [
                "HLT",
                "NYT",
                "MDRX",
                "DLR",
                "DISCA",
                "MRNA",
                "PRGO",
                "AIG",
                "HSY"
            ]
        },
        {
            "id": "4555_Analyst Report_1597044849000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2020-08-10T07:34:09Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. Digital Realty Trust also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. The company operates in more than 36 metropolitan markets on five continents.",
            "targetPrice": 180.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "27630_Market Summary_1597044849000",
            "headHtml": "Market Digest: BDX, MCHP, PCAR, TSCO, JCI, VLO, WDC, XOM, DLR, CPRI",
            "provider": "Argus Research",
            "reportDate": "2020-08-10T07:34:09Z",
            "reportTitle": "Stocks were mixed on Friday, capping a strong week for the major indices. This week's rally favored value names over growth names, with blue chips outperforming tech stocks. On Friday, The Dow Jones Industrial Average gained 47 points, or 0.2%. The S&P 500 added 0.1% while the Nasdaq Composite fell 0.9%. For the full week, the Dow gained 3.8%. The S&P 500 and the Nasdaq were both up 2.5%. For the year-to-date, the Dow is down 3.9%, while the S&P is up 3.7% and the Nasdaq is up 22.7%. Over the past 52 weeks, the Dow is up 4.4%, the S&P 14.8%, and the Nasdaq 38.3%. ",
            "tickers": [
                "JCI",
                "PCAR",
                "BDX",
                "XOM",
                "WDC",
                "VLO",
                "MCHP",
                "DLR",
                "CPRI",
                "TSCO"
            ]
        },
        {
            "id": "27630_Market Summary_1597017600000",
            "headHtml": "Market Digest: BDX, MCHP, PCAR, TSCO, JCI, VLO, WDC, XOM, DLR, CPRI",
            "provider": "Argus Research",
            "reportDate": "2020-08-10T00:00:00Z",
            "reportTitle": "Stocks were mixed on Friday, capping a strong week for the major indices. This week's rally favored value names over growth names, with blue chips outperforming tech stocks. On Friday, The Dow Jones Industrial Average gained 47 points, or 0.2%. The S&P 500 added 0.1% while the Nasdaq Composite fell 0.9%. For the full week, the Dow gained 3.8%. The S&P 500 and the Nasdaq were both up 2.5%. For the year-to-date, the Dow is down 3.9%, while the S&P is up 3.7% and the Nasdaq is up 22.7%. Over the past 52 weeks, the Dow is up 4.4%, the S&P 14.8%, and the Nasdaq 38.3%. ",
            "tickers": [
                "JCI",
                "PCAR",
                "BDX",
                "XOM",
                "WDC",
                "VLO",
                "MCHP",
                "DLR",
                "CPRI",
                "TSCO"
            ]
        },
        {
            "id": "4555_Analyst Report_1597017600000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2020-08-10T00:00:00Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. Digital Realty Trust also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. The company operates in more than 36 metropolitan markets on five continents.",
            "targetPrice": 180.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "27519_Thematic Portfolio_1595603604000",
            "headHtml": "The Argus Innovation Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2020-07-24T15:13:24Z",
            "reportTitle": "Innovation may be hard to define but, to borrow from former U.S. Supreme Court Justice Potter Stewart, you know it when you see it. The United States economy is full of innovation. It has to be. Manufacturing industries that dominated the economy decades ago - textiles, televisions, even automobiles, to a large degree - have moved overseas, where costs are lower. Yet the U.S. economy, prior to the pandemic, had expanded to record levels. And now the U.S. Healthcare industry is mobilizing to improve COVID-19 testing, treatments and, ultimately, a vaccine. If U.S. corporations weren't innovating, creating new products and services and moving into new markets and applications, the domestic economy would not have recently completed a 10-year expansion phase before the coronavirus hit, and capital would not be flooding into the country. A couple of statistics should help illustrate our point. Consider that U.S. GDP was approximately $1 trillion in 1930 but nearly $22 trillion in 2019. That's growth of 22-times. Meanwhile, the U.S. population has grown less than 3-times during that time span, to 320 million from 120 million. The delta between GDP growth and population growth has been driven in large part by innovation. In addition, the value of listed corporations on U.S. stock exchanges at the end of 2018 was approximately $32 trillion, representing 41% of global equity market capitalization, while U.S. GDP represented only 25% of global GDP.",
            "tickers": [
                "BLK",
                "GOOGL",
                "DE",
                "AAPL",
                "ADI",
                "FISV",
                "DLR",
                "ITW",
                "COST",
                "V",
                "EBS",
                "LLY",
                "PYPL",
                "META",
                "NVDA",
                "ADSK",
                "CTLT",
                "ICE",
                "ECL",
                "NEE",
                "TECH",
                "PG",
                "NOW",
                "TMO",
                "ADBE",
                "MCO",
                "INCY",
                "AMZN",
                "ODFL",
                "CRM"
            ]
        },
        {
            "id": "27519_Thematic Portfolio_1595548800000",
            "headHtml": "The Argus Innovation Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2020-07-24T00:00:00Z",
            "reportTitle": "Innovation may be hard to define but, to borrow from former U.S. Supreme Court Justice Potter Stewart, you know it when you see it. The United States economy is full of innovation. It has to be. Manufacturing industries that dominated the economy decades ago - textiles, televisions, even automobiles, to a large degree - have moved overseas, where costs are lower. Yet the U.S. economy, prior to the pandemic, had expanded to record levels. And now the U.S. Healthcare industry is mobilizing to improve COVID-19 testing, treatments and, ultimately, a vaccine. If U.S. corporations weren't innovating, creating new products and services and moving into new markets and applications, the domestic economy would not have recently completed a 10-year expansion phase before the coronavirus hit, and capital would not be flooding into the country. A couple of statistics should help illustrate our point. Consider that U.S. GDP was approximately $1 trillion in 1930 but nearly $22 trillion in 2019. That's growth of 22-times. Meanwhile, the U.S. population has grown less than 3-times during that time span, to 320 million from 120 million. The delta between GDP growth and population growth has been driven in large part by innovation. In addition, the value of listed corporations on U.S. stock exchanges at the end of 2018 was approximately $32 trillion, representing 41% of global equity market capitalization, while U.S. GDP represented only 25% of global GDP.",
            "tickers": [
                "BLK",
                "GOOGL",
                "DE",
                "AAPL",
                "ADI",
                "FISV",
                "DLR",
                "ITW",
                "COST",
                "V",
                "EBS",
                "LLY",
                "PYPL",
                "NVDA",
                "ADSK",
                "CTLT",
                "ICE",
                "ECL",
                "NEE",
                "TECH",
                "PG",
                "NOW",
                "TMO",
                "ADBE",
                "MCO",
                "INCY",
                "FB",
                "AMZN",
                "ODFL",
                "CRM"
            ]
        },
        {
            "id": "4555_Analyst Report_1594214547000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2020-07-08T13:22:27Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. Digital Realty Trust also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. The company operates in more than 35 metropolitan markets on five continents.",
            "targetPrice": 165.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "27375_Market Update_1594213647000",
            "headHtml": "Market Update: DLR",
            "provider": "Argus Research",
            "reportDate": "2020-07-08T13:07:27Z",
            "reportTitle": "Stocks gave up early gains on Wednesday morning as coronavirus cases continued to surge. In all, new cases in the U.S. topped the 3 million mark, as several states set new daily records. On a positive note, Biogen shares rose nearly 5% after the company submitted its application for Alzheimer's drug aducanumab to the FDA. The Dow fell 0.2%, the S&P fell 0.2%, and the Nasdaq rose 0.1%. Crude oil traded near $41 per barrel, while gold rose $12 to $1882 per ounce.",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "27375_Market Update_1594166400000",
            "headHtml": "Market Update: DLR",
            "provider": "Argus Research",
            "reportDate": "2020-07-08T00:00:00Z",
            "reportTitle": "Stocks gave up early gains on Wednesday morning as coronavirus cases continued to surge. In all, new cases in the U.S. topped the 3 million mark, as several states set new daily records. On a positive note, Biogen shares rose nearly 5% after the company submitted its application for Alzheimer's drug aducanumab to the FDA. The Dow fell 0.2%, the S&P fell 0.2%, and the Nasdaq rose 0.1%. Crude oil traded near $41 per barrel, while gold rose $12 to $1882 per ounce.",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Analyst Report_1594166400000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2020-07-08T00:00:00Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. Digital Realty Trust also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. The company operates in more than 35 metropolitan markets on five continents.",
            "targetPrice": 165.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Analyst Report_1585897454000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2020-04-03T07:04:14Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. Digital Realty Trust also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. The company operates in more than 35 metropolitan markets on five continents.",
            "targetPrice": 148.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "26591_Market Summary_1585896554000",
            "headHtml": "Market Digest: ADI, DLR, J",
            "provider": "Argus Research",
            "reportDate": "2020-04-03T06:49:14Z",
            "reportTitle": "Stocks rose on Thursday as higher oil prices, helped by expectations for a production cut by Russia and Saudi Arabia, outweighed skyrocketing first-time jobless claims. The run-up in crude oil came after President Trump tweeted that he had spoken to the leaders of Russia and Saudi Arabia and expected both countries to announce production cuts. The Labor Department said that first-time unemployment benefit claims soared to 6.648 million for the week ended March 28, up from 3.307 million a week earlier and well above the consensus estimate of 3.5 million. The data came ahead of the government's March employment report on Friday morning. The consensus calls for a loss of 100,000 payroll jobs last month after a gain of 273,000 in February, and an unemployment rate of 3.8%. However, the report is based on data collected earlier in the month and does not capture the accelerating impact of the coronavirus. The Dow rose 2.24%, the S&P 2.28%, and the Nasdaq 1.72%. Crude oil rose to nearly $25 per barrel, while gold rose $47 to $1639 per ounce.",
            "tickers": [
                "ADI",
                "J",
                "DLR"
            ]
        },
        {
            "id": "26591_Market Summary_1585872000000",
            "headHtml": "Market Digest: ADI, DLR, J",
            "provider": "Argus Research",
            "reportDate": "2020-04-03T00:00:00Z",
            "reportTitle": "Stocks rose on Thursday as higher oil prices, helped by expectations for a production cut by Russia and Saudi Arabia, outweighed skyrocketing first-time jobless claims. The run-up in crude oil came after President Trump tweeted that he had spoken to the leaders of Russia and Saudi Arabia and expected both countries to announce production cuts. The Labor Department said that first-time unemployment benefit claims soared to 6.648 million for the week ended March 28, up from 3.307 million a week earlier and well above the consensus estimate of 3.5 million. The data came ahead of the government's March employment report on Friday morning. The consensus calls for a loss of 100,000 payroll jobs last month after a gain of 273,000 in February, and an unemployment rate of 3.8%. However, the report is based on data collected earlier in the month and does not capture the accelerating impact of the coronavirus. The Dow rose 2.24%, the S&P 2.28%, and the Nasdaq 1.72%. Crude oil rose to nearly $25 per barrel, while gold rose $47 to $1639 per ounce.",
            "tickers": [
                "ADI",
                "J",
                "DLR"
            ]
        },
        {
            "id": "4555_Analyst Report_1585872000000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2020-04-03T00:00:00Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. Digital Realty Trust also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. The company operates in more than 35 metropolitan markets on five continents.",
            "targetPrice": 148.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "26413_Technical Analysis_1583996656000",
            "headHtml": "Technical Assessment: Neutral in the Intermediate-Term",
            "provider": "Argus Research",
            "reportDate": "2020-03-12T07:04:16Z",
            "reportTitle": "The S&P 500 fell 4.9% on Wednesday, and undercut its recent lows on an intraday basis. The index rallied late in the day, closing near key support in the 2,730/2,740 region. The index has gone from all-time highs to down 19% in 15 days. The 14-day RSI cycled into extreme oversold condition in late February and is now working on a potential bullish divergence.",
            "tickers": [
                "LLY",
                "DLR"
            ]
        },
        {
            "id": "26413_Technical Analysis_1583971200000",
            "headHtml": "Technical Assessment: Neutral in the Intermediate-Term",
            "provider": "Argus Research",
            "reportDate": "2020-03-12T00:00:00Z",
            "reportTitle": "The S&P 500 fell 4.9% on Wednesday, and undercut its recent lows on an intraday basis. The index rallied late in the day, closing near key support in the 2,730/2,740 region. The index has gone from all-time highs to down 19% in 15 days. The 14-day RSI cycled into extreme oversold condition in late February and is now working on a potential bullish divergence.",
            "tickers": [
                "LLY",
                "DLR"
            ]
        },
        {
            "id": "4555_Analyst Report_1574752283000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2019-11-26T07:11:23Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. Digital Realty Trust also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. The company operates in more than 35 metropolitan markets on five continents.",
            "targetPrice": 130.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "25559_Market Summary_1574751383000",
            "headHtml": "Market Digest: ARNC, DLR",
            "provider": "Argus Research",
            "reportDate": "2019-11-26T06:56:23Z",
            "reportTitle": "Earnings season has come and gone, and the volume of insider transactions is not just back to normal -- it is exceeding recent patterns. This gives increased significance to any sentiment trends that come from trades made by corporate executives, directors and beneficial owners. This week, some 1661 insider transactions met the criteria for inclusion in Vickers Weekly Insider Report. The last time we saw this level of trading volume was back in May -- so transaction activity is brisk. That said, what is this activity telling us?",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "25559_Market Summary_1574726400000",
            "headHtml": "Market Digest: ARNC, DLR",
            "provider": "Argus Research",
            "reportDate": "2019-11-26T00:00:00Z",
            "reportTitle": "Earnings season has come and gone, and the volume of insider transactions is not just back to normal -- it is exceeding recent patterns. This gives increased significance to any sentiment trends that come from trades made by corporate executives, directors and beneficial owners. This week, some 1661 insider transactions met the criteria for inclusion in Vickers Weekly Insider Report. The last time we saw this level of trading volume was back in May -- so transaction activity is brisk. That said, what is this activity telling us?",
            "tickers": [
                "ARNC",
                "DLR"
            ]
        },
        {
            "id": "4555_Analyst Report_1574726400000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2019-11-26T00:00:00Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. Digital Realty Trust also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. The company operates in more than 35 metropolitan markets on five continents.",
            "targetPrice": 130.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "25263_Technical Analysis_1571641657000",
            "headHtml": "Technical Assessment: Bullish in the Intermediate-Term",
            "provider": "Argus Research",
            "reportDate": "2019-10-21T07:07:37Z",
            "reportTitle": "Approach, retreat; approach, retreat. The minuet around the 3,000 level for the S&P 500 continues. When the index approached 3,000 for the first time in mid-July, we reminded investors that first-time crossovers at key millennial marks frequently are followed by retracements. The S&P 500 briefly reclaimed the 3,000 summit in mid-September but could not keep its footing. Here in mid-October, stocks spent a maddening week again flirting with 3,000 but not quite crossing the threshold.",
            "tickers": [
                "VIAV",
                "DLR"
            ]
        },
        {
            "id": "25247_Thematic Portfolio_1571323196000",
            "headHtml": "The Argus Innovation Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2019-10-17T14:39:56Z",
            "reportTitle": "Innovation may be hard to define but, to borrow from former U.S. Supreme Court Justice Potter Stewart, you know it when you see it. The United States economy is full of innovation. It has to be. Manufacturing industries that dominated the economy decades ago - textiles, televisions, even automobiles, to a large degree - have moved overseas, where costs are lower. Yet the U.S. economy has expanded to record levels and is still growing. If U.S. corporations weren't innovating, creating new products and services and moving into new markets and applications, the domestic economy would be contracting, not expanding, and capital would not be flooding into the country. A couple of statistics should help illustrate our point: Consider that U.S. GDP was approximately $1 trillion in 1930 but nearly $20.7 trillion in 2018. That's growth of 21x. Meanwhile, the U.S. population has grown less than 3x during that time span, to 320 million from 120 million. The delta between GDP growth and population growth has been driven in large part by innovation. In addition, the value of listed corporations on U.S. stock exchanges at the end of 2018 was approximately $31 trillion, representing 41% of global equity market capitalization, while U.S. GDP represented only 15% of global GDP.",
            "tickers": [
                "GOOGL",
                "CSCO",
                "CVX",
                "ADI",
                "MRK",
                "DLR",
                "COST",
                "V",
                "BDX",
                "CME",
                "LHX",
                "PYPL",
                "META",
                "NVDA",
                "SYK",
                "ADSK",
                "HON",
                "ILMN",
                "ECL",
                "IQV",
                "NEE",
                "TECH",
                "ROP",
                "NOW",
                "TMO",
                "ADBE",
                "MCO",
                "PGR",
                "AMZN",
                "CRM"
            ]
        },
        {
            "id": "4555_Analyst Report_1570107791000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2019-10-03T13:03:11Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. Digital Realty Trust also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. The company operates in more than 35 metropolitan markets on five continents.",
            "targetPrice": 140.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "25125_Market Update_1570106891000",
            "headHtml": "Market Update: DLR",
            "provider": "Argus Research",
            "reportDate": "2019-10-03T12:48:11Z",
            "reportTitle": "Stocks recovered from early losses on Thursday morning, led by the Real Estate and Consumer Staples sectors, though economic data was weak. The Institute for Supply Management said that its U.S. nonmanufacturing index fell 3.8 points to 52.6 in September, below the Reuters consensus estimate of 55.0 and the lowest reading since August 2016. The Commerce Department also reported that factory orders fell 0.1% in August, slightly better than the consensus forecast, but down sharply from 1.4% growth in July. Orders for core capital goods also fell 0.4% in August, down from a previously reported 0.2% decline. The Dow rose 0.1%, the S&P 0.3%, and the Nasdaq 0.5%. Crude oil traded near $52 per barrel, while gold rose $9 to trade near $1517 per ounce",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "25125_Market Update_1570060800000",
            "headHtml": "Market Update: DLR",
            "provider": "Argus Research",
            "reportDate": "2019-10-03T00:00:00Z",
            "reportTitle": "Stocks recovered from early losses on Thursday morning, led by the Real Estate and Consumer Staples sectors, though economic data was weak. The Institute for Supply Management said that its U.S. nonmanufacturing index fell 3.8 points to 52.6 in September, below the Reuters consensus estimate of 55.0 and the lowest reading since August 2016. The Commerce Department also reported that factory orders fell 0.1% in August, slightly better than the consensus forecast, but down sharply from 1.4% growth in July. Orders for core capital goods also fell 0.4% in August, down from a previously reported 0.2% decline. The Dow rose 0.1%, the S&P 0.3%, and the Nasdaq 0.5%. Crude oil traded near $52 per barrel, while gold rose $9 to trade near $1517 per ounce",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Analyst Report_1570060800000",
            "headHtml": "Analyst Report: Digital Realty Trust Inc",
            "provider": "Argus Research",
            "reportDate": "2019-10-03T00:00:00Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. Digital Realty Trust also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. The company operates in more than 35 metropolitan markets on five continents.",
            "targetPrice": 140.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "24806_Stock Picks_1566829108000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2019-08-26T14:18:28Z",
            "reportTitle": "Innovation may be hard to define but, to borrow from former U.S. Supreme Court Justice Potter Stewart, you know it when you see it.  The United States economy is full of innovation. It has to be. Manufacturing industries that dominated the economy decades ago - textiles, televisions, even automobiles, to a large degree - have moved overseas, where costs are lower. Yet the U.S. economy is at its largest point in history and still growing.  If U.S. corporations weren't innovating, creating new products and services and moving into new markets and applications, the domestic economy would be contracting, not expanding, and capital would not be flooding into the country. Particularly at this juncture of the market and economic cycles, when tension is high due to trade wars and uncertainty over the Federal Reserve, we look to innovative companies to successfully navigate the challenges. At Argus, an 80-year-old independent research firm that has innovated a time or two in its long history, we have focused on four types of innovative companies: Industry Disruptors; First to Market; New Product Specialists; and Product & Process Perfectors. The following innovative, BUY-rated stocks were recently added to our Growth Model Portfolio, our new Innovative Growth Separately Managed Account and our Modern Innovators UIT.  The full list of stocks can also be found in our Innovation Theme Model Portfolio.",
            "tickers": [
                "META",
                "MRK",
                "PGR",
                "DLR",
                "LHX"
            ]
        },
        {
            "id": "24806_Stock Picks_1566777600000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2019-08-26T00:00:00Z",
            "reportTitle": "Innovation may be hard to define but, to borrow from former U.S. Supreme Court Justice Potter Stewart, you know it when you see it.  The United States economy is full of innovation. It has to be. Manufacturing industries that dominated the economy decades ago - textiles, televisions, even automobiles, to a large degree - have moved overseas, where costs are lower. Yet the U.S. economy is at its largest point in history and still growing.  If U.S. corporations weren't innovating, creating new products and services and moving into new markets and applications, the domestic economy would be contracting, not expanding, and capital would not be flooding into the country. Particularly at this juncture of the market and economic cycles, when tension is high due to trade wars and uncertainty over the Federal Reserve, we look to innovative companies to successfully navigate the challenges. At Argus, an 80-year-old independent research firm that has innovated a time or two in its long history, we have focused on four types of innovative companies: Industry Disruptors; First to Market; New Product Specialists; and Product & Process Perfectors. The following innovative, BUY-rated stocks were recently added to our Growth Model Portfolio, our new Innovative Growth Separately Managed Account and our Modern Innovators UIT.  The full list of stocks can also be found in our Innovation Theme Model Portfolio.",
            "tickers": [
                "MRK",
                "PGR",
                "DLR",
                "FB",
                "LHX"
            ]
        },
        {
            "id": "4555_Analyst Report_1562136676000",
            "headHtml": "Initiating coverage on fast-growing data center REIT",
            "provider": "Argus Research",
            "reportDate": "2019-07-03T06:51:16Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. Digital Realty Trust also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. The company operates in more than 35 metropolitan markets on five continents.",
            "targetPrice": 140.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "24368_Market Summary_1562135776000",
            "headHtml": "Market Digest: DLR",
            "provider": "Argus Research",
            "reportDate": "2019-07-03T06:36:16Z",
            "reportTitle": "Investors went into the final weekend in June fretting about the G-20 gathering. President Trump's meeting with President Putin could shape the narrative around the 2020 election, while his meeting with Xi Jinping could set the trade agenda and influence the economy for years to come. Much of that fear is gone this morning, it seems.",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Analyst Report_1562112000000",
            "headHtml": "Initiating coverage on fast-growing data center REIT",
            "provider": "Argus Research",
            "reportDate": "2019-07-03T00:00:00Z",
            "reportTitle": "Digital Realty Trust is a real estate investment trust focusing on interconnected data centers. Digital Realty Trust also develops data center platforms for businesses involved in cloud software, IT, financial services, social media, and mobile services. The company operates in more than 35 metropolitan markets on five continents.",
            "targetPrice": 140.0,
            "investmentRating": "Bullish",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "24368_Market Summary_1562112000000",
            "headHtml": "Market Digest: DLR",
            "provider": "Argus Research",
            "reportDate": "2019-07-03T00:00:00Z",
            "reportTitle": "Investors went into the final weekend in June fretting about the G-20 gathering. President Trump's meeting with President Putin could shape the narrative around the 2020 election, while his meeting with Xi Jinping could set the trade agenda and influence the economy for years to come. Much of that fear is gone this morning, it seems.",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1561593600000",
            "headHtml": "Lowering target price to $123.000000",
            "provider": "Argus Research",
            "reportDate": "2019-06-27T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $123.000000; an Industry Subrating of Medium; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of N/A; a Growth Subrating of Medium; and a Value Subrating of Medium.",
            "targetPrice": 123.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1560902400000",
            "headHtml": "Raising target price to $130.00",
            "provider": "Argus Research",
            "reportDate": "2019-06-19T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $130.00; an Industry Subrating of Medium; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 130.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1560297600000",
            "headHtml": "Raising target price to $125.00",
            "provider": "Argus Research",
            "reportDate": "2019-06-12T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $125.00; an Industry Subrating of High; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 125.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1559692800000",
            "headHtml": "Lowering target price to $121.00",
            "provider": "Argus Research",
            "reportDate": "2019-06-05T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $121.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of Medium.",
            "targetPrice": 121.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1559001600000",
            "headHtml": "Lowering target price to $123.00",
            "provider": "Argus Research",
            "reportDate": "2019-05-28T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $123.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 123.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1558483200000",
            "headHtml": "What does Argus have to say about DLR?",
            "provider": "Argus Research",
            "reportDate": "2019-05-22T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $124.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 124.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1557878400000",
            "headHtml": "Raising target price to $124.00",
            "provider": "Argus Research",
            "reportDate": "2019-05-15T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $124.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 124.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1557360000000",
            "headHtml": "Lowering target price to $123.00",
            "provider": "Argus Research",
            "reportDate": "2019-05-09T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $123.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 123.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1556668800000",
            "headHtml": "Lowering target price to $124.00",
            "provider": "Argus Research",
            "reportDate": "2019-05-01T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $124.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 124.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1556064000000",
            "headHtml": "What does Argus have to say about DLR?",
            "provider": "Argus Research",
            "reportDate": "2019-04-24T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $125.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 125.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1555459200000",
            "headHtml": "Lowering target price to $125.00",
            "provider": "Argus Research",
            "reportDate": "2019-04-17T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $125.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 125.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1554854400000",
            "headHtml": "What does Argus have to say about DLR?",
            "provider": "Argus Research",
            "reportDate": "2019-04-10T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $128.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 128.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1554249600000",
            "headHtml": "Raising target price to $128.00",
            "provider": "Argus Research",
            "reportDate": "2019-04-03T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $128.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 128.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1553040000000",
            "headHtml": "What does Argus have to say about DLR?",
            "provider": "Argus Research",
            "reportDate": "2019-03-20T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $122.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Low; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 122.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1552435200000",
            "headHtml": "Raising target price to $122.00",
            "provider": "Argus Research",
            "reportDate": "2019-03-13T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $122.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Low; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 122.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1551830400000",
            "headHtml": "Lowering target price to $119.00",
            "provider": "Argus Research",
            "reportDate": "2019-03-06T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $119.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Low; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 119.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1551225600000",
            "headHtml": "Lowering target price to $121.00",
            "provider": "Argus Research",
            "reportDate": "2019-02-27T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $121.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Low; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 121.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1550620800000",
            "headHtml": "Raising target price to $124.00",
            "provider": "Argus Research",
            "reportDate": "2019-02-20T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $124.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 124.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1550016000000",
            "headHtml": "Raising target price to $118.00",
            "provider": "Argus Research",
            "reportDate": "2019-02-13T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $118.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 118.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1549411200000",
            "headHtml": "What does Argus have to say about DLR?",
            "provider": "Argus Research",
            "reportDate": "2019-02-06T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $113.00; an Industry Subrating of N/A; a Management Subrating of N/A; a Safety Subrating of Low; a Financial Strength Subrating of N/A; a Growth Subrating of N/A; and a Value Subrating of N/A.",
            "targetPrice": 113.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1548806400000",
            "headHtml": "Raising target price to $113.00",
            "provider": "Argus Research",
            "reportDate": "2019-01-30T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $113.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 113.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1548201600000",
            "headHtml": "Lowering target price to $109.00",
            "provider": "Argus Research",
            "reportDate": "2019-01-23T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $109.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 109.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1547596800000",
            "headHtml": "Raising target price to $112.00",
            "provider": "Argus Research",
            "reportDate": "2019-01-16T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $112.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 112.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1547078400000",
            "headHtml": "Lowering target price to $107.00",
            "provider": "Argus Research",
            "reportDate": "2019-01-10T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $107.00; an Industry Subrating of N/A; a Management Subrating of N/A; a Safety Subrating of Low; a Financial Strength Subrating of N/A; a Growth Subrating of N/A; and a Value Subrating of N/A.",
            "targetPrice": 107.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1546387200000",
            "headHtml": "Raising target price to $112.00",
            "provider": "Argus Research",
            "reportDate": "2019-01-02T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $112.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 112.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1545782400000",
            "headHtml": "Lowering target price to $110.00",
            "provider": "Argus Research",
            "reportDate": "2018-12-26T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $110.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 110.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1545177600000",
            "headHtml": "Lowering target price to $114.00",
            "provider": "Argus Research",
            "reportDate": "2018-12-19T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $114.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 114.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        },
        {
            "id": "4555_Quantitative Report_1544572800000",
            "headHtml": "Raising target price to $121.00",
            "provider": "Argus Research",
            "reportDate": "2018-12-12T00:00:00Z",
            "reportTitle": "DIGITAL REALTY TRUST INC has an Investment Rating of HOLD; a target price of $121.00; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Low; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High.",
            "targetPrice": 121.0,
            "investmentRating": "Neutral",
            "tickers": [
                "DLR"
            ]
        }
    ],
    "sigDevs": [
        {
            "headline": "Digital Realty Trust Q1 Adjusted FFO Per Share USD 1.67",
            "date": "2024-05-02"
        }
    ],
    "secReports": [
        {
            "id": "0001558370-24-006671_1297996",
            "type": "Periodic Financial Reports",
            "title": "10-Q : Periodic Financial Reports",
            "description": "Quarterly report pursuant to Section 13 or 15(d)",
            "filingDate": 1714694400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000155837024006671/thumbnail.png",
            "formType": "10-Q"
        },
        {
            "id": "0001558370-24-006558_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1714608000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001297996/000155837024006558/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001308179-24-000607_1297996",
            "type": "Proxy Statements",
            "title": "DEF 14A : Proxy Statements",
            "description": "Definitive proxy statements",
            "filingDate": 1714089600000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001297996/000130817924000607/thumbnail.png",
            "formType": "DEF 14A"
        },
        {
            "id": "0001308179-24-000608_1297996",
            "type": "Proxy Statements",
            "title": "DEFA14A : Proxy Statements",
            "description": "Definitive additional proxy soliciting materials including Rule 14(a)(12) material. Note: Submission type DEFA14A can be filed as part of Form 8-K. For filers subject to 8-K filing requirements we recommend the use of the 8-K combined form type as the easiest method for fulfilling your filing requirement for both forms",
            "filingDate": 1714089600000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001297996/000130817924000608/thumbnail.png",
            "formType": "DEFA14A"
        },
        {
            "id": "0001558370-24-005623_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1713916800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000155837024005623/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-24-044680_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1708646400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000119312524044680/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001558370-24-001575_1297996",
            "type": "Periodic Financial Reports",
            "title": "10-K : Periodic Financial Reports",
            "description": "Annual report pursuant to Section 13 and 15(d)",
            "filingDate": 1708646400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000155837024001575/thumbnail.png",
            "formType": "10-K"
        },
        {
            "id": "0001558370-24-001242_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1707955200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001297996/000155837024001242/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001284812-24-000135_1297996",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13G/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities by passive investors and certain institutions",
            "filingDate": 1707868800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001297996/000128481224000135/thumbnail.png",
            "formType": "SC 13G/A"
        },
        {
            "id": "0001558370-23-019694_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1701993600000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000155837023019694/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001558370-23-019629_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1701907200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000155837023019629/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001558370-23-018593_1297996",
            "type": "Periodic Financial Reports",
            "title": "10-Q : Periodic Financial Reports",
            "description": "Quarterly report pursuant to Section 13 or 15(d)",
            "filingDate": 1699488000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001297996/000155837023018593/thumbnail.png",
            "formType": "10-Q"
        },
        {
            "id": "0001558370-23-016866_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1698278400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001297996/000155837023016866/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001558370-23-014995_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1692057600000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000155837023014995/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-23-204023_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1691107200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000119312523204023/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001558370-23-013321_1297996",
            "type": "Periodic Financial Reports",
            "title": "10-Q : Periodic Financial Reports",
            "description": "Quarterly report pursuant to Section 13 or 15(d)",
            "filingDate": 1691107200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000155837023013321/thumbnail.png",
            "formType": "10-Q"
        },
        {
            "id": "0001558370-23-012400_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1690416000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001297996/000155837023012400/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001558370-23-011039_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1686614400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001297996/000155837023011039/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-23-161886_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1686096000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000119312523161886/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001558370-23-010809_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1685923200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000155837023010809/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001558370-23-010667_1297996",
            "type": "Proxy Statements",
            "title": "DEFA14A : Proxy Statements",
            "description": "Definitive additional proxy soliciting materials including Rule 14(a)(12) material. Note: Submission type DEFA14A can be filed as part of Form 8-K. For filers subject to 8-K filing requirements we recommend the use of the 8-K combined form type as the easiest method for fulfilling your filing requirement for both forms",
            "filingDate": 1685491200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001297996/000155837023010667/thumbnail.png",
            "formType": "DEFA14A"
        },
        {
            "id": "0001558370-23-008142_1297996",
            "type": "Periodic Financial Reports",
            "title": "10-Q : Periodic Financial Reports",
            "description": "Quarterly report pursuant to Section 13 or 15(d)",
            "filingDate": 1683158400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000155837023008142/thumbnail.png",
            "formType": "10-Q"
        },
        {
            "id": "0001308179-23-000815_1297996",
            "type": "Proxy Statements",
            "title": "DEF 14A : Proxy Statements",
            "description": "Definitive proxy statements",
            "filingDate": 1682640000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001297996/000130817923000815/thumbnail.png",
            "formType": "DEF 14A"
        },
        {
            "id": "0001558370-23-007069_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1682553600000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001297996/000155837023007069/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-23-088804_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1680480000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000119312523088804/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-23-072616_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1678924800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000119312523072616/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-23-071993_1297996",
            "type": "Offering Registrations",
            "title": "S-3ASR : Offering Registrations",
            "description": "Automatic shelf registration statement of securities of well-known seasoned issuers",
            "filingDate": 1678924800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000119312523071993/thumbnail.png",
            "formType": "S-3ASR"
        },
        {
            "id": "0001558370-23-003480_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1678406400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000155837023003480/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001558370-23-002087_1297996",
            "type": "Periodic Financial Reports",
            "title": "10-K : Periodic Financial Reports",
            "description": "Annual report pursuant to Section 13 and 15(d)",
            "filingDate": 1677456000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000155837023002087/thumbnail.png",
            "formType": "10-K"
        },
        {
            "id": "0001558370-23-001449_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1676505600000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001297996/000155837023001449/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001284812-23-000061_1297996",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13G/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities by passive investors and certain institutions",
            "filingDate": 1676332800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001297996/000128481223000061/thumbnail.png",
            "formType": "SC 13G/A"
        },
        {
            "id": "0001422849-23-000105_1297996",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13G/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities by passive investors and certain institutions",
            "filingDate": 1676246400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001422849/000142284923000105/thumbnail.png",
            "formType": "SC 13G/A"
        },
        {
            "id": "0001284812-23-000040_1297996",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13G : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities by passive investors and certain institutions",
            "filingDate": 1675987200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001297996/000128481223000040/thumbnail.png",
            "formType": "SC 13G"
        },
        {
            "id": "0001104659-23-015785_1297996",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13G/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities by passive investors and certain institutions",
            "filingDate": 1675900800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001297996/000110465923015785/thumbnail.png",
            "formType": "SC 13G/A"
        },
        {
            "id": "0001193125-23-008415_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1673568000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000119312523008415/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-23-003582_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1672963200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000119312523003582/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-23-003587_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K/A : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1672963200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000119312523003587/thumbnail.png",
            "formType": "8-K/A"
        },
        {
            "id": "0001193125-22-303909_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1670889600000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000119312522303909/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-22-299444_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1670284800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000119312522299444/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-22-298462_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1670198400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000119312522298462/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-22-293930_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1669680000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000119312522293930/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001558370-22-016456_1297996",
            "type": "Periodic Financial Reports",
            "title": "10-Q : Periodic Financial Reports",
            "description": "Quarterly report pursuant to Section 13 or 15(d)",
            "filingDate": 1667520000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000155837022016456/thumbnail.png",
            "formType": "10-Q"
        },
        {
            "id": "0001558370-22-015692_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1667260800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000155837022015692/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001558370-22-015409_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1666742400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001297996/000155837022015409/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-22-252135_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1664236800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000119312522252135/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001558370-22-014276_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1662595200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000155837022014276/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001558370-22-013757_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1660694400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000155837022013757/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001558370-22-012450_1297996",
            "type": "Periodic Financial Reports",
            "title": "10-Q : Periodic Financial Reports",
            "description": "Quarterly report pursuant to Section 13 or 15(d)",
            "filingDate": 1659657600000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000155837022012450/thumbnail.png",
            "formType": "10-Q"
        },
        {
            "id": "0001558370-22-011371_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1659052800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001494877/000155837022011371/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001558370-22-011281_1297996",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1658966400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001297996/000155837022011281/thumbnail.png",
            "formType": "8-K"
        }
    ]
}