{
    "4169632": {
        "id": 4169632,
        "significance": "3",
        "headline": "Devon Energy Announces 22% Increase In Qtrly Dividend",
        "description": "Feb 18 (Reuters) - Devon Energy Corp <DVN.N>::DEVON ENERGY ANNOUNCES 22 PERCENT INCREASE IN QUARTERLY DIVIDEND.DEVON ENERGY CORP - NEW QUARTERLY DIVIDEND RATE WILL BE $0.11 PER SHARE.",
        "parentTopics": "Performance"
    },
    "4227667": {
        "id": 4227667,
        "significance": "3",
        "headline": "Devon Energy Announces Third-Quarter 2020 Cash Dividend For Common Stockholders",
        "description": "June 3 (Reuters) - Devon Energy Corp <DVN.N>::DEVON ENERGY ANNOUNCES THIRD-QUARTER 2020 CASH DIVIDEND FOR COMMON STOCKHOLDERS.DEVON ENERGY CORP - DIVIDEND IS PAYABLE ON SEPT. 30, 2020, AT A RATE OF $0.11 PER SHARE.",
        "parentTopics": "Performance"
    },
    "4255136": {
        "id": 4255136,
        "significance": "1",
        "headline": "Devon Energy Provides Barnett Update, Announces Special Dividend And Outlines Next Steps In Cost-Reduction Plan",
        "description": "Aug 4 (Reuters) - Devon Energy Corp <DVN.N>::DEVON ENERGY PROVIDES BARNETT UPDATE, ANNOUNCES SPECIAL DIVIDEND AND OUTLINES NEXT STEPS IN COST-REDUCTION PLAN.DEVON ENERGY CORP - BOARD OF DIRECTORS DECLARES A $100 MILLION SPECIAL DIVIDEND IN CONJUNCTION WITH BARNETT CLOSING.DEVON ENERGY CORP - EXPECT TO ACHIEVE $300 MILLION OF SUSTAINABLE CASH COST SAVINGS BY YEAR-END.DEVON ENERGY CORP - PLAN TO USE CASH ON HAND TO REPURCHASE UP TO $1.5 BILLION OF ADDITIONAL DEBT.DEVON ENERGY CORP - ACCELERATING BARNETT SHALE CLOSING TO OCT. 1, 2020, FROM PREVIOUSLY SCHEDULED DATE OF DEC. 31, 2020.DEVON ENERGY CORP - COST-REDUCTION PLAN INCLUDES SEVERAL ACTIONS TO BETTER ALIGN WORKFORCE WITH GO-FORWARD ACTIVITY LEVELS.DEVON ENERGY CORP - DEBT-REDUCTION PROGRAM IS EXPECTED TO RESULT IN A GO-FORWARD INTEREST SAVINGS OF APPROXIMATELY $75 MILLION ON AN ANNUAL RUN-RATE BASIS.DEVON ENERGY CORP - REDUCTION OF CASH COSTS ACROSS EXPECTED TO DRIVE DOWN PER-UNIT EXPENSES BY INCREMENTAL 10% VERSUS Q2 2020 RESULTS.",
        "parentTopics": "Performance"
    },
    "4276069": {
        "id": 4276069,
        "significance": "3",
        "headline": "Devon Energy Announces Fourth-Quarter 2020 Cash Dividend For Common Stockholders",
        "description": "Sept 16 (Reuters) - Devon Energy Corp <DVN.N>::DEVON ENERGY ANNOUNCES FOURTH-QUARTER 2020 CASH DIVIDEND FOR COMMON STOCKHOLDERS.DEVON ENERGY CORP - DIVIDEND IS PAYABLE ON DEC. 30, 2020, AT A RATE OF $0.11 PER SHARE.",
        "parentTopics": "Performance"
    },
    "4279891": {
        "id": 4279891,
        "significance": "1",
        "headline": "Devon Energy And Wpx Energy To Combine In Merger Of Equals",
        "description": "Sept 28 (Reuters) - Devon Energy Corp <DVN.N>::DEVON ENERGY AND WPX ENERGY TO COMBINE IN MERGER OF EQUALS, CREATING A LEADING ENERGY COMPANY FOCUSED ON GENERATING FREE CASH FLOW AND RETURN OF CAPITAL TO SHAREHOLDERS.DEVON ENERGY - WPX SHAREHOLDERS WILL RECEIVE A FIXED EXCHANGE RATIO OF 0.5165 SHARES OF DEVON COMMON STOCK FOR EACH SHARE OF WPX COMMON STOCK OWNED.DEVON ENERGY CORP - DEAL FOR ENTERPRISE VALUE FOR COMBINED ENTITY OF APPROXIMATELY $12 BILLION.DEVON ENERGY CORP - DAVE HAGER TO SERVE AS EXECUTIVE CHAIRMAN OF BOARD; RICK MUNCRIEF TO SERVE AS PRESIDENT AND CEO.DEVON ENERGY CORP - ALL-STOCK TRANSACTION ACCRETIVE TO PER-SHARE METRICS IN YEAR ONE AND MAINTAINS FINANCIAL STRENGTH.DEVON ENERGY CORP - UPON COMPLETION OF TRANSACTION, DEVON SHAREHOLDERS WILL OWN APPROXIMATELY 57 PERCENT OF COMBINED COMPANY.DEVON ENERGY CORP - WPX SHAREHOLDERS WILL OWN APPROXIMATELY 43 PERCENT OF COMBINED COMPANY.DEVON ENERGY - FUNDS MANAGED BY ENCAP INVESTMENTS OWN ABOUT 27% OF WPX SHARES & ENTERED INTO SUPPORT AGREEMENT TO VOTE IN FAVOR OF TRANSACTION.DEVON ENERGY - FOLLOWING MERGER, BOARD OF DIRECTORS WILL CONSIST OF 12 MEMBERS, 7 DIRECTORS FROM CO & 5 FROM WPX INCLUDING LEAD INDEPENDENT DIRECTOR.DEVON ENERGY CORP - COMBINED CO'S EXECUTIVE TEAM WILL INCLUDE JEFF RITENOUR AS EXECUTIVE VICE PRESIDENT AND CFO.DEVON ENERGY CORP - COMBINED COMPANY WILL BE HEADQUARTERED IN OKLAHOMA CITY.",
        "parentTopics": "Performance"
    },
    "4464055": {
        "id": 4464055,
        "significance": "1",
        "headline": "Devon Energy Says Authorized A $1 Bln Share-Repurchase Program Through Year-End 2022",
        "description": "Nov 2 (Reuters) - Devon Energy Corp <DVN.N>::DEVON ENERGY CORP - BOARD AUTHORIZES A $1.0 BILLION SHARE-REPURCHASE PROGRAM THROUGH YEAR-END 2022.",
        "parentTopics": "Ownership\\/Control"
    },
    "4506295": {
        "id": 4506295,
        "significance": "3",
        "headline": "Devon Energy Announces Fourth-Quarter Dividend And Next Steps In Cash-Return Strategy",
        "description": "Feb 15 (Reuters) - Devon Energy Corp <DVN.N>::DEVON ENERGY ANNOUNCES FOURTH-QUARTER DIVIDEND AND NEXT STEPS IN CASH-RETURN STRATEGY.DEVON ENERGY CORP - SHARE-REPURCHASE AUTHORIZATION INCREASED BY 60 PERCENT TO $1.6 BILLION.DEVON ENERGY CORP - FOURTH-QUARTER DIVIDEND PAYOUT IMPROVED TO RECORD HIGH OF $1.00 PER SHARE.",
        "parentTopics": "Performance"
    },
    "4539376": {
        "id": 4539376,
        "significance": "1",
        "headline": "Devon Energy Posts Q1 Net Earnings of $1.48 Per Diluted Share",
        "description": "May 2 (Reuters) - Devon Energy Corp <DVN.N>::DEVON ENERGY REPORTS FIRST-QUARTER 2022 FINANCIAL AND OPERATIONAL RESULTS.NET EARNINGS OF $1.0 BILLION, OR $1.48 PER DILUTED SHARE, IN THE FIRST QUARTER OF 2022.DELAWARE BASIN PRODUCTION GROWTH AND MARGIN EXPANSION DROVE FIRST-QUARTER FINANCIAL PERFORMANCE.FIRST-QUARTER DIVIDEND PAYOUT INCREASED BY 27 PERCENT TO $1.27 PER SHARE.ADJUSTING FOR ITEMS ANALYSTS TYPICALLY EXCLUDE FROM ESTIMATES, THE COMPANY’S CORE EARNINGS WERE $1.88 PER DILUTED SHARE IN Q1.PRODUCTION AVERAGED 575,000 OIL-EQUIVALENT BARRELS PER DAY IN THE FIRST QUARTER, WITH OIL ACCOUNTING FOR 50% OF THE VOLUME.INTENDS TO FURTHER IMPROVE ITS FINANCIAL STRENGTH BY RETIRING LOW-PREMIUM DEBT OF ABOUT $1.0 BILLION IN 2022 AND 2023.IS ON TRACK TO MEET THE STRATEGIC OBJECTIVES THAT UNDERPIN ITS OPERATING PLAN IN 2022.Q1 EARNINGS PER SHARE VIEW $1.75 -- REFINITIV IBES DATA.DEVON ENERGY - HAS NOT MADE ANY MODIFICATIONS TO PREVIOUSLY ANNOUNCED PLAN TO SUSTAIN PRODUCTION IN RANGE OF 570,000 TO 600,000 BOE PER DAY IN 2022.",
        "parentTopics": "Performance"
    },
    "4539380": {
        "id": 4539380,
        "significance": "3",
        "headline": "Devon Energy Announces First-Quarter Dividend, Increases Share-Repurchase Authorization To $2.0 Billion",
        "description": "May 2 (Reuters) - Devon Energy Corp <DVN.N>::DEVON ENERGY ANNOUNCES FIRST-QUARTER DIVIDEND, INCREASES SHARE-REPURCHASE AUTHORIZATION TO $2.0 BILLION.",
        "parentTopics": "Performance"
    },
    "4556729": {
        "id": 4556729,
        "significance": "1",
        "headline": "Devon Energy Announces Bolt-On Acquisition In The Williston Basin",
        "description": "Devon Energy Corp <DVN.N>::DEVON ENERGY ANNOUNCES BOLT-ON ACQUISITION IN THE WILLISTON BASIN.DEVON ENERGY CORP - DEAL FOR CONSIDERATION OF $865 MILLION.DEVON ENERGY CORP - TRANSACTION IMMEDIATELY ACCRETIVE TO FINANCIAL METRICS.DEVON ENERGY CORP - BOARD INTENDS TO APPROVE A 13 PERCENT INCREASE TO FIXED QUARTERLY DIVIDEND DUE TO ACCRETIVE NATURE OF TRANSACTION.DEVON ENERGY CORP - ALSO EXPECTS TRANSACTION TO BE ACCRETIVE TO VARIABLE DIVIDEND PAYOUT IN 2022 AND BEYOND.DEVON ENERGY CORP - ESTIMATES APPROXIMATELY $100 MILLION OF CAPITAL EXPENDITURES TO BE INCURRED POST-CLOSING IN 2022 IN WILLISTON BASIN.",
        "parentTopics": "Financing"
    },
    "4580327": {
        "id": 4580327,
        "significance": "1",
        "headline": "Devon Energy Announces Bolt-On Acquisition In The Eagle Ford",
        "description": "Aug 9 (Reuters) - Devon Energy Corp <DVN.N>::DEVON ENERGY ANNOUNCES BOLT-ON ACQUISITION IN THE EAGLE FORD.DEVON ENERGY CORP - TO ACQUIRE VALIDUS ENERGY, AN EAGLE FORD OPERATOR, FOR TOTAL CASH CONSIDERATION OF $1.8 BILLION.DEVON ENERGY CORP - DEAL IMMEDIATELY ACCRETIVE TO FINANCIAL METRICS.DEVON ENERGY CORP - ACQUISITION IS EXPECTED TO BE IMMEDIATELY ACCRETIVE TO ALL RELEVANT PER-SHARE METRICS IN FIRST YEAR.DEVON - DUE TO ACCRETIVE NATURE OF DEAL TO FREE CASH FLOW, OUTLOOK FOR CO'S VARIABLE DIVIDEND INCREASES BY UP TO 10% ON PER-SHARE BASIS AT STRIP PRICING.DEVON ENERGY  - EXPECTS TO REALIZE $50 MILLION IN AVERAGE ANNUAL CASH FLOW SAVINGS FROM CAPITAL EFFICIENCIES, OPERATING IMPROVEMENTS, MARKETING SYNERGIES.",
        "parentTopics": "Performance"
    },
    "4660310": {
        "id": 4660310,
        "significance": "1",
        "headline": "Devon Energy Reports Fourth-Quarter Results",
        "description": "Feb 14 (Reuters) - Devon Energy Corp <DVN.N>::DEVON ENERGY REPORTS FOURTH-QUARTER AND FULL-YEAR 2022 RESULTS; DECLARES QUARTERLY DIVIDEND AND RAISES FIXED DIVIDEND BY 11 PERCENT IN 2023.FOR THE FULL-YEAR 2023, DEVON EXPECTS TO SUSTAIN PRODUCTION IN THE RANGE OF 643,000 TO 663,000 BOE PER DAY.TOTAL CAPITAL  INVESTMENT FOR THE YEAR IS EXPECTED TO RANGE FROM $3.6 BILLION TO $3.8 BILLION.CAPITAL REQUIREMENTS IN 2023 ARE ESTIMATED TO BE SELF-FUNDED AT PRICING LEVELS AS LOW AS A $40 WTI OIL PRICE.FIRST-QUARTER PRODUCTION IS EXPECTED TO APPROXIMATE 635,000 BOE PER DAY.QTRLY TOTAL PRODUCTION AVERAGED 636,000 OIL-EQUIVALENT BARRELS (BOE)\\/DAY VERSUS 611,000 BOE\\/D IN Q4 2021.QTRLY CORE EARNINGS WERE $1.1 BILLION, OR $1.66 PER DILUTED SHARE.DEVON REPORTED NET EARNINGS OF $1.2 BILLION, OR $1.83 PER DILUTED SHARE, IN THE FOURTH QUARTER OF 2022.QTRLY TOTAL REVENUES $4,299 MILLION VERSUS$4,273 MILLION AS REPORTED LAST YEAR.PROVED RESERVES INCREASED 12 PERCENT TO 1.8 BILLION BOE AT YEAR-END 2022.BOARD APPROVED AN 11 PERCENT INCREASE TO THE FIXED QUARTERLY DIVIDEND IN 2023.Q4 EARNINGS PER SHARE VIEW $1.75, REVENUE VIEW $4.39 BILLION -- REFINITIV IBES DATA.QTRLY DILUTED NET EARNINGS PER SHARE $1.83.",
        "parentTopics": "Performance"
    },
    "4705230": {
        "id": 4705230,
        "significance": "1",
        "headline": "Devon Energy Q1 Adj. EPS Beats Expectations",
        "description": "May 8 (Reuters) - Devon Energy Q1 dividend USD 0.72.:.",
        "parentTopics": "Performance"
    },
    "4742735": {
        "id": 4742735,
        "significance": "1",
        "headline": "Devon Energy Q2 Adjusted EPS USD 1.18 Vs. IBES Estimate USD 1.18",
        "description": "Aug 01 (Reuters) - Devon Energy Q2 adjusted free cash flow USD 1,400 million.:.",
        "parentTopics": "Performance"
    },
    "4785863": {
        "id": 4785863,
        "significance": "1",
        "headline": "Devon Energy Q3 Adjusted EPS USD 1.65 Vs. IBES Estimate USD 1.57",
        "description": "Nov 07 (Reuters) - Devon Energy Q3 EPS USD 1.42.:.",
        "parentTopics": "Performance"
    },
    "4829355": {
        "id": 4829355,
        "significance": "1",
        "headline": "Devon Energy Q4 Adjusted EPS USD 1.41 Vs. IBES Estimate USD 1.41",
        "description": "Feb 27 (Reuters) - Devon Energy Q4 dividend USD 0.44.:.",
        "parentTopics": "Performance"
    }
}