{
    "symbol": "ENB",
    "instrumentInfo": {
        "technicalEvents": {
            "provider": "Trading Central",
            "sector": "Energy",
            "shortTermOutlook": {
                "stateDescription": "Recent bullish events outweigh bearish events.",
                "direction": "Bullish",
                "score": 3,
                "scoreDescription": "Strong Bullish Evidence",
                "sectorDirection": "Bearish",
                "sectorScore": 2,
                "sectorScoreDescription": "Bearish Evidence",
                "indexDirection": "Bearish",
                "indexScore": 3,
                "indexScoreDescription": "Strong Bearish Evidence"
            },
            "intermediateTermOutlook": {
                "stateDescription": "Recent bullish events outweigh bearish events.",
                "direction": "Bullish",
                "score": 4,
                "scoreDescription": "Very Strong Bullish Evidence",
                "sectorDirection": "Bullish",
                "sectorScore": 2,
                "sectorScoreDescription": "Bullish Evidence",
                "indexDirection": "Bearish",
                "indexScore": 4,
                "indexScoreDescription": "Very Strong Bearish Evidence"
            },
            "longTermOutlook": {
                "stateDescription": "Recent bullish events outweigh bearish events.",
                "direction": "Bullish",
                "score": 2,
                "scoreDescription": "Bullish Evidence",
                "sectorDirection": "Bullish",
                "sectorScore": 3,
                "sectorScoreDescription": "Strong Bullish Evidence",
                "indexDirection": "Bullish",
                "indexScore": 1,
                "indexScoreDescription": "Weak Bullish Evidence"
            }
        },
        "keyTechnicals": {
            "provider": "Trading Central",
            "support": 35.36,
            "resistance": 35.945,
            "stopLoss": 34.107098
        },
        "valuation": {
            "color": 0.0,
            "description": "Overvalued",
            "discount": "-16%",
            "relativeValue": "Premium",
            "provider": "Trading Central"
        }
    },
    "companySnapshot": {
        "sectorInfo": "Energy",
        "company": {
            "innovativeness": 0.5514,
            "sustainability": 0.0882,
            "insiderSentiments": 0.2407,
            "dividends": 0.6825
        },
        "sector": {
            "innovativeness": 0.5,
            "hiring": 0.5,
            "sustainability": 0.5,
            "insiderSentiments": 0.5,
            "earningsReports": 0.5,
            "dividends": 0.5
        }
    },
    "recommendation": {
        "targetPrice": 48.0,
        "provider": "Argus Research",
        "rating": "BUY"
    },
    "upsell": {
        "msBullishSummary": [
            "Enbridge is the liquids-focused version of gas-oriented Williams in terms of an attractive, highly regulated, utilitylike earnings profile.",
            "Enbridge offers a highly secure dividend that can increase 3% annually for the foreseeable future.",
            "The cancelation of Keystone XL puts Enbridge in a leading position to capture new organic pipeline expansions to serve the unmet needs of producers."
        ],
        "msBearishSummary": [
            "Due to its size and profile, Enbridge is a lightning rod for ESG-related legal and stakeholder challenges across its assets, including Lines 3 and 5 and its small stake in the troubled Dakota Access pipeline.",
            "Enbridge's pipelines carry substantial amounts of oil produced in the Canadian oil sands, one of the least environmentally friendly sources of production.",
            "Enbridge has yet to build a moaty renewables business, risking its capital investment here over the next few years."
        ],
        "companyName": "Enbridge Inc",
        "msBullishBearishSummariesPublishDate": 1713547769000,
        "upsellReportType": "MORNINGSTAR_ANALYST"
    },
    "upsellSearchDD": {
        "researchReports": {
            "reportId": "MS_0P000001XR_AnalystReport_1713547769000",
            "provider": "Morningstar",
            "title": "Israel’s Response to Iran’s Strike Confirms Minimal Escalation View; Oil Markets Remain Oversupplied",
            "reportDate": "2024-04-19T17:29:29Z",
            "summary": "Enbridge owns extensive midstream assets that transport hydrocarbons across the US and Canada. Its pipeline network consists of the Canadian Mainline system, regional oil sands pipelines, and natural gas pipelines. The company also owns and operates a regulated natural gas utility and Canada’s largest natural gas distribution company. The firm has a small renewables portfolio primarily focused on onshore and offshore wind projects.  ",
            "investmentRating": "Bullish"
        }
    },
    "events": [
        {
            "eventType": "Triple Moving Average Crossover",
            "pricePeriod": "D",
            "tradingHorizon": "S",
            "tradeType": "L",
            "imageUrl": "https://s.yimg.com/uc/fin/img/assets/generic.svg",
            "startDate": 1714397400,
            "endDate": 1714397400
        }
    ],
    "reports": [
        {
            "id": "39840_Stock Picks_1714390272000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2024-04-29T11:31:12Z",
            "reportTitle": "Energy may be an Under-Weight sector based on our model, but that doesn't mean it shouldn't be in diversified portfolios. Energy now accounts for 3.7% of S&P 500 market cap; over the past five years, the weighting has ranged from 2% to 10%. We think investors should consider allocating 3%-4% of their diversified portfolios to the Energy group. The sector is outperforming thus far in 2024, with a gain of 14.8% compared to a 7.4% increase in the S&P 500. It underperformed in 2023, with a decline of 4.8%. The sector includes the major integrated firms, as well as exploration & production, refining, and oilfield & drilling services companies. Here are the Energy companies that either are on our Focus List or are used in our model portfolios.",
            "tickers": [
                "HAL",
                "CVX",
                "PSX",
                "COP",
                "XOM",
                "SLB",
                "ENB",
                "VLO",
                "SHEL",
                "MRO",
                "NFG"
            ]
        },
        {
            "id": "3799_Analyst Report_1709835825000",
            "headHtml": "Analyst Report: Enbridge Inc",
            "provider": "Argus Research",
            "reportDate": "2024-03-07T18:23:45Z",
            "reportTitle": "Enbridge Inc. is North America's largest energy infrastructure company. Enbridge has six operating segments: Liquids Pipelines, Gas Transmission & Midstream, Gas Distribution, Renewable Power Generation & Transmission, Energy Services, and Eliminations & Other. Its regulated utilities serve approximately 3.7 million retail customers.",
            "targetPrice": 48.0,
            "investmentRating": "Bullish",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "39330_Market Update_1709834925000",
            "headHtml": "Market Update: ENB, CIEN, BBWI, APO",
            "provider": "Argus Research",
            "reportDate": "2024-03-07T18:08:45Z",
            "reportTitle": "U.S. stocks rose on Thursday morning as investors digested new economic data. Last week's initial jobless claims were 217,000, unchanged from the prior week's revised level. Ongoing unemployment was 1,906,000, an increase of 8,000 from the previous week's re-vised level. That leaves the insured unemployment rate at 1.3%. The international trade deficit widened to 67.4 billion in January according to the U.S. Bureau of Economic Analysis. Exports inched up by $0.3 billion, with automobiles and parts exports rising $1.4 billion while industrial supplies and material exports fell $1.7 billion. The S&P 500 rose 0.9%, the Dow 0.3% and the Nasdaq gained 1.4%. Crude oil traded just above $79 per barrel, while gold rose $7 to $2165 per ounce.",
            "tickers": [
                "APO",
                "CIEN",
                "ENB",
                "BBWI"
            ]
        },
        {
            "id": "39258_Market Outlook_1709207325000",
            "headHtml": "Daily Spotlight: Fed's Favorite Inflation Indicator Out Today",
            "provider": "Argus Research",
            "reportDate": "2024-02-29T11:48:45Z",
            "reportTitle": "The Federal Reserve's favorite inflation indicator, the PCE Price Index, will be released by the Bureau of Economic Analysis (BEA) this morning. The PCE differs from the better-known Consumer Price Index (CPI) in that its composition is changed more frequently and is quicker to reflect the impact of real-time pricing fluctuations. In the most-recent report, through December, PCE inflation was reported at 2.6% (the latest CPI report, through January, had inflation at 3.1%). Core PCE, which removes volatile food and energy prices, was 2.9% in the latest month, down from 3.2% in the prior month. Our forecasts call for 2.3% for the headline number and 2.8% for the core reading. Overall, inflation in this cycle peaked in summer 2022 and has been on a downward trek, though the rate of decline is stalling. We track 20 inflation measures on a monthly basis. On average, they currently indicate that prices are rising at a 2.55% rate year-over-year, down slightly from 2.61% a month ago.  The numbers are distorted somewhat by a sharp decline in Producer Price Intermediate Goods, which are falling at a 15% rate and likely point to easing prices across the inflation spectrum in the months ahead.  Focusing on core inflation -- which we obtain by averaging Core CPI, market-based PCE Ex-Food & Energy, the core GDP PCE Price Index, the five-year forward inflation expectation rate and  the 10-year TIPs Break-even Interest Rate -- our reading is 2.67%, down seven basis points month-over-month. That's lower largely because, at long last, sticky prices like shelter and transportation are starting to ease. Investors are expecting that the Federal Reserve's series of rate hikes ultimately will tame inflation, with the five-year forward expectation rate at 2.26%.",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "39247_Thematic Portfolio_1709130218000",
            "headHtml": "The Argus High-Yield Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2024-02-28T14:23:38Z",
            "reportTitle": "Value stocks -- a market segment that includes high-yield stocks -- outperformed growth stocks in 2022. That's a recent rarity, as for the past decade-plus, the performance record has favored growth. But the tide turned in 2022. The rollout of COVID-19 vaccines gave a lift to some of the cyclical companies (energy and regional banks) that had lagged in recent quarters, and value stocks outpaced growth stocks that year. While growth stocks have retaken the lead since 2023, the Federal Reserve continues to keep interest rates high to fend off inflation. This could possibly cap multiple expansion for growth companies in coming quarters. In any event, the value sector is the place to achieve income.",
            "tickers": [
                "C",
                "CVX",
                "LAZ",
                "VZ",
                "F",
                "K",
                "SPG",
                "SLF",
                "PFE",
                "TFC",
                "PRU",
                "GLW",
                "LYB",
                "IBM",
                "VLO",
                "DUK",
                "SO",
                "SNY",
                "OMC",
                "BCE",
                "CCI",
                "QSR",
                "LMT",
                "PSX",
                "EIX",
                "XOM",
                "ENB",
                "GILD",
                "PM",
                "KEY"
            ]
        },
        {
            "id": "39217_Stock Picks_1708951050000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2024-02-26T12:37:30Z",
            "reportTitle": "Value stocks -- a market segment that includes high-yield stocks -- outperformed growth stocks in 2022. That's a recent rarity, as for more than a decade, the performance record favored growth. Since 2010, the Russell 1000 Growth Index has climbed more than 575%, compared to an advance of almost 200% for the Russell 1000 Value Index. In 10 of the past 13 years, growth stocks have topped value stocks.  That hasn't always been the case. In the 2000-2010 decade, including the Great Recession, value stocks were better performers than growth stocks, advancing an admittedly low 8% (but still better than growth, which declined 15% during the decade). Value investors trace their roots to the famous \"Security Analysis\" textbook, written by Ben Graham, an economics professor at Columbia University.  Warren Buffett was one of his students. Why the recent deviation in performance? Several reasons, including changes in the make-up of the economy, growth in intangible assets, and the current level of interest rates. But the tide turned back in 2022, at least for a while, as the rollout of COVID-19 vaccines gave a lift to some of the cyclical companies (energy and regional banks) that had lagged in recent years. While growth stocks have recaptured the lead since 2023, the Federal Reserve continues to keep interest rates high to fend off inflation. This could possibly cap multiple expansion for growth companies in coming quarters. In any event, the value sector is the place to achieve income. The current yield on the iShares Russell 1000 Value Index ETF is 2.0%, compared to the 0.7% current yield on the iShares Russell 1000 Growth Index ETF. For our list this week, we have screened our coverage universe for stocks that are BUY-rated by Argus Research analysts, have an Argus Financial Strength Rating of at least Medium, and have a yield of 3.0% or higher. Here's a baker's dozen that meet the criteria. These stocks are also featured in our High-Yield theme model portfolio.",
            "tickers": [
                "C",
                "VZ",
                "BCE",
                "F",
                "CCI",
                "SPG",
                "PFE",
                "PRU",
                "PSX",
                "EIX",
                "IBM",
                "ENB",
                "GILD",
                "PM"
            ]
        },
        {
            "id": "39172_Market Outlook_1708516145000",
            "headHtml": "Daily Spotlight: Which is the Best Alternative?",
            "provider": "Argus Research",
            "reportDate": "2024-02-21T11:49:05Z",
            "reportTitle": "Alternative investments often are added to diversified portfolios in order to hedge against stock- and bond-market weakness, and reduce the riskiness of overall portfolio returns. At least that's what the textbooks say. Real-time market performance can often be another matter. Of all the alternatives in the marketplace, oil and gold often zig when the broad U.S. equity market zags, and can serve as relatively dependable alternative options. For example, in 2022, the S&P 500 plunged 19% while oil prices rose 4% and gold was steady. Last year was a strong year for stocks, and oil tumbled. Of course, there are years when all move in lockstep, such as 2019, when the three assets increased in the range of 20%-30%. For our asset allocation models in our Investment Portfolio Guide, we typically have alternatives constitute up to 2%-4% of the portfolios. And, given the early stage of the current equity bull market, we recommend an under-weighting in alternatives. While we still think it is early to be adding volatile Bitcoin-related securities to our model portfolios, we are encouraged about the long-term opportunities for blockchain technology. Though performing well this year, Bitcoin lost 65% in 2022. That stings. We will re-consider an exposure to cryptocurrencies once the sector approaches total market capitalization of $5 trillion, or when the regulatory outlook becomes clearer.",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "38435_Stock Picks_1701695016000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2023-12-04T13:03:36Z",
            "reportTitle": "Global stocks are picking up the pace. While the S&P 500 has jumped almost 11% in the past month, the EAFA index of large- and mid-cap stocks based in countries other than the U.S. and Canada has risen 10%. Over the past six years, the performance gap has been wider, with the S&P 500 advancing 12% compared to a 7% gain for the EAFE. But the underperformance has given global stocks a valuation advantage, particularly in the area of dividends. The EAFE dividend yield of 2.4% is 80 basis points higher than the comparable S&P 500 dividend yield. We think global dividend stocks now offer opportunity, particularly given the endless speculation over the direction of interest rates in the U.S., which has created market-timing headaches for equity income investors. Those investors have endured recent wide swings in prices for rate-sensitive equity sectors such as Utilities, REITs and MLPs. In our view, investing in international income stocks is one way to increase portfolio diversification while reducing sensitivity to volatile U.S interest rates. Investing in overseas stocks carries its own set of risks, including the impact of currency exchange and geopolitical turmoil. But there are also a number of positives in this asset class for U.S. investors, including a wide selection of companies that pay dividends, robust industry diversification, and, as we have mentioned, higher yields and lower valuations. Argus has recently boosted its global coverage, and recommends the following international dividend stocks, each of which has at least a long-term HOLD rating from an Argus analyst.",
            "tickers": [
                "NVO",
                "RY",
                "NVS",
                "BHP",
                "SLF",
                "RHHBY",
                "BP",
                "ASML",
                "BUD",
                "CCEP",
                "UL",
                "SHEL",
                "GSK",
                "SNY",
                "BABA",
                "BCE",
                "NXPI",
                "LRLCY",
                "CP",
                "DEO",
                "TSM",
                "AZN",
                "BTI",
                "ENB",
                "ALC",
                "RIO",
                "CNI"
            ]
        },
        {
            "id": "3799_Analyst Report_1701278435000",
            "headHtml": "Analyst Report: Enbridge Inc",
            "provider": "Argus Research",
            "reportDate": "2023-11-29T17:20:35Z",
            "reportTitle": "Enbridge Inc. is North America's largest energy infrastructure company. Enbridge has six operating segments: Liquids Pipelines, Gas Transmission & Midstream, Gas Distribution, Renewable Power Generation & Transmission, Energy Services, and Eliminations & Other. Its regulated utilities serve approximately 3.7 million retail customers.",
            "targetPrice": 48.0,
            "investmentRating": "Bullish",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "38405_Market Update_1701277535000",
            "headHtml": "Market Update: ENB, EOG, EQIX, EXPE, EXPE",
            "provider": "Argus Research",
            "reportDate": "2023-11-29T17:05:35Z",
            "reportTitle": "Stocks rose on Wednesday morning following a stronger-than-expected GDP report. The Commerce Department said that the U.S. economy expanded at a 5.2% annualized rate in 3Q, up from a prior estimate of 4.9% and above the Reuters consensus forecast of 5.0% growth. GM shares surged after the automaker announced a 33% dividend increase and a record stock buyback. The company also issued a new 2023 earnings forecast after withdrawing its guidance during the UAW strike. The Dow rose 0.1%, the S&P 0.3%, and the Nasdaq 0.4%. Crude oil fell to $76 per barrel, while gold traded near $2063 per ounce.",
            "tickers": [
                "ENB",
                "EXPE",
                "EQIX",
                "EOG"
            ]
        },
        {
            "id": "37566_Stock Picks_1693915246000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2023-09-05T12:00:46Z",
            "reportTitle": "Value stocks -- a market segment that includes high-yield stocks -- outperformed growth stocks in 2022 for the first time since 2016. Indeed, for the past decade, the performance record has favored growth. Since 2010, the Russell 1000 Growth Index has climbed more than 550%, compared to an advance of almost 300% for the Russell 1000 Value Index. In eight of the past 10 years, growth stocks have topped value stocks. That hasn't always been the case. In the 2000-2010 decade, which included two Bear Markets and the Great Recession, value stocks were better performers than growth stocks, advancing an admittedly low 8% -- but still better than growth, which declined 15% during the decade. Value investors trace their roots to the famous \"Security Analysis\" textbook, written in 1934 (the year Argus Research was founded) by Ben Graham, an economics professor at Columbia University. Warren Buffett was one of his students. Looking ahead, the rollout of COVID-19 vaccines has given a lift to some of the cyclical companies (Energy sector companies in particular) that have lagged in recent years, and value stocks outpaced growth stocks in the past year. Now, the Federal Reserve is lifting interest rates to fend off inflation, which likely will cap multiple expansion for growth companies. In any event, value is the place to achieve income. The current yield on the iShares Russell 1000 Value Index ETF is 2.0%, compared to the 0.7% current yield on the iShares Russell 1000 Growth Index ETF. For our list this week, we screened our coverage universe for stocks that are BUY-rated by Argus Research analysts, have an Argus Financial Strength rating of at least Medium, and have a yield of 3.0% or higher.  Here's a baker's dozen of stocks that meet the criteria.",
            "tickers": [
                "C",
                "BCE",
                "F",
                "IP",
                "SPG",
                "DOW",
                "PRU",
                "PSX",
                "EIX",
                "IBM",
                "ENB",
                "GILD",
                "PM"
            ]
        },
        {
            "id": "37526_Thematic Portfolio_1693410045000",
            "headHtml": "The Argus High-Yield Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2023-08-30T15:40:45Z",
            "reportTitle": "Value stocks -- a market segment that includes high-yield stocks -- outperformed growth stocks in 2022 for the first time since 2016. Indeed, for the past decade, the performance record has favored growth. But the tide turned in 2022. The rollout of COVID-19 vaccines gave a lift to some of the cyclical companies (energy companies and regional banks) that had lagged in recent quarters, and value stocks outpaced growth stocks over the past year. Meanwhile, the Federal Reserve continues to lift interest rates to fend off inflation, which could possibly cap multiple expansion for growth companies for a few more quarters. Regardless, the value sector is the place to achieve income. The current yield on the iShares Russell 1000 Value Index ETF is 2.2%, compared to the 0.9% current yield on the iShares Russell 1000 Growth Index ETF.  For our High-Yield Theme Model Portfolio, we are seeking stocks with yields of at least 3.0%.  This moves us deep into the value segment of the market.",
            "tickers": [
                "C",
                "LAZ",
                "CVX",
                "VZ",
                "F",
                "K",
                "SPG",
                "SLF",
                "PFE",
                "TFC",
                "PRU",
                "LYB",
                "IBM",
                "VLO",
                "UPS",
                "DUK",
                "SO",
                "SNY",
                "OMC",
                "BCE",
                "IP",
                "DOW",
                "QSR",
                "PSX",
                "EIX",
                "XOM",
                "ENB",
                "GILD",
                "PM",
                "KEY"
            ]
        },
        {
            "id": "37526_Thematic Portfolio_1693409145000",
            "headHtml": "The Argus High-Yield Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2023-08-30T15:25:45Z",
            "reportTitle": "Value stocks -- a market segment that includes high-yield stocks -- outperformed growth stocks in 2022 for the first time since 2016. Indeed, for the past decade, the performance record has favored growth. But the tide turned in 2022. The rollout of COVID-19 vaccines gave a lift to some of the cyclical companies (energy companies and regional banks) that had lagged in recent quarters, and value stocks outpaced growth stocks over the past year. Meanwhile, the Federal Reserve continues to lift interest rates to fend off inflation, which could possibly cap multiple expansion for growth companies for a few more quarters. Regardless, the value sector is the place to achieve income. The current yield on the iShares Russell 1000 Value Index ETF is 2.2%, compared to the 0.9% current yield on the iShares Russell 1000 Growth Index ETF.  For our High-Yield Theme Model Portfolio, we are seeking stocks with yields of at least 3.0%.  This moves us deep into the value segment of the market.",
            "tickers": [
                "C",
                "LAZ",
                "CVX",
                "VZ",
                "F",
                "K",
                "SPG",
                "SLF",
                "PFE",
                "TFC",
                "PRU",
                "LYB",
                "IBM",
                "VLO",
                "UPS",
                "DUK",
                "SO",
                "SNY",
                "OMC",
                "BCE",
                "IP",
                "DOW",
                "QSR",
                "PSX",
                "EIX",
                "XOM",
                "ENB",
                "GILD",
                "PM",
                "KEY"
            ]
        },
        {
            "id": "3799_Analyst Report_1692380040000",
            "headHtml": "Analyst Report: Enbridge Inc",
            "provider": "Argus Research",
            "reportDate": "2023-08-18T17:34:00Z",
            "reportTitle": "Enbridge Inc. is North America's largest energy infrastructure company. Enbridge has six operating segments: Liquids Pipelines, Gas Transmission & Midstream, Gas Distribution, Renewable Power Generation & Transmission, Energy Services, and Eliminations & Other. Its regulated utilities serve approximately 3.7 million retail customers.",
            "targetPrice": 48.0,
            "investmentRating": "Bullish",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "37412_Market Update_1692379140000",
            "headHtml": "Market Update: ENB, AMAT, EL, GEN, WMT, RHHBY",
            "provider": "Argus Research",
            "reportDate": "2023-08-18T17:19:00Z",
            "reportTitle": "Stocks were largely flat on Friday morning, steadying after several days of sharp losses, as investors continued to focus on economic weakness in China, rising bond yields, and the Fed's next interest rate decisions. The CME Group's FedWatch Tool currently projects just a 10% chance of a rate hike in September, but a higher 30% chance of an increase at the November meeting. However, based on recent economic data and the FOMC meeting minutes earlier this week, many investors also expect the Fed to delay any rate cuts and leave high current rates in place for longer in 2024. The Dow rose 0.2%, the S&P was flat, and the Nasdaq fell 0.2%. Crude oil rose slightly to $81 per barrel, while gold rose $6 to $1922 per ounce.",
            "tickers": [
                "AMAT",
                "GEN",
                "EL",
                "ENB",
                "RHHBY",
                "WMT"
            ]
        },
        {
            "id": "37217_Thematic Portfolio_1690824817000",
            "headHtml": "The Argus Min Vol Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2023-07-31T17:33:37Z",
            "reportTitle": "Rapidly rising inflation in 2022 knocked stocks into a bear market. While growth strategies suffered the most, value strategies also declined. Even bond prices were lower last year. Stocks have recovered thus far in 2023, but gains have been largely driven by only a handful of high-tech companies.  Inflation remains high and the Fed continues to raise rates.  Is a recession in the offing?  With all the uncertainty, is it time for investors to cash in their chips? We note that investors exit the stock market at their own peril, as long-term returns from equities consistently have outpaced long-term returns from other asset classes, such as fixed income and cash. Argus believes that Min Vol is an all-weather strategy that is timely in any investing climate. Academic literature and, more to the point, returns history, indicate that Min Vol can deliver market-matching returns on an absolute basis and superior returns on a risk-adjusted basis over various time periods.",
            "tickers": [
                "CSCO",
                "CTVA",
                "JPM",
                "JNJ",
                "TXN",
                "PFE",
                "ABT",
                "GLW",
                "WM",
                "TRV",
                "CME",
                "CMI",
                "TJX",
                "OMC",
                "BCE",
                "HON",
                "CL",
                "AEP",
                "HSY",
                "MCD",
                "EXC",
                "LMT",
                "CMCSA",
                "MCK",
                "APD",
                "XOM",
                "PG",
                "ENB",
                "PEP",
                "EQIX",
                "GPC",
                "HD",
                "WMT"
            ]
        },
        {
            "id": "37139_Stock Picks_1690202401000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2023-07-24T12:40:01Z",
            "reportTitle": "Rapidly rising inflation in 2022 knocked stocks into a bear market. While growth strategies suffered the most, value strategies also declined. Even bond prices were lower last year. Stocks have recovered so far in 2023, but gains have been driven largely by only a handful of high-tech companies. Inflation remains high and the Fed continues to raise interest rates. Is a recession in the offing? With all the uncertainty, is it time for investors to cash in their chips? Perhaps not yet.  We note that investors exit the stock market at their own peril, as long-term returns from equities consistently have outpaced long-term returns from other asset classes, such as fixed income and cash. As well, those returns are from eras when the 10-year Treasury bond yield was much higher than the current 3.8% level. So what's a potential equity strategy for investors amid all the uncertainty? Argus believes that Min Vol is an all-weather strategy that is timely in any investing climate. Academic literature and, more to the point, returns history indicate that Min Vol can deliver market-matching returns on an absolute basis and superior returns on a risk-adjusted basis over various time periods. We have designed a portfolio of companies followed by Argus Research analysts that are BUY-rated and have impressive Min Vol characteristics of low beta, high yield, high market cap, strong balance sheets, and low risk profiles. Some of the stocks featured in the portfolio are listed below.",
            "tickers": [
                "TJX",
                "BCE",
                "HON",
                "JNJ",
                "ADP",
                "HSY",
                "LMT",
                "CMCSA",
                "GLW",
                "XOM",
                "ENB",
                "TRV",
                "CME",
                "PEP",
                "EQIX",
                "HD",
                "WMT"
            ]
        },
        {
            "id": "3799_Analyst Report_1684234326000",
            "headHtml": "Analyst Report: Enbridge Inc",
            "provider": "Argus Research",
            "reportDate": "2023-05-16T10:52:06Z",
            "reportTitle": "Enbridge Inc. is North America's largest energy infrastructure company. Enbridge has six operating segments: Liquids Pipelines, Gas Transmission & Midstream, Gas Distribution, Renewable Power Generation & Transmission, Energy Services, and Eliminations & Other. Its regulated utilities serve approximately 3.7 million retail customers.",
            "targetPrice": 48.0,
            "investmentRating": "Bullish",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "36482_Market Summary_1684233426000",
            "headHtml": "Market Digest: CP, ENB, CAH, EOG, RCL, HUBS",
            "provider": "Argus Research",
            "reportDate": "2023-05-16T10:37:06Z",
            "reportTitle": "One week does not make a trend. Two weeks may suggest a trend. Three weeks start to make the case that a trend is in place. But in looking at the insider-sentiment data this week from Vickers Stock Research (which is bullish for a third week), we don't think trend analysis is needed. We think the absolute data says it all. ",
            "tickers": [
                "ENB",
                "RCL",
                "CAH",
                "EOG",
                "HUBS",
                "CP"
            ]
        },
        {
            "id": "35776_Stock Picks_1678106062000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2023-03-06T12:34:22Z",
            "reportTitle": "Value stocks -- a market segment that includes high-yield stocks -- outperformed growth stocks in 2022 for the first time since 2016. Indeed, for the past decade, the performance record has favored growth. Since 2010, the Russell 1000 Growth Index has climbed more than 500%, compared to an advance of almost 300% for the Russell 1000 Value Index. In eight of the past 10 years, growth stocks have topped value stocks. That hasn't always been the case. In the 2000-2010 decade, which included two bear markets and the Great Recession, value stocks were better performers than growth stocks, advancing an admittedly low 8% -- but still better than growth, which declined 15% during the decade. Value investors trace their roots to the famous \"Security Analysis\" textbook, written in 1934 (the year Argus Research was founded) by Ben Graham, an economics professor at Columbia University. Warren Buffett was one of his students. Looking ahead, the rollout of COVID-19 vaccines has given a lift to some of the cyclical companies that have lagged in recent years, and value stocks outpaced growth stocks in the past year. Now, the Federal Reserve is lifting interest rates to fend off inflation, which likely will cap multiple expansion for growth companies. In any event, value is the place to achieve income. The current yield on the iShares Russell 1000 Value Index ETF is 2.2%, compared to the 0.9% current yield on the iShares Russell 1000 Growth Index ETF. For our list this week, we have screened our coverage universe for stocks that are BUY-rated by Argus Research analysts, have a Financial Strength rating of at least Medium, and have a yield of 4.0% or higher. Here's a baker's dozen that meet the criteria.",
            "tickers": [
                "C",
                "VZ",
                "BCE",
                "F",
                "IP",
                "ABBV",
                "SPG",
                "DOW",
                "PRU",
                "PSX",
                "EIX",
                "IBM",
                "ENB",
                "PM"
            ]
        },
        {
            "id": "3799_Analyst Report_1677068503000",
            "headHtml": "Analyst Report: Enbridge Inc",
            "provider": "Argus Research",
            "reportDate": "2023-02-22T12:21:43Z",
            "reportTitle": "Enbridge Inc. is North America's largest energy infrastructure company. Enbridge has six operating segments: Liquids Pipelines, Gas Transmission & Midstream, Gas Distribution, Renewable Power Generation & Transmission, Energy Services, and Eliminations & Other. According to one of the company's most recent 10-K, Enbridge delivers over three million barrels of crude oil per day, and transports 62% of all U.S.-bound Canadian crude exports. The company also transports 18% of the natural gas used in the U.S. Its regulated utilities serve approximately 3.7 million retail customers.",
            "targetPrice": 48.0,
            "investmentRating": "Bullish",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "35657_Market Summary_1677067603000",
            "headHtml": "Market Digest: ENB, ADTN, PRU, VMC, VTR",
            "provider": "Argus Research",
            "reportDate": "2023-02-22T12:06:43Z",
            "reportTitle": "With a rally off the October bottom, the S&P 500 (SPX) at its February 2 high had retraced (using intraday prices) slightly more than 50% of the bear market. The NYSE Composite, the Dow Jones Industrials, (DJIA) and the S&P MidCap 400 (MDY) all have recaptured over 61.8% of their respective bear markets. At its high on February 2, the Nasdaq 100 (QQQ) had seen a 38.2% retracement, while the Nasdaq Composite hasn't quite reached that minimum takeback.",
            "tickers": [
                "PRU",
                "ADTN",
                "VTR",
                "ENB",
                "VMC"
            ]
        },
        {
            "id": "35649_Thematic Portfolio_1676992411000",
            "headHtml": "The Argus High-Yield Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2023-02-21T15:13:31Z",
            "reportTitle": "Value stocks -- a market segment that includes high-yield stocks -- outperformed growth stocks in 2022 for the first time since 2016. Indeed, for the past decade, the performance record has favored growth. But the tide turned in 2022. The rollout of COVID-19 vaccines gave a lift to some of the cyclical companies (energy companies and regional banks) that had lagged in recent quarters, and value stocks outpaced growth stocks over the past year. Meanwhile, the Federal Reserve continues to lift interest rates to fend off inflation, which could possibly cap multiple expansion for growth companies for a few more quarters. Regardless, the value sector is the place to achieve income. The current yield on the iShares Russell 1000 Value Index ETF is 2.2%, compared to the 0.9% current yield on the iShares Russell 1000 Growth Index ETF.  For our High-Yield Theme Model Portfolio, we are seeking stocks with yields of at least 3.0%.  This moves us deep into the value segment of the market.",
            "tickers": [
                "C",
                "LAZ",
                "CVX",
                "VZ",
                "F",
                "K",
                "SPG",
                "SLF",
                "PFE",
                "TFC",
                "PRU",
                "LYB",
                "IBM",
                "VLO",
                "UPS",
                "DUK",
                "SO",
                "SNY",
                "OMC",
                "BCE",
                "IP",
                "ABBV",
                "DOW",
                "QSR",
                "PSX",
                "EIX",
                "XOM",
                "ENB",
                "GILD",
                "PM"
            ]
        },
        {
            "id": "35500_Stock Picks_1675687133000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2023-02-06T12:38:53Z",
            "reportTitle": "Global stocks are on a run. While the S&P 500 has jumped almost 8% year-to-date, The EAFA Index of large- and mid-cap stocks based in countries other than the U.S. and Canada has risen 9%.  Over the past six months, foreign stocks also have outperformed, climbing 11% versus a 1% decline by the U.S. market. The story is different over the past five years, as the S&P 500 has risen 50% and global stocks have fallen 1%. Even so, the long outperformance has given global stocks a valuation advantage, particularly in the area of dividends. The EAFE dividend yield of 2.7% is 100 basis points higher than the comparable S&P 500 dividend yield. We think global dividend stocks now offer opportunity, particularly given the endless speculation over the direction of interest rates in the U.S., which has created market-timing headaches for equity income investors - who have endured recent wide swings in prices for rate-sensitive equity sectors such as utilities, REITs and MLPs. In our view, investing in international income stocks is one way to increase portfolio diversification while reducing sensitivity to volatile U.S. interest rates. Investing in overseas stocks carries its own set of risks, including the impact of currency exchange and geopolitical turmoil. But there are also a number of positives in this asset class for U.S. investors, including a wide selection, robust industry diversification, and, as we have mentioned, higher yields and lower valuations. Argus recently boosted its global coverage, and recommends the following international dividend stocks, each of which has at least a long-term BUY rating from an Argus analyst. This list of approximately 25 companies offers exposure to eight of the 11 major industrial sectors.  The list includes companies from 10 countries.",
            "tickers": [
                "RY",
                "NVS",
                "BHP",
                "SLF",
                "RHHBY",
                "BP",
                "ASML",
                "BUD",
                "CCEP",
                "UL",
                "SHEL",
                "GSK",
                "SNY",
                "BCE",
                "NXPI",
                "ERIC",
                "LRLCY",
                "CP",
                "DEO",
                "TSM",
                "AZN",
                "BTI",
                "ENB",
                "ALC",
                "RIO",
                "CNI"
            ]
        },
        {
            "id": "35405_Thematic Portfolio_1674748218000",
            "headHtml": "The Argus Min Vol Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2023-01-26T15:50:18Z",
            "reportTitle": "Rapidly rising inflation 2022 knocked stocks into a bear market. While growth strategies suffered the most, value strategies also declined. Even bond prices were lower last year. Volatility, which has dropped from the highs of 2020, still has not returned to pre-COVID levels. Is it time for investors to cash in their chips? We note that investors exit the stock market at their own peril, as long-term returns from equities consistently have outpaced long-term returns from other asset classes, such as fixed income and cash. As well, those fixed-income returns are from eras when the 10-year Treasury bond yield was much higher than the current 3.5% level. So what's a potential equity strategy for investors amid all the uncertainty? Argus believes that Min Vol is an all-weather strategy that is timely in any investing climate.",
            "tickers": [
                "CSCO",
                "CTVA",
                "VZ",
                "JNJ",
                "MRK",
                "TXN",
                "ADP",
                "PFE",
                "DHR",
                "ABT",
                "UNP",
                "WM",
                "TRV",
                "KO",
                "OMC",
                "BCE",
                "HON",
                "CL",
                "AEP",
                "AVB",
                "HSY",
                "MCD",
                "EXC",
                "LMT",
                "MCK",
                "APD",
                "XOM",
                "PG",
                "ENB",
                "PEP",
                "GPC",
                "AJG",
                "WMT"
            ]
        },
        {
            "id": "3799_Analyst Report_1669119474000",
            "headHtml": "Analyst Report: Enbridge Inc",
            "provider": "Argus Research",
            "reportDate": "2022-11-22T12:17:54Z",
            "reportTitle": "Enbridge Inc. is North America's largest energy infrastructure company. Enbridge has six operating segments: Liquids Pipelines, Gas Transmission & Midstream, Gas Distribution, Renewable Power Generation & Transmission, Energy Services, and Eliminations & Other. According to the company's most recent 10-K, Enbridge delivers over three million barrels of crude oil per day, and transports 62% of all U.S.-bound Canadian crude exports. The company also transports 18% of the natural gas used in the U.S. Its regulated utilities serve approximately 3.7 million retail customers.",
            "targetPrice": 48.0,
            "investmentRating": "Bullish",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "34797_Market Summary_1669118574000",
            "headHtml": "Market Digest: ENB, ALL, APD, VNO, PANW, BABA",
            "provider": "Argus Research",
            "reportDate": "2022-11-22T12:02:54Z",
            "reportTitle": "Last week, we reported that the volume of insider transactions was ramping up with the end of earnings season upon us. This week brings a burst of transactions, with about 2300 insider transactions meeting the criteria for inclusion in the Weekly Insider Report from Vickers Stock Research. ",
            "tickers": [
                "BABA",
                "ALL",
                "APD",
                "VNO",
                "ENB",
                "PANW"
            ]
        },
        {
            "id": "34350_Market Outlook_1665148583000",
            "headHtml": "Daily Spotlight: 263,000 New Jobs in September",
            "provider": "Argus Research",
            "reportDate": "2022-10-07T13:16:23Z",
            "reportTitle": "The U.S. economy generated a solid 263,000 new jobs in August, in line with the consensus expectations and above our forecast of 225,000.  The unemployment rate ticked lower to 3.5% -- the pre-pandemic level - as the labor force participation rate declined by 10 basis points to 62.3%.  Average hourly earnings increased 10 cents month-to-month and are now 5.0% higher year-over-year, down 20 basis points month-to-month.  Revisions to the jobs totals in the two prior months added 11,000 jobs to the economy. In September, jobs gains occurred in leisure and hospitality, professional and business services, healthcare, construction, and manufacturing. The retail industry was relatively steady in terms of employment.  The employment report, though lower month-over-month, suggests that the consumer segment of the economy is likely to remain on a growth track, despite the impact of the Federal Reserve rate hikes, the Russian invasion of Ukraine, and high prices at the gas pump. There were few signs that inflation is likely to cool. Stock futures were positive ahead of the announcement, but are now negative as the report gives signals that the Fed is likely to extend its series of aggressive rate hikes.",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "34156_Stock Picks_1663587379000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2022-09-19T11:36:19Z",
            "reportTitle": "The broad market selloff on September 13 still feels raw, and the Federal Reserve has left no doubt that it will fight inflation vigorously for as long as it takes. Stocks, and likely many portfolios, are feeling some pain. In volatile times like these, when selling is widespread, a classic investing strategy is to focus on “best in class” stocks. These are the strongest and most-stable stocks in each sector -- and by looking across sectors, diversification can also be achieved. To get our list this week, we ran multiple screens. We started with the Argus Min-Vol theme model portfolio. As the name suggests, that portfolio includes companies that likely can best withstand market fluctuations. We then shortlisted the group by also screening for financial strength and dividend yield. And, finally, we picked one stock from each of the 11 S&P sectors. The following stocks are our Best in Class for Safety recommendations for September 2022, and all of them currently carry an Argus BUY rating.",
            "tickers": [
                "LMT",
                "CSCO",
                "KO",
                "VZ",
                "APD",
                "MRK",
                "ENB",
                "TRV",
                "AEP",
                "AVB",
                "MCD"
            ]
        },
        {
            "id": "34024_Stock Picks_1662463179000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2022-09-06T11:19:39Z",
            "reportTitle": "Value stocks -- a market segment that includes high-yield stocks -- are outperforming growth stocks in 2022 for the first time since 2016. Indeed, for the past decade, the performance record has favored growth. Since 2010, the Russell 1000 Growth Index has climbed more than 600%, compared to an advance of 300% for the Russell 1000 Value Index. In nine of the past 10 years, growth stocks have topped value stocks. That wasn't always the case. In the 2000-2010 decade, which included two bear markets and the Great Recession, value stocks were better performers than growth stocks, advancing an admittedly low 8% (but still better than growth, which declined 15% during the decade). Value investors trace their roots to the famous \"Security Analysis\" textbook, written by Ben Graham, an economics professor at Columbia University. Warren Buffett was one of his students. Looking ahead, the roll-out of COVID-19 vaccines has given a lift to some of the cyclical companies (energy companies and regional banks) that have lagged in recent quarters, and value stocks have kept up the pace with growth stocks in the past year. Now, the Federal Reserve is lifting interest rates to fend off inflation, which will likely cap multiple expansion for growth companies. In any event, value is the place to achieve income. The current yield on the iShares Russell 1000 Value Index ETF is 2.1%, compared to the 0.8% current yield on the iShares Russell 1000 Growth Index ETF. For our list this week, we have screened our coverage universe for stocks that are BUY-rated at Argus Research, have an Argus Financial Strength rating of at least Medium, and have a yield of 4.0% or higher. Here's a baker's dozen that meet the criteria.",
            "tickers": [
                "VZ",
                "BCE",
                "AGNC",
                "IP",
                "ABBV",
                "SPG",
                "PRU",
                "PSX",
                "EIX",
                "IBM",
                "ENB",
                "NLY",
                "GILD"
            ]
        },
        {
            "id": "33863_Thematic Portfolio_1660853633000",
            "headHtml": "The Argus High-Yield Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2022-08-18T20:13:53Z",
            "reportTitle": "Value stocks -- a market segment that includes high-yield stocks -- are outperforming growth stocks in 2022 for the first time since 2016. Indeed, for the past decade, the performance record has favored growth. In nine of the past 10 years, growth stocks have topped value stocks. But the tide may be turning. The rollout of COVID-19 vaccines has given a lift to some of the cyclical companies (energy companies and regional banks) that have lagged in recent quarters, and value stocks have kept up the pace with growth stocks in the past year. Now, the Federal Reserve lifting interest rates to fend off inflation, which will likely cap multiple expansion for growth companies. Regardless, the value sector is the place to achieve income. The current yield on the iShares Russell 1000 Value Index ETF is 2.1%, compared to the 0.8% current yield on the iShares Russell 1000 Growth Index ETF.  For our High-Yield Theme Model Portfolio, we are seeking stocks with yields of at least 3.0%.  This moves us deep into the value segment of the market.",
            "tickers": [
                "C",
                "CVX",
                "VZ",
                "AGNC",
                "DLR",
                "SPG",
                "SLF",
                "PPL",
                "PFE",
                "PRU",
                "LYB",
                "IBM",
                "VNO",
                "UL",
                "VLO",
                "NLY",
                "DUK",
                "SO",
                "SNY",
                "OMC",
                "BCE",
                "IP",
                "ABBV",
                "DOW",
                "PSX",
                "EIX",
                "BTI",
                "INTC",
                "XOM",
                "ENB",
                "GILD"
            ]
        },
        {
            "id": "33779_Technical Analysis_1660216540000",
            "headHtml": "Technical Assessment: Neutral in the Intermediate-Term",
            "provider": "Argus Research",
            "reportDate": "2022-08-11T11:15:40Z",
            "reportTitle": "Investors got a piece of good news about inflation when the July CPI came in cooler than expected. This is not surprising, as we have been talking about cratering commodity prices for months. The chatter on Wednesday was whether the Federal Reserve will raise the fed funds rate by 50 basis points or 75 in September. Most were looking for 75 before the CPI report. After the report, the S&P 500 rocketed 2.1%, the Nasdaq and the Russell 2000 soared 2.9%, the Nasdaq 100 surged 2.7%, and the S&P MidCap 400 popped 2.5%. It was the highest close since May 4 for the \"500,\" the Nasdaq, and the QQQs, and the highest close for IWM since April 21.",
            "tickers": [
                "TGT",
                "ENB"
            ]
        },
        {
            "id": "33756_Portfolio Ideas_1660045902000",
            "headHtml": "The Bull Battles Back",
            "provider": "Argus Research",
            "reportDate": "2022-08-09T11:51:42Z",
            "reportTitle": "The Portfolio Selector features the Argus Focus List, a group of 30 \"best idea\" stocks generated and regularly updated by Argus' analysts and investment policy committee. It also includes the director of research’s monthly investment strategy column, stock recommendations and sector picks, economic forecasts, and an asset allocation model. This month, the Focus List additions are Quanta Services, Inc. (PWR); Danaher Corp. (DHR); Expedia Group Inc (EXPE); EOG Resources, Inc. (EOG) and the Focus List deletions are Enbridge Inc (ENB); CVS Health Corp (CVS); Emerson Electric Co. (EMR); McDonald`s Corp (MCD).",
            "tickers": [
                "CVS",
                "ENB",
                "EXPE",
                "PWR",
                "EMR",
                "EOG",
                "DHR",
                "MCD"
            ]
        },
        {
            "id": "3799_Analyst Report_1659979090000",
            "headHtml": "Analyst Report: Enbridge Inc",
            "provider": "Argus Research",
            "reportDate": "2022-08-08T17:18:10Z",
            "reportTitle": "Enbridge Inc. is North America's largest energy infrastructure company. Enbridge has six operating segments: Liquids Pipelines, Gas Transmission & Midstream, Gas Distribution, Renewable Power Generation & Transmission, Energy Services, and Eliminations & Other. According to the company's most recent 10-K, Enbridge delivers over three million barrels of crude oil per day, and transports 62% of all U.S.-bound Canadian crude exports. The company also transports 18% of the natural gas used in the U.S. Its regulated utilities serve approximately 3.7 million retail customers.",
            "targetPrice": 48.0,
            "investmentRating": "Bullish",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "33741_Market Update_1659978190000",
            "headHtml": "Market Update: ENB, IPG, WDC, DLR",
            "provider": "Argus Research",
            "reportDate": "2022-08-08T17:03:10Z",
            "reportTitle": "Stocks rose on Monday morning as investors awaited key inflation data later in the week, including the July consumer price index on Wednesday. The current Bloomberg consensus calls for a year-over-year increase of 8.7% in the CPI, down from 9.1% in June due in part to lower gas prices. On the earnings front, Tyson shares fell more than 9% after the company reported below-consensus fiscal 3Q earnings, hurt by higher feed costs and the impact of rising meat prices on consumer spending. The Dow rose 0.8%, the S&P 0.8%, and the Nasdaq 1.1%. Crude oil fell slightly to $88.50 per barrel, while gold rose $13 to $1804 per ounce.",
            "tickers": [
                "IPG",
                "WDC",
                "ENB",
                "DLR"
            ]
        },
        {
            "id": "33736_Stock Picks_1659959181000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2022-08-08T11:46:21Z",
            "reportTitle": "Dividends are supposed to lend stability to a portfolio. However, U.S.-based income investors have experienced a high degree of volatility in recent years, as the Federal Reserve since 2018 has embarked on two campaigns to raise interest rates, sandwiched around a desperate program that lowered the federal funds rate to zero in order to help the economy recover from the pandemic. The endless speculation over the direction of rates has created market-timing headaches for equity income investors. They have endured wide swings in prices for rate-sensitive equity sectors such as Utilities, REITs and MLPs. In our view, investing in international income stocks is one way to increase portfolio diversification while reducing sensitivity to volatile U.S interest rates. Investing in overseas stocks carries its own set of risks, including the impact of currency exchange and geopolitical turmoil. But there are also a number of positives in this asset class for U.S. investors, including a wide selection, robust industry diversification, higher yields, and lower valuations. Argus has recently boosted its global coverage, and recommends the following international dividend stocks. Note this list of 25 companies offers exposure to eight of the 11 major sectors. The list includes companies from 10 countries.",
            "tickers": [
                "BCE",
                "RY",
                "ERIC",
                "LRLCY",
                "NVS",
                "BHP",
                "SLF",
                "RHHBY",
                "CP",
                "BP",
                "DEO",
                "TSM",
                "ASML",
                "BUD",
                "CCEP",
                "AZN",
                "BTI",
                "ENB",
                "RIO",
                "GSK",
                "CNI",
                "SNY"
            ]
        },
        {
            "id": "33645_Thematic Portfolio_1659015021000",
            "headHtml": "The Argus Min Vol Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2022-07-28T13:30:21Z",
            "reportTitle": "Rapidly rising inflation in 2022 has knocked the stock market into a bear market. While growth strategies have suffered the most, value strategies also have declined. Even year-to-date bond prices are lower. Volatility, which has dropped from the highs of 2020, still has not returned to pre-COVID levels. Is it time for investors to cash in their chips? We note that investors exit the stock market at their own peril, as long-term returns from equities consistently have outpaced long-term returns from other asset classes, such as fixed income and cash. As well, those returns are from eras when the 10-year Treasury bond yield was much higher than the current 3.0% level. So what's a potential equity strategy for investors amid all the uncertainty? Argus believes that Min Vol is an all-weather strategy that is timely in any investing climate. Academic literature and, more to the point, returns history, indicate that Min Vol can deliver market-matching returns on an absolute basis and superior returns on a risk-adjusted basis over various time periods.",
            "tickers": [
                "CSCO",
                "VZ",
                "JNJ",
                "MRK",
                "TXN",
                "RHHBY",
                "ADP",
                "PFE",
                "DHR",
                "ABT",
                "UNP",
                "WM",
                "UL",
                "TRV",
                "AEE",
                "KO",
                "OMC",
                "BCE",
                "HON",
                "CL",
                "AEP",
                "AVB",
                "DEO",
                "HSY",
                "MCD",
                "LMT",
                "APD",
                "XOM",
                "PG",
                "ENB",
                "PEP",
                "GPC",
                "WMT"
            ]
        },
        {
            "id": "33600_Stock Picks_1658748888000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2022-07-25T11:34:48Z",
            "reportTitle": "Rapidly rising inflation in 2022 has knocked the stock market into a bear market. While growth strategies have suffered the most, value strategies also have declined. Even bond prices are lower year-to-date. Volatility, which has dropped from the highs of 2020, still has not returned to pre-COVID levels. Is it time for investors to cash in their chips?  Perhaps not yet.  We note that investors exit the stock market at their own peril, as long-term returns from equities consistently have outpaced long-term returns from other asset classes, such as fixed income and cash. As well, those returns are from eras when the 10-year Treasury bond yield was much higher than the current 3.0% level. So what's a potential equity strategy for investors amid all the uncertainty? Argus believes that Min-Vol is an all-weather strategy that is timely in any investing climate. Academic literature and, more to the point, returns history indicate that Min-Vol can deliver market-matching returns on an absolute basis and superior returns on a risk-adjusted basis over various time periods. We have designed a portfolio of companies followed by Argus Research analysts that are BUY-rated and have impressive Min-Vol characteristics of low beta, high yield, high market cap, strong balance sheets, and low risk profiles. Some of the stocks featured in the portfolio are listed below.",
            "tickers": [
                "MSFT",
                "OMC",
                "VZ",
                "BCE",
                "HON",
                "ENB",
                "TRV",
                "PEP",
                "ADP",
                "AVB",
                "HSY",
                "WMT"
            ]
        },
        {
            "id": "33446_Market Outlook_1657271206000",
            "headHtml": "Daily Spotlight: 372,000 New Jobs in June",
            "provider": "Argus Research",
            "reportDate": "2022-07-08T09:06:46Z",
            "reportTitle": "The U.S. economy generated 372,000 new jobs in June, ahead of consensus expectations that were in the 250,000 range. Turning to other data points, the unemployment rate was steady at 3.6%, and the number of unemployed persons was 5.9 million, down from 6.0 million in the prior month. Average hourly earnings increased 10 cents month-to-month and are now 5.1% higher year-over-year, compared to 5.2% a month ago and 5.5% two months ago. Revisions to the jobs totals from the two prior months subtracted 74,000 jobs from the economy. In June, jobs gains occurred in leisure and hospitality, professional and business services, healthcare, and transportation and warehousing. The report indicates that the consumer segment of the economy is likely to remain on a growth track, despite the impact of the Federal Reserve rate hikes, the Russian invasion of Ukraine, and higher prices at the gas pump.  Stock futures are lower as the report signals that the Federal Reserve is likely to stay aggressive in its fight against inflation.",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "33352_Thematic Portfolio_1656409823000",
            "headHtml": "The Argus Dividend Growth Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2022-06-28T09:50:23Z",
            "reportTitle": "Dividend income, an important element of total return, is often overlooked amid gyrations in the stock market. Between 1930 and 2012, dividend income accounted for 42% of the total return of the S&P 500, according to Hartford Funds. And that's just the average. In some decades, dividends accounted for more than 50% of total returns and even 100% of returns. More recently, dividends have accounted for 15%-20% of returns. Still, in 2018, dividend payments softened the blow when most market indices declined as the Federal Reserve hiked rates. The pattern is being repeated in 2022 as well. Not all dividends are created equal, though, and it is important to understand the difference between the two main categories: high-yield stocks and dividend-growth stocks.",
            "tickers": [
                "BLK",
                "ALL",
                "JPM",
                "HPQ",
                "BK",
                "J",
                "TXN",
                "ADP",
                "UNH",
                "DHR",
                "MSFT",
                "COST",
                "MA",
                "SPGI",
                "LHX",
                "TJX",
                "CBOE",
                "ABBV",
                "PKG",
                "HSY",
                "AAP",
                "WSM",
                "MCK",
                "PG",
                "ENB",
                "ANTM",
                "PH",
                "CTAS",
                "PXD",
                "ODFL"
            ]
        },
        {
            "id": "33271_Stock Picks_1655798128000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2022-06-21T07:55:28Z",
            "reportTitle": "This is among our most important themes for 2022, and stretches across industries. We think companies that consistently raise their dividends at a double-digit rate are sending off three important signals amid the recent market volatility: 1) the company's balance sheet is strong enough to pay a dividend; 2) management is focused on providing shareholder returns; and 3) management is confident enough in the near-term outlook to raise the payout aggressively. The third factor is especially important as the pandemic upended the nation's recent record of long-term economic growth. Here are 19 stocks that meet our double-digit dividend test and are on the Argus BUY List. They are also holdings in our Dividend Growth Separately Managed Account and in the Dividend Growers Total Return Trust, sponsored by SmartTrust.",
            "tickers": [
                "BLK",
                "SHW",
                "HPQ",
                "BK",
                "J",
                "ABBV",
                "TXN",
                "ADP",
                "PKG",
                "HSY",
                "MSFT",
                "WSM",
                "COST",
                "MCK",
                "PG",
                "ENB",
                "SPGI",
                "CTAS",
                "LHX",
                "PXD"
            ]
        },
        {
            "id": "33054_Market Outlook_1653635174000",
            "headHtml": "Daily Spotlight: Argus Research Adjusts Oil Price Forecast",
            "provider": "Argus Research",
            "reportDate": "2022-05-27T07:06:14Z",
            "reportTitle": "Our forecast for the average price of a barrel of West Texas Intermediate crude oil in 2022 is now $110, compared to last year's average price of $68. We anticipate a trading range of $140-$80 for the year. The current price is around $110, up from $75 at the beginning of the year but down from $123 in early March. The core drivers behind oil prices in the near term are global demand and global supply. According to the U.S. Energy Information Administration, there was a supply shortage last year: global consumption was 97.4 million barrels per day, while global production was only 95.6 million barrels. This was a reversal from 2020, when global demand was 91.9 million bb/day and production was 93.8.  As a result, the average price of oil was $40 in 2020. In addition to the near-term drivers, there are geopolitical developments, ranging from wars (Russia's invasion of Ukraine) to sanctions (Iran, Venezuela). These wild cards can cause prices to fluctuate dramatically.  Forecasts call for supply to match demand later in 2022 and to exceed demand slightly in 2023. Absent wild cards, the demand-supply outlook suggests the days of sharp increases in oil prices are in the rear-view mirror.",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "3799_Analyst Report_1653288522000",
            "headHtml": "Analyst Report: Enbridge Inc",
            "provider": "Argus Research",
            "reportDate": "2022-05-23T06:48:42Z",
            "reportTitle": "Enbridge Inc. is North America's largest energy infrastructure company. Enbridge has six operating segments: Liquids Pipelines, Gas Transmission & Midstream, Gas Distribution, Renewable Power Generation & Transmission, Energy Services, and Eliminations & Other. According to the company's most recent 10-K, Enbridge delivers over three million barrels of crude oil per day, and transports 62% of all U.S.-bound Canadian crude exports. The company also transports 18% of the natural gas used in the U.S. Its regulated utilities serve approximately 3.7 million retail customers.",
            "targetPrice": 48.0,
            "investmentRating": "Bullish",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "32993_Market Summary_1653287622000",
            "headHtml": "Market Digest: ENB, SNY, AIG, APA, APD, SYK, PANW, CTVA",
            "provider": "Argus Research",
            "reportDate": "2022-05-23T06:33:42Z",
            "reportTitle": "Reading the Tea Leaves on Consumers",
            "tickers": [
                "APA",
                "CTVA",
                "SYK",
                "APD",
                "ENB",
                "AIG",
                "PANW",
                "SNY"
            ]
        },
        {
            "id": "32857_Stock Picks_1652081585000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2022-05-09T07:33:05Z",
            "reportTitle": "Markets have faced difficult times before, with challenging economic environments, wars, disease, banking and housing crises, and inflation much worse than we are seeing now, to name but a few. Of late, stock investors had it very good for a very long time -- but now, finding opportunities requires much more work. There is no secret sauce, but there are principals that are worth reviewing: 1) diversify; 2) look for strong management; 3) look for solid balance sheets; 4) do your homework; and 5) adapt. To assemble this week's list, we looked across several sectors that historically are considered to be the most-shielded from high inflation and high interest rates. We then cross-referenced our coverage universe for companies where our analysts recently raised target prices; that have an Argus Financial Strength rating of at least Medium-High; and that pay dividends of least 3%. Some companies also are featured in our model portfolios (Growth & Income, Equity Income, Growth, and Institutional). Here is our list of companies we believe to be recession-proof, all of which are rated BUY at Argus.",
            "tickers": [
                "CVS",
                "CVX",
                "KO",
                "JNJ",
                "CL",
                "ADM",
                "K",
                "AMGN",
                "PFE",
                "HAL",
                "PEG",
                "PSX",
                "XOM",
                "PG",
                "UL",
                "ENB",
                "EPD",
                "PNW",
                "VLO",
                "PEP",
                "PXD"
            ]
        },
        {
            "id": "32437_Stock Picks_1647848285000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2022-03-21T07:38:05Z",
            "reportTitle": "We recently raised our rating on the Energy sector to Over-Weight from Market-Weight. Already strong demand for petroleum products (related to global reopening) is now exacerbated by the war in Ukraine, which has led to broad sanctions on Russia and may exclude this major supplier from the global energy markets. Although we expect other counties to add to supply, we expect energy prices to remain elevated at least through year-end. Energy accounts for 3.6% of S&P 500 market cap; over the past five years, the weighting has ranged from 2% to 10%. We think investors should consider allocating 4%-5% of diversified portfolios to the group. The sector is outperforming thus far in 2022, with a gain of 32.3%. It also outperformed in 2021, with a gain of 47.7%. It underperformed in 2020, with a loss of 37.3%, and in 2019, with a gain of 7.6%.  Here are some of the Energy sector companies that are on our BUY List. Some also are featured in our model portfolios (Growth & Income, Equity Income, Growth, and Institutional) and in our Focus List.",
            "tickers": [
                "CVX",
                "COP",
                "SLB",
                "WMB",
                "NFG",
                "HAL",
                "PSX",
                "XOM",
                "ENB",
                "EPD",
                "VLO",
                "SHEL",
                "EOG",
                "DVN",
                "PXD"
            ]
        },
        {
            "id": "32313_Stock Picks_1646640242000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2022-03-07T08:04:02Z",
            "reportTitle": "Value stocks -- a market segment that includes high-yield stocks -- are outperforming growth stocks in 2022. For the past decade, the performance record has favored growth. Since 2010, the Russell 1000 Growth Index has climbed more than 600%, compared to an advance of 300% for the Russell 1000 Value Index. In nine of the past 10 years, growth stocks have topped value stocks. That hasn't always been the case. In the 2000-2010 decade, including the Great Recession, value stocks were better performers than growth stocks, advancing an admittedly low 8% -- but still better than growth, which declined 15% during the decade. Value investors trace their roots to the famous \"Security Analysis\" textbook, written by Ben Graham, an economics professor at Columbia University. Warren Buffett was one of his students. The rollout of COVID-19 vaccines has given a lift to some of the cyclical companies (energy firms and regional banks) that have lagged in recent quarters, and value stocks have kept up the pace with growth stocks in the past year.  Now, the Federal Reserve is poised to lift interest rates to fend off high inflation, which will likely cap multiple expansion for growth companies. In any event, value is the place to achieve income. The current yield on the iShares Russell 1000 Value Index ETF is 1.6%, compared to the 0.5% current yield on the iShares Russell 1000 Growth Index ETF. For our list this week, we screened our coverage universe for stocks that are BUY-rated by Argus Research analysts, have a Financial Strength rating of at least Medium, and have a yield of 3.0% or higher.  Here are 10 stocks that meet the criteria.",
            "tickers": [
                "BCE",
                "AGNC",
                "IBM",
                "INTC",
                "XOM",
                "ENB",
                "NLY",
                "K",
                "SPG",
                "PPL"
            ]
        },
        {
            "id": "32302_Market Outlook_1646385420000",
            "headHtml": "Daily Spotlight: Jobs Growth Strengthens in February",
            "provider": "Argus Research",
            "reportDate": "2022-03-04T09:17:00Z",
            "reportTitle": "The U.S. economy added 678,000 jobs in February, well above the consensus expectation for 450,000 new jobs. Turning to other data points, the unemployment rate dropped two-tenths of a percent to 3.8%, and the number of unemployed persons was down to 6.3 million from 6.5 million in January. Average hourly earnings increased by only $0.01 month-to-month and are now 5.1% higher year-over-year, compared to 5.7% a month ago. Revisions to the two prior months added another 92,000 jobs to the economy. In February, jobs gains occurred in leisure and hospitality, which points toward strength in consumer spending on services; professional and business services; healthcare; construction; and transportation and warehousing, which may ultimately help relieve the current supply-chain challenges. The report indicates that the economy remains on a growth track, despite the impact of the Omicron variant. The even better economic news was that wage growth slowed a bit.",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "32247_Thematic Portfolio_1645782233000",
            "headHtml": "The Argus High-Yield Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2022-02-25T09:43:53Z",
            "reportTitle": "Value stocks -- a market segment that includes high-yield stocks -- are outperforming growth stocks in 2022. For the past decade, the performance record has favored growth, but the tide may be turning. The rollout of COVID-19 vaccines has given a lift to some of the cyclical companies (energy companies and regional banks) that have lagged in recent quarters, and value stocks have kept up the pace with growth stocks in the past year. Now, the Federal Reserve is poised to lift interest rates to fend off inflation, which will likely cap multiple expansion for growth companies. Regardless, the value sector is the place to achieve income. The current yield on the iShares Russell 1000 Value Index ETF is 1.6%, compared to the 0.5% current yield on the iShares Russell 1000 Growth Index ETF.  For our High-Yield Theme Model Portfolio, we are seeking stocks with yields of at least 3.0%. This moves us deep into the value segment of the market.",
            "tickers": [
                "CVX",
                "VZ",
                "AGNC",
                "K",
                "SPG",
                "SLF",
                "AMGN",
                "PPL",
                "PFE",
                "TFC",
                "PRU",
                "LYB",
                "IBM",
                "VNO",
                "UL",
                "VLO",
                "NLY",
                "DUK",
                "SO",
                "SNY",
                "BCE",
                "IP",
                "ABBV",
                "DOW",
                "PSX",
                "EIX",
                "INTC",
                "XOM",
                "ENB",
                "MET"
            ]
        },
        {
            "id": "32178_Market Outlook_1645081550000",
            "headHtml": "Daily Spotlight: Higher Rates and Oil Play to Canadian Strengths",
            "provider": "Argus Research",
            "reportDate": "2022-02-17T07:05:50Z",
            "reportTitle": "Similar to the U.S., Canada's inflation rate has been running hot (at nearly 5% over the past year, particularly for consumer prices). Canada's central bank (The Bank of Canada) is expected to begin raising interest rates soon, with three rate hikes forecast for 2022, according to the Conference Board of Canada. Meanwhile, oil prices have reached seven-year highs, pushed upward by strong demand from recovering economies, a lack of investment in new drilling projects, and the recent threat of conflict between Russia and the Ukraine. With the Financial and Energy sectors together accounting for nearly half of Canada's TSX 60 market weight, the above has (not surprisingly) led to clear outperformance for the index -- which has risen 20% over the past year versus 12% for the S&P 500. We also note that the Canadian dollar continues to trade stronger than its five-year average against the U.S. dollar, making translated earnings from Canadian companies more valuable and helping valuations. We believe select companies in Canada offer compelling investment opportunities.",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "3799_Analyst Report_1644845689000",
            "headHtml": "Analyst Report: Enbridge Inc",
            "provider": "Argus Research",
            "reportDate": "2022-02-14T13:34:49Z",
            "reportTitle": "Enbridge Inc. is North America's largest energy infrastructure company. Enbridge has six operating segments: Liquids Pipelines, Gas Transmission & Midstream, Gas Distribution, Renewable Power Generation & Transmission, Energy Services, and Eliminations & Other. According to the company's most recent 10-K, Enbridge delivers over three million barrels of crude oil per day, and transports 62% of all U.S.-bound Canadian crude exports. The company also transports 18% of the natural gas used in the U.S. Its regulated utilities serve approximately 3.7 million retail customers.",
            "targetPrice": 48.0,
            "investmentRating": "Bullish",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "32147_Market Update_1644844789000",
            "headHtml": "Market Update: ENB, BP, KO, VFC, CC",
            "provider": "Argus Research",
            "reportDate": "2022-02-14T13:19:49Z",
            "reportTitle": "Stocks were mixed in volatile trading on Monday morning amid continued concerns about the Ukraine conflict and the impact of Fed interest rate hikes. St. Louis Fed President James Bullard reiterated his call for a 100-basis-point rate hike by June in order to combat inflation. The CME Group's FedWatch tool now projects a 67% chance of a 50-basis-point rate hike in March. The Dow fell 0.5%, the S&P fell 0.2%, and the Nasdaq rose 0.7%. Crude oil rose to $94 per barrel, while gold traded near $1866 per ounce.",
            "tickers": [
                "CC",
                "VFC",
                "KO",
                "ENB",
                "BP"
            ]
        },
        {
            "id": "32069_Stock Picks_1644218852000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2022-02-07T07:27:32Z",
            "reportTitle": "The onset of the coronavirus in 2020 knocked stocks into a bear market. Though equities have recovered, the U.S. economy is about to slow down and COVID-19 cases are rising again as virus variants spread. Volatility, which has dropped from the highs of 2020, still has not returned to pre-COVID levels. Daily prices can swing wildly, as they did in January 2022 when the S&P 500 fell 5%. Is it time for investors to cash in their chips? Perhaps not yet. We note that investors exit the stock market at their own peril, as long-term returns from equities consistently have outpaced long-term returns from other asset classes, such as fixed income and cash. As well, those returns are from eras when the 10-year Treasury bond yield was not sub-2.0%. So what's a potential equity strategy for investors amid all the uncertainty? Argus believes that Min Vol is an all-weather strategy that is timely in any investing climate. Academic literature and, more to the point returns history, indicate that Min Vol can deliver market-matching returns on an absolute basis and superior returns on a risk-adjusted basis over various time periods. We have designed a portfolio of companies followed by Argus Research analysts that are BUY-rated and have impressive Min Vol characteristics of low beta, high yield, high market cap, strong balance sheets and low risk profiles. Here are some of the stocks featured in the portfolio.",
            "tickers": [
                "MSFT",
                "AEE",
                "LMT",
                "ROP",
                "ABT",
                "KO",
                "VZ",
                "ENB",
                "AEP",
                "RHHBY",
                "CHD",
                "DEO"
            ]
        },
        {
            "id": "31993_Thematic Portfolio_1643287499000",
            "headHtml": "The Argus Min Vol Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2022-01-27T12:44:59Z",
            "reportTitle": "The onset of the coronavirus in 2020 knocked stocks into a bear market. Though equities recovered, the U.S. economy is about to slow down and COVID-19 cases are rising again as virus variants spread. Volatility, which has dropped from the highs of 2020, still has not returned to pre-COVID levels.  Daily prices can swing wildly, as they did three times in 2021 when stocks dropped 4%-5% in a matter of a few days. Is it time for investors to cash in their chips? We note that investors exit the stock market at their own peril, as long-term returns from equities consistently have outpaced long-term returns from other asset classes, such as fixed income and cash. As well, those returns are from eras when the 10-year Treasury bond yield was not sub-2.0%. So what's a potential equity strategy for investors amid all the uncertainty? Argus believes that Min Vol is an all-weather strategy that is timely in any investing climate. Academic literature and, more to the point, returns history indicate that Min Vol can deliver market-matching returns on an absolute basis and superior returns on a risk-adjusted basis over various time periods.",
            "tickers": [
                "CSCO",
                "VZ",
                "JNJ",
                "MRK",
                "TXN",
                "RHHBY",
                "PFE",
                "DHR",
                "MSFT",
                "ABT",
                "WM",
                "UL",
                "UPS",
                "AEE",
                "KO",
                "ICE",
                "ACN",
                "AEP",
                "DEO",
                "MCD",
                "LMT",
                "ROP",
                "CMCSA",
                "APD",
                "PG",
                "ENB",
                "PEP",
                "CHD",
                "ODFL",
                "WMT"
            ]
        },
        {
            "id": "31953_Stock Picks_1643010275000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2022-01-24T07:44:35Z",
            "reportTitle": "Oil prices are near $85 per barrel of West Texas Intermediate crude and continue a climb that began in April 2020, when the price was below $20. We think these relatively high prices will support the Energy sector, which has outperformed the market this year, in the near term. Within the group, we favor companies with a high exposure to U.S. production, as well as those with clean balance sheets and a history of growing dividends. Here are the Energy companies that are on our Focus List or that are used in our model portfolios.",
            "tickers": [
                "CVX",
                "PSX",
                "COP",
                "KMI",
                "ENB",
                "VLO",
                "DVN",
                "PXD",
                "NFG"
            ]
        },
        {
            "id": "31887_Market Outlook_1642144743000",
            "headHtml": "Daily Spotlight: Yield Curve Flattens as Fed Speaks",
            "provider": "Argus Research",
            "reportDate": "2022-01-14T07:19:03Z",
            "reportTitle": "At the Federal Reserve meeting last month, Chairman Powell and other Fed governors hinted at a faster pace of rate increases, this as record-high 40-year inflation rates persist. Since then, short-term rates have moved higher -- but the long end of the curve has hardly budged on future growth concerns due to the Omicron variant. The yield curve (two-year/10-year spread) has flattened from 91 basis points on December 1 to 71 basis points at month-end. For 2022, the market is now pricing in at least three rate hikes beginning in the spring. Meanwhile, the central bank's balance sheet continues to grow, topping the $8.76 trillion mark at the end of December from $7.3 trillion at the beginning of the year and $4 trillion pre-pandemic. The balance sheet consists of $6.1 trillion of U.S. Treasuries and $2.6 trillion in agency mortgage-backed securities. We expect the balance sheet to be under $8.9 trillion once tapering is completed. Future balance-sheet reductions may be a proxy for raising rates and intended to keep the yield curve steeper. We now expect the benchmark 10-year Treasury bond yield to range between 1.4% and 2.85% in 2022. We anticipate that the Federal Reserve will hike short-term interest rates three times in 2022 and two or three times in 2023, before moving to the sidelines once the federal funds rate approaches 1.75%-2.00% in 2024.",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "31837_Stock Picks_1641800747000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2022-01-10T07:45:47Z",
            "reportTitle": "This is among our most-important themes for 2022, and stretches across industries. We think companies that raise their dividends consistently at a double-digit rate are sending off three important signals amid all the recent market volatility: 1) the company's balance sheet is strong enough to pay a dividend; 2) management is focused on providing shareholder returns; and 3) management is confident enough in the near-term outlook to raise the payout aggressively. This third factor is especially important as the pandemic upends the nation's recent record of long-term economic growth. Here are 12 stocks that meet our double-digit dividend test and are on the Argus BUY list. They are also holdings in our Dividend Growth Separately Managed Account and in the Dividend Growers Total Return Trust, sponsored by SmartTrust.",
            "tickers": [
                "ALL",
                "NOC",
                "SHW",
                "DHI",
                "AMGN",
                "ADP",
                "ITW",
                "MSFT",
                "COST",
                "ABT",
                "ENB",
                "SPGI",
                "HD"
            ]
        },
        {
            "id": "31768_Thematic Portfolio_1640858323000",
            "headHtml": "The Argus Dividend Growth Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2021-12-30T09:58:43Z",
            "reportTitle": "Often overlooked amid gyrations in the stock market is dividend income, which is an important element of total return. Between 1930 and 2012, dividend income accounted for 42% of total return of the S&P 500, according to Hartford Funds. And that's just the average. In some decades, dividends accounted for more than 50% of total returns and even 100% of returns. More recently, dividends have accounted for 15%-20% of returns. Still, in 2018, dividend payments softened the blow when most market indices declined as the Federal Reserve hiked rates. But not all dividends are created equal, though, and it is important to understand the difference between the two main categories: high-yield stocks and dividend-growth stocks.",
            "tickers": [
                "BLK",
                "INTU",
                "JPM",
                "TXN",
                "ADP",
                "UNH",
                "DHR",
                "MSFT",
                "COST",
                "ABT",
                "MA",
                "BX",
                "LRCX",
                "ZTS",
                "SPGI",
                "SHW",
                "TJX",
                "EL",
                "AMT",
                "CBOE",
                "NEE",
                "AAP",
                "TMO",
                "ENB",
                "PH",
                "CTAS",
                "FAST",
                "HD",
                "MAS",
                "ODFL"
            ]
        },
        {
            "id": "31460_Market Outlook_1637569231000",
            "headHtml": "Daily Spotlight: Argus Research Adjusts 2021 Oil Forecast",
            "provider": "Argus Research",
            "reportDate": "2021-11-22T08:20:31Z",
            "reportTitle": "Our forecast for the average price of a barrel of West Texas Intermediate crude oil in 2021 is now $70, up from our earlier forecast of $65. We anticipate a trading range of $50-$85 for the year. The current price is around $80, toward the high end of the range. Our estimates assume OPEC and OPEC+ members continue to coordinate on production, and that global economic activity gradually improves into 2022. At the same time, our target also takes into account the long-term downward pressure on crude prices as Peak Oil approaches. Here are the recent average annual prices: $40 in 2020, $57 in 2019, $65 in 2018, $51 in 2017, $43 in 2016, $49 in 2015, $93 in 2014 and $98 in 2013. As well, we anticipate that President Biden's policies will continue to favor clean energy rather than carbon-based energy solutions. Our target price and range through 2022 are now $70, with $85 on the upside and $60 on the downside. Our investment rating on the Energy sector is Market-Weight. The U.S. rig-count trend remains supportive and valuations are attractive. Yet energy companies may be forced to cut production as more electric vehicles are introduced by mainstream automotive OEMs, and as utilities redouble efforts to add renewable generation sources. The current weight for the sector in the S&P 500 is approximately 3.0%, down from the 12% range in 2010. Within the group, we favor companies with strong balance sheets and a history of growing dividends.",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "3799_Analyst Report_1636982738000",
            "headHtml": "Analyst Report: Enbridge Inc",
            "provider": "Argus Research",
            "reportDate": "2021-11-15T13:25:38Z",
            "reportTitle": "Enbridge Inc. is North America's largest energy infrastructure company. Enbridge has six operating segments: Liquids Pipelines, Gas Transmission & Midstream, Gas Distribution, Renewable Power Generation & Transmission, Energy Services, and Eliminations & Other. According to the company's most recent 10-K, Enbridge delivers over three million barrels of crude oil per day, and transports 62% of all U.S.-bound Canadian crude exports. The company also transports 18% of the natural gas used in the U.S. Its regulated utilities serve approximately 3.7 million retail customers.",
            "targetPrice": 45.0,
            "investmentRating": "Bullish",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "31400_Market Update_1636981838000",
            "headHtml": "Market Update: ENB, OXY, PRGO, WWW, RIO, UBER",
            "provider": "Argus Research",
            "reportDate": "2021-11-15T13:10:38Z",
            "reportTitle": "Stocks gave up early gains on Monday morning as investors awaited reports from major retailers later this week along with October retail sales data. China posted stronger-than-expected industrial output and retail sales data for October. The Dow was flat, the S&P fell 0.1%, and the Nasdaq fell 0.4%. Crude oil fell 1% to $80 per barrel, while gold traded near $1866 per ounce.",
            "tickers": [
                "OXY",
                "WWW",
                "ENB",
                "RIO",
                "UBER",
                "PRGO"
            ]
        },
        {
            "id": "31359_Market Outlook_1636528255000",
            "headHtml": "Daily Spotlight: We Look for Rates to Rise",
            "provider": "Argus Research",
            "reportDate": "2021-11-10T07:10:55Z",
            "reportTitle": "In recent weeks, yields have continued to head higher. During October, the curve (two-year/10-year spread) flattened from 121 basis points on October 1 to 107 basis points at month-end on expectations of higher short-term rates (offset by future growth concerns on the long-end). The three-month T-bill ranged between 0.04% and 0.06% in October, at the low end of Fed's federal funds target range of 0.00% to 0.25%, but matching the rate of the new Fed overnight program. Institutions remain flush with cash, as evidenced by the barely positive return, and the Fed continues to finance additional purchases in the repo market. The two-year Treasury yield moved higher during the month, rising to 0.48% at month-end from 0.27% on October 1. At the longer end of the curve, 10-year yields marched higher, yielding 1.48% on September 1 and topping out at 1.68% on October 21, before closing  the month at 1.55% on the heels of disappointing 3Q GDP. Real 10-year yields (10-year Treasury-10-year TIPS) ended September at -1.00%, declining from -0.90% at the beginning of the month and reflecting the divergent opinion in long-term real rates and inflation expectations. Our year-end 2022 target for the 10-year Treasury bond yield is 2.25%. We believe the Fed will hike short-term interest rates one time in 2022.",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "31359_Market Outlook_1636527355000",
            "headHtml": "Daily Spotlight: We Look for Rates to Rise",
            "provider": "Argus Research",
            "reportDate": "2021-11-10T06:55:55Z",
            "reportTitle": "In recent weeks, yields have continued to head higher. During October, the curve (two-year/10-year spread) flattened from 121 basis points on October 1 to 107 basis points at month-end on expectations of higher short-term rates (offset by future growth concerns on the long-end). The three-month T-bill ranged between 0.04% and 0.06% in October, at the low end of Fed's federal funds target range of 0.00% to 0.25%, but matching the rate of the new Fed overnight program. Institutions remain flush with cash, as evidenced by the barely positive return, and the Fed continues to finance additional purchases in the repo market. The two-year Treasury yield moved higher during the month, rising to 0.48% at month-end from 0.27% on October 1. At the longer end of the curve, 10-year yields marched higher, yielding 1.48% on September 1 and topping out at 1.68% on October 21, before closing  the month at 1.55% on the heels of disappointing 3Q GDP. Real 10-year yields (10-year Treasury-10-year TIPS) ended September at -1.00%, declining from -0.90% at the beginning of the month and reflecting the divergent opinion in long-term real rates and inflation expectations. Our year-end 2022 target for the 10-year Treasury bond yield is 2.25%. We believe the Fed will hike short-term interest rates one time in 2022.",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "30670_Thematic Portfolio_1629282444000",
            "headHtml": "The Argus High-Yield Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2021-08-18T10:27:24Z",
            "reportTitle": "Value stocks are outperforming growth in 2021 for the first time since 2016. While a recent rally in growth stocks has narrowed the performance advantage for value in the year to date, an environment of historically low interest rates is one in which many investors are still searching for high levels of income -- which often can be found in value stocks. When we look for attractive high-yield/deep-value stocks at Argus, we look for low valuations on metrics such as price/earnings, price/sales, price/book, yield, and price/cash flow. We also look for companies with clean balance sheets, high levels of profitability, high-quality earnings, and experienced management teams. We seek to avoid companies in industries that are in secular decline, or with dividend yields that are so high that the payout is clearly at risk. Based on numerous requests from clients, we have designed a portfolio of companies that are BUY-rated at Argus Research, have a Financial Strength rating of at least Medium, and have a yield of 3.0% or higher.",
            "tickers": [
                "CVX",
                "VZ",
                "AGNC",
                "CFG",
                "SLF",
                "AMGN",
                "PPL",
                "PFE",
                "TFC",
                "PRU",
                "LYB",
                "IBM",
                "VNO",
                "UL",
                "VLO",
                "NLY",
                "DUK",
                "SO",
                "SNY",
                "IP",
                "ABBV",
                "MMM",
                "DOW",
                "PSX",
                "EIX",
                "ENB",
                "DRI",
                "PEAK",
                "MET"
            ]
        },
        {
            "id": "30638_Market Outlook_1629096842000",
            "headHtml": "Daily Spotlight: Argus Research Adjusts Oil Price Forecast",
            "provider": "Argus Research",
            "reportDate": "2021-08-16T06:54:02Z",
            "reportTitle": "Our 2021 forecast for the average price of a barrel of West Texas Intermediate crude oil is now $65, up from our preliminary forecast of $59. Our estimates assume OPEC and OPEC+ members continue to coordinate on production and that there will be gradually improving global economic activity this year and next. Our target price also takes into account the long-term downtrend for crude prices as Peak Oil approaches. Here are the recent average annual prices: $40 in 2020, $57 in 2019, $65 in 2018, $51 in 2017, $43 in 2016, $49 in 2015, $93 in 2014, and $98 in 2013. As well, we anticipate that President Biden's policies will continue to favor clean energy rather than carbon-based energy solutions. Our range through 2022 is now $70 on the upside and $50 on the downside. We recently lowered our rating on the Energy sector to Under-Weight from Market-Weight. The year-to-date surge in Energy stocks has not been matched by rising production levels. Instead, Energy companies continue to cut production as more electric vehicles are introduced and as utilities redouble their efforts to add to renewable generation sources. Within Energy, we favor companies with strong balance sheets and a history of growing dividends.",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "3799_Analyst Report_1628086520000",
            "headHtml": "Analyst Report: Enbridge Inc",
            "provider": "Argus Research",
            "reportDate": "2021-08-04T14:15:20Z",
            "reportTitle": "Enbridge Inc. is North America's largest energy infrastructure company. Enbridge has six operating segments: Liquids Pipelines, Gas Transmission & Midstream, Gas Distribution, Renewable Power Generation & Transmission, Energy Services, and Eliminations & Other. According to the company's most recent 10-K, Enbridge delivers over three million barrels of crude oil per day, and transports 62% of all U.S.-bound Canadian crude exports. The company also transports 18% of the natural gas used in the U.S. Its regulated utilities serve approximately 3.7 million retail customers.",
            "targetPrice": 43.0,
            "investmentRating": "Bullish",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "30553_Market Update_1628086520000",
            "headHtml": "Market Update: ENB, CVX, LHX, JCI, VFC, NOW, CARR",
            "provider": "Argus Research",
            "reportDate": "2021-08-04T14:15:20Z",
            "reportTitle": "Stocks fell on Wednesday morning as investors weighed a new round of earnings reports and weaker-than-expected employment data. Payroll provider ADP said that U.S. companies added 330,000 jobs in July, down from 680,000 in June and well below the Reuters consensus forecast of 695,000. Services sector data was positive. The Institute for Supply Management said that its nonmanufacturing index rose to a record 64.1 in July, up from 60.1 in June and above the consensus forecast. The Dow fell 0.6%, the S&P 0.4%, and the Nasdaq 0.1%. Crude oil traded near $69 per barrel, while gold fell slightly to $1813 per ounce.",
            "tickers": [
                "JCI",
                "CARR",
                "VFC",
                "CVX",
                "NOW",
                "ENB",
                "LHX"
            ]
        },
        {
            "id": "30483_Thematic Portfolio_1627381274000",
            "headHtml": "The Argus Min Vol Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2021-07-27T10:21:14Z",
            "reportTitle": "The onset of the coronavirus in 2020 knocked the stock market into a bear market. Though stocks have recovered, the U.S. economy is about to slow down and COVID-19 cases are rising again as virus variants spread. Volatility, which has dropped from the highs of 2020, still has not returned to pre-COVID levels.  Daily prices can swing wildly, as they did during two consecutive days in mid-July when the Dow Jones Industrial Average plummeted more than 1,000 points. Yet investors exit the stock market at their own peril, as long-term returns from equities consistently have outpaced long-term returns from other asset classes. Argus believes that Min Vol is an all-weather strategy that is timely in any investing climate and can deliver market-matching returns on an absolute basis and superior returns on a risk-adjusted basis over various time periods.",
            "tickers": [
                "CSCO",
                "VZ",
                "JNJ",
                "MRK",
                "TXN",
                "AMGN",
                "PFE",
                "DHR",
                "MSFT",
                "WM",
                "UL",
                "UPS",
                "MKC",
                "AMT",
                "CL",
                "ICE",
                "ACN",
                "MMM",
                "MCD",
                "NEE",
                "LMT",
                "CMCSA",
                "WEC",
                "APD",
                "PG",
                "ENB",
                "PEP",
                "CHD",
                "ODFL",
                "WMT"
            ]
        },
        {
            "id": "30393_Market Outlook_1626419333000",
            "headHtml": "Daily Spotlight: Canadian Recovery Continues",
            "provider": "Argus Research",
            "reportDate": "2021-07-16T07:08:53Z",
            "reportTitle": "The Canadian economy continues its recovery as pandemic restrictions have eased. Statistics Canada reported a surge of 231,000 new jobs in June, with particular strength in the retail and food services industries (which were hit hard during the pandemic). The Canadian unemployment rate now stands at 7.8%, down from 8.2% in May. Seeing a more-robust economy and a Business Outlook Survey that recently hit an all-time high, the Bank of Canada is expected to taper asset purchases by another C$1 billion per week as of mid-July, this after being the first G7 country to begin tapering in April. Economists now expect the Canadian central bank to unwind its asset purchases completely by year-end, before the U.S. Federal Reserve is expected to begin its tapering. Meanwhile, the sharp rebound in oil prices over the past year has been a boon for the country's Energy sector, a major contributor to the resource-heavy Canadian economy. We believe select companies in Canada offer compelling investment opportunities.",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "30245_Thematic Portfolio_1624869344000",
            "headHtml": "The Argus Global Dividend Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2021-06-28T08:35:44Z",
            "reportTitle": "Dividends are supposed to lend stability to a portfolio. However, U.S.-based equity income investors have experienced a high degree of volatility in recent years as the endless speculation over the direction of rates has created market-timing headaches. Investors have endured wide swings in prices for rate-sensitive equity sectors such as utilities, REITs and MLPs. In our view, investing in international income stocks is one way to increase portfolio diversification while reducing sensitivity to volatile U.S interest rates. Investing in overseas stocks carries its own set of risks, including the impact of currency exchange and geopolitical turmoil. But there are also a number of positives in this segment for U.S. investors.",
            "tickers": [
                "RY",
                "NVS",
                "MFC",
                "BHP",
                "SLF",
                "RHHBY",
                "BP",
                "BUD",
                "CCEP",
                "UL",
                "GSK",
                "HMC",
                "SNY",
                "BCE",
                "ERIC",
                "LRLCY",
                "VOD",
                "CP",
                "DEO",
                "NGG",
                "TSM",
                "AZN",
                "ORAN",
                "BTI",
                "ENB",
                "RIO",
                "TM"
            ]
        },
        {
            "id": "3799_Analyst Report_1621926492000",
            "headHtml": "Analyst Report: Enbridge Inc",
            "provider": "Argus Research",
            "reportDate": "2021-05-25T07:08:12Z",
            "reportTitle": "Enbridge Inc. is North America's largest energy infrastructure company. Enbridge has six operating segments: Liquids Pipelines, Gas Transmission & Midstream, Gas Distribution, Renewable Power Generation & Transmission, Energy Services, and Eliminations & Other. According to the company's most recent 10-K, Enbridge delivers over three million barrels of crude oil per day, and transports 62% of all U.S.-bound Canadian crude exports. The company also transports 18% of the natural gas used in the U.S. Its regulated utilities serve approximately 3.7 million retail customers.",
            "targetPrice": 43.0,
            "investmentRating": "Bullish",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "29966_Market Summary_1621925592000",
            "headHtml": "Market Digest: ENB, PPL, PANW",
            "provider": "Argus Research",
            "reportDate": "2021-05-25T06:53:12Z",
            "reportTitle": "Data from Vickers Stock Research continues to reflect rambling sentiment among corporate insiders, in many ways matching the tone of the overall stock market. While that may seem to be an uncompelling statement, corporate executives, directors and beneficial owners are not usually in lockstep with the broader investing community. The typically sell more often than they buy, they sell earlier than many other investors as stocks are rising, and they buy earlier than many other investors when stocks are falling. So when they are behaving <MM>just like everyone else,<MM> we notice.",
            "tickers": [
                "ENB",
                "PPL",
                "PANW"
            ]
        },
        {
            "id": "29910_Market Outlook_1621321246000",
            "headHtml": "Daily Spotlight: Argus Adjusts Oil Price Forecast",
            "provider": "Argus Research",
            "reportDate": "2021-05-18T07:00:46Z",
            "reportTitle": "Our 2021 forecast for the average price of a barrel of West Texas Intermediate crude oil is now $59, up from $53. Our estimate assumes OPEC and OPEC+ members continue to coordinate on production cuts and that there will be gradually improving global economic activity this year. Our target price also reflects the long-term downward pressure on crude prices as Peak Oil approaches. Here are the recent average annual prices: $40 in 2020, $57 in 2019, $65 in 2018, $51 in 2017, $43 in 2016, $49 in 2015, $93 in 2014 and $98 in 2013. Further, we anticipate that President Biden's policies will continue to favor clean energy initiatives rather than carbon-based energy solutions. Our range through 2021 is now $70 on the upside and $50 on the downside. Given the recovery in in oil prices and the outlook for stability over the next few quarters, our investment recommendation on the Energy sector is Market-Weight. The current weight for the sector in the S&P 500 is approximately 2.9%, down from the 7%-8% range in 2013-2014. Within the group, we favor companies with strong balance sheets and a history of growing dividends.",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "29863_Thematic Portfolio_1620821989000",
            "headHtml": "The Argus Dividend Growth Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2021-05-12T12:19:49Z",
            "reportTitle": "Often overlooked amid gyrations in the stock market is dividend income, which is an important element of total return. Between 1930 and 2012, dividend income accounted for 42% of total return of the S&P 500, according to Hartford Funds. And that's just the average. In some decades, dividends accounted for more than 50% of total returns and even 100% of returns. More recently, dividends have accounted for 15%-20% of returns. Still, in 2018, dividend payments softened the blow when most market indices declined as the Federal Reserve hiked rates. Not all dividends are created equal, though, and it is important to understand the difference between the two main categories: high-yield stocks and dividend-growth stocks.",
            "tickers": [
                "BLK",
                "ALL",
                "DHI",
                "INTU",
                "CFG",
                "JPM",
                "TXN",
                "AMGN",
                "ADP",
                "ITW",
                "MSFT",
                "COST",
                "PRU",
                "ABT",
                "GLW",
                "MA",
                "SBUX",
                "LLY",
                "SPGI",
                "NOC",
                "SHW",
                "SYK",
                "HON",
                "EL",
                "CMCSA",
                "WEC",
                "ENB",
                "FAST",
                "HD",
                "ODFL"
            ]
        },
        {
            "id": "29158_Market Outlook_1613545898000",
            "headHtml": "Daily Spotlight: Argus Adjusts Oil Price Forecast for 2021",
            "provider": "Argus Research",
            "reportDate": "2021-02-17T07:11:38Z",
            "reportTitle": "Our 2021 forecast for the average price of a barrel of West Texas Intermediate crude oil is now $53, up from our preliminary forecast of $41. Our estimates assume OPEC and OPEC+ members continue to coordinate on production cuts and on gradually improving global economic activity this year. Our target price also reflects the long-term downtrend for crude prices as Peak Oil approaches. Here are recent average annual prices: $40 in 2020, $57 in 2019, $65 in 2018, $51 in 2017, $43 in 2016, $49 in 2015, $93 in 2014 and $98 in 2013. We anticipate that President Biden's policies will favor clean energy initiatives rather than carbon-based energy solutions. Our range through 2021 is now $65 on the upside and $35 on the downside. Given the volatility in oil prices, our investment recommendation on the Energy sector is Under-Weight. The current weight for the sector in the S&P 500 is approximately 2.4%, down from the 7%-8% range in 2013-2014.  Within the group, we favor companies with strong balance sheets and a history of growing dividends.",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "3799_Analyst Report_1613482956000",
            "headHtml": "Analyst Report: Enbridge Inc",
            "provider": "Argus Research",
            "reportDate": "2021-02-16T13:42:36Z",
            "reportTitle": "Enbridge Inc. is North America's largest energy infrastructure company. Enbridge has six operating segments: Liquids Pipelines, Gas Transmission & Midstream, Gas Distribution, Renewable Power Generation & Transmission, Energy Services, and Eliminations & Other. According to the company's most recent 10-K, Enbridge delivers over three million barrels of crude oil per day, and transports 62% of all U.S.-bound Canadian crude exports. The company also transports 18% of the natural gas used in the U.S. Its regulated utilities serve approximately 3.7 million retail customers.",
            "targetPrice": 40.0,
            "investmentRating": "Bullish",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "29151_Market Update_1613482056000",
            "headHtml": "Market Update: ENB, CME, HP, X, GM, KHC",
            "provider": "Argus Research",
            "reportDate": "2021-02-16T13:27:36Z",
            "reportTitle": "Stocks edged higher on Tuesday morning amid continued optimism about the Biden administration's stimulus plan and further declines in new coronavirus cases. On the earnings front, CVS Health topped the 4Q consensus EPS forecast, though earnings fell sharply from the prior year. The Dow rose 0.2%, the S&P 0.1%, and the Nasdaq 0.1%. Crude oil traded near $60 per barrel, while gold fell $10 to $1813 per ounce.",
            "tickers": [
                "GM",
                "KHC",
                "ENB",
                "HP",
                "X",
                "CME"
            ]
        },
        {
            "id": "28969_Stock Picks_1611560211000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2021-01-25T07:36:51Z",
            "reportTitle": "Oil prices, near $52 per barrel of West Texas Intermediate crude, have continued a climb that began in April 2020, when the price was below $20. Though prices are down slightly from recent highs, we expect them to remain in the $45-$55 range this year. We think these relatively high prices will continue to provide near-term support to the Energy sector, which has outperformed the market this year. Within the group, we favor companies with a high exposure to U.S. production, as well as those with a history of growing dividends. Here are Energy companies that are in our Focus List or are used in our Model portfolios.",
            "tickers": [
                "CVX",
                "PSX",
                "COP",
                "KMI",
                "RDS-A",
                "ENB",
                "VLO",
                "BP",
                "NFG"
            ]
        },
        {
            "id": "28728_Thematic Portfolio_1608633108000",
            "headHtml": "The Argus High-Yield Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2020-12-22T10:31:48Z",
            "reportTitle": "Growth stocks may be outperforming value, again, in 2020. But in an environment of historically low interest rates (and with the coronavirus and economic shutdown seemingly poised to keep them low for a long time), many investors are still searching for high levels of income, which can often be found in value stocks. Progress on COVID-19 vaccines has given a lift to some of the cyclical companies (energy companies and regional banks) that have lagged in recent quarters, and value stocks have kept up the pace with growth stocks in the past quarter. The current yield on the iShares Russell 1000 Value Index ETF is 2.5%, compared to the 1.0% current yield on the iShares Russell 1000 Growth Index ETF.  This is not unimportant, as the current yield on the 10-year Treasury bond is 0.95%.",
            "tickers": [
                "AVGO",
                "CVX",
                "VZ",
                "AGNC",
                "CFG",
                "MRK",
                "K",
                "PPL",
                "NFG",
                "PFE",
                "TFC",
                "PRU",
                "T",
                "IBM",
                "STX",
                "PNW",
                "VLO",
                "NLY",
                "SO",
                "MO",
                "USB",
                "ABBV",
                "PKG",
                "LMT",
                "PSX",
                "EIX",
                "REG",
                "ENB",
                "GPC",
                "MET"
            ]
        },
        {
            "id": "3799_Analyst Report_1605769929000",
            "headHtml": "Analyst Report: Enbridge Inc",
            "provider": "Argus Research",
            "reportDate": "2020-11-19T07:12:09Z",
            "reportTitle": "Enbridge Inc. is North America's largest energy infrastructure company. Enbridge has six operating segments: Liquids Pipelines, Gas Transmission & Midstream, Gas Distribution, Renewable Power Generation & Transmission, Energy Services, and Eliminations & Other. According to the company's most recent 10-K, Enbridge delivers over three million barrels of crude oil per day, and transports 62% of all U.S.-bound Canadian crude exports. The company also transports 18% of the natural gas used in the U.S. Its regulated utilities serve approximately 3.7 million retail customers.",
            "targetPrice": 38.0,
            "investmentRating": "Bullish",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "28465_Market Summary_1605769029000",
            "headHtml": "Market Digest: ENB, MAR",
            "provider": "Argus Research",
            "reportDate": "2020-11-19T06:57:09Z",
            "reportTitle": "Vaccines and a Still-Open Economy Push Dow Toward 30,000",
            "tickers": [
                "ENB",
                "MAR"
            ]
        },
        {
            "id": "28233_Thematic Portfolio_1603271869000",
            "headHtml": "The Argus Global Dividend Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2020-10-21T09:17:49Z",
            "reportTitle": "Dividends are supposed to lend stability to a portfolio. However, U.S.-based equity income investors have experienced a high degree of volatility in recent years. In our view, investing in international income stocks is one way to increase portfolio diversification while reducing sensitivity to volatile U.S interest rates. Investing in overseas stocks carries its own set of risks, including the impact of currency exchange and geopolitical turmoil. But there are also a number of positives in this segment for U.S. investors. One is a more robust selection of high-quality names. Yields also tend to be higher in overseas markets in general. And finally, valuations can be more attractive.",
            "tickers": [
                "RY",
                "NVS",
                "BHP",
                "SLF",
                "RHHBY",
                "BP",
                "BUD",
                "CCEP",
                "UN",
                "GSK",
                "HMC",
                "SNY",
                "BCE",
                "ERIC",
                "LRLCY",
                "VOD",
                "CP",
                "DEO",
                "NGG",
                "TSM",
                "AZN",
                "ORAN",
                "BTI",
                "RDS-A",
                "ENB",
                "RIO",
                "TM",
                "CNI"
            ]
        },
        {
            "id": "27761_Stock Picks_1598264912000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2020-08-24T10:28:32Z",
            "reportTitle": "Argus has published its latest Portfolio Selector, which features its popular Focus List. Each month, Director of Research Jim Kelleher, CFA, surveys the team of Argus Research industry analysts for their timeliest recommendations out of the company's fundamental universe of approximately 500 stocks. The Focus List typically includes 30 stocks: turnover is high, as Director of Research Kelleher typically adds three or four new stocks per month. Below are the latest additions, all of which are rated BUY.",
            "tickers": [
                "CIEN",
                "FIS",
                "TJX",
                "ENB"
            ]
        },
        {
            "id": "27761_Stock Picks_1598227200000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2020-08-24T00:00:00Z",
            "reportTitle": "Argus has published its latest Portfolio Selector, which features its popular Focus List. Each month, Director of Research Jim Kelleher, CFA, surveys the team of Argus Research industry analysts for their timeliest recommendations out of the company's fundamental universe of approximately 500 stocks. The Focus List typically includes 30 stocks: turnover is high, as Director of Research Kelleher typically adds three or four new stocks per month. Below are the latest additions, all of which are rated BUY.",
            "tickers": [
                "CIEN",
                "FIS",
                "TJX",
                "ENB"
            ]
        },
        {
            "id": "27714_Market Outlook_1597822143000",
            "headHtml": "Daily Spotlight: Argus Raises Oil Price Forecast",
            "provider": "Argus Research",
            "reportDate": "2020-08-19T07:29:03Z",
            "reportTitle": "Our 2020 forecast for the average price of a barrel of oil is now $38 for West Texas Intermediate crude, up from our former forecast of $30 per barrel. Our revised estimate assumes OPEC and OPEC+ members continue to coordinate on production cuts of 9.6 million barrels per day, and on gradually improving economic activity through the rest of 2020. Our target price also reflects the long-term downtrend for crude prices as Peak Oil approaches. The recent average annual prices are $57 in 2019, $65 in 2018, $51 in 2017, $43 in 2016, $49 in 2015, $93 in 2014 and $98 in 2013. Our range through 2021 is now $50 on the upside and $30 on the downside. Given the volatility in oil prices, our investment recommendation on the Energy sector is now Under-Weight.  The current weight for the sector in the S&P 500 is approximately 2.5%, down from the 7%-8% range in 2013-2014. Within the group, we favor companies with strong balance sheets and a history of growing dividends.",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "27714_Market Outlook_1597795200000",
            "headHtml": "Daily Spotlight: Argus Raises Oil Price Forecast",
            "provider": "Argus Research",
            "reportDate": "2020-08-19T00:00:00Z",
            "reportTitle": "Our 2020 forecast for the average price of a barrel of oil is now $38 for West Texas Intermediate crude, up from our former forecast of $30 per barrel. Our revised estimate assumes OPEC and OPEC+ members continue to coordinate on production cuts of 9.6 million barrels per day, and on gradually improving economic activity through the rest of 2020. Our target price also reflects the long-term downtrend for crude prices as Peak Oil approaches. The recent average annual prices are $57 in 2019, $65 in 2018, $51 in 2017, $43 in 2016, $49 in 2015, $93 in 2014 and $98 in 2013. Our range through 2021 is now $50 on the upside and $30 on the downside. Given the volatility in oil prices, our investment recommendation on the Energy sector is now Under-Weight.  The current weight for the sector in the S&P 500 is approximately 2.5%, down from the 7%-8% range in 2013-2014. Within the group, we favor companies with strong balance sheets and a history of growing dividends.",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "27683_Portfolio Ideas_1597394673000",
            "headHtml": "Improving Data Drives Stocks Amid Rising Infections",
            "provider": "Argus Research",
            "reportDate": "2020-08-14T08:44:33Z",
            "reportTitle": "The Portfolio Selector features the Argus Focus List, a group of 30 \"best idea\" stocks generated and regularly updated by Argus' analysts and investment policy committee. It also includes the director of research’s monthly investment strategy column, stock recommendations and sector picks, economic forecasts, and an asset allocation model. This month, the Focus List additions are Enbridge Inc (ENB); Fidelity Natl Information Serv (FIS); CIENA Corp. (CIEN); TJX Companies, Inc. (TJX) and the Focus List deletions are American Express Co. (AXP); Oneok Inc. (OKE); Wayfair Inc (W); Western Digital Corp. (WDC).",
            "tickers": [
                "CIEN",
                "FIS",
                "TJX",
                "W",
                "WDC",
                "ENB",
                "OKE",
                "AXP"
            ]
        },
        {
            "id": "27683_Portfolio Ideas_1597363200000",
            "headHtml": "Improving Data Drives Stocks Amid Rising Infections",
            "provider": "Argus Research",
            "reportDate": "2020-08-14T00:00:00Z",
            "reportTitle": "The Portfolio Selector features the Argus Focus List, a group of 30 \"best idea\" stocks generated and regularly updated by Argus' analysts and investment policy committee. It also includes the director of research’s monthly investment strategy column, stock recommendations and sector picks, economic forecasts, and an asset allocation model. This month, the Focus List additions are Enbridge Inc (ENB); Fidelity Natl Information Serv (FIS); CIENA Corp. (CIEN); TJX Companies, Inc. (TJX) and the Focus List deletions are American Express Co. (AXP); Oneok Inc. (OKE); Wayfair Inc (W); Western Digital Corp. (WDC).",
            "tickers": [
                "CIEN",
                "FIS",
                "TJX",
                "W",
                "WDC",
                "ENB",
                "OKE",
                "AXP"
            ]
        },
        {
            "id": "3799_Analyst Report_1596525271000",
            "headHtml": "Analyst Report: Enbridge Inc",
            "provider": "Argus Research",
            "reportDate": "2020-08-04T07:14:31Z",
            "reportTitle": "Enbridge Inc. is North America's largest energy infrastructure company. Enbridge has six operating segments: Liquids Pipelines, Gas Transmission & Midstream, Gas Distribution, Renewable Power Generation & Transmission, Energy Services, and Eliminations & Other. According to the company's most recent 10-K, Enbridge delivers over three million barrels of crude oil per day, and transports 62% of all U.S.-bound Canadian crude exports. The company also transports 18% of the natural gas used in the U.S. Its regulated utilities serve approximately 3.7 million retail customers.",
            "targetPrice": 38.0,
            "investmentRating": "Bullish",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "27589_Market Summary_1596524371000",
            "headHtml": "Market Digest: ENB, BYD, LAZ, MSFT, NOK, SON, CBOE, FB",
            "provider": "Argus Research",
            "reportDate": "2020-08-04T06:59:31Z",
            "reportTitle": "Much of the weekly data from Vickers Stock Research suggests that things are pretty much as expected in the world of insider transactions. Earnings season is still underway and the volume of insider transactions is therefore low. As well, most of Vickers' insider indexes and insider sell/buy ratios are either neutral or slightly bearish. That makes sense as insiders jumped in when stock prices cratered on COVID-19 fears, and those same insiders have pulled back as stocks have rebounded. So is there anything of note in current insider activity? Why yes there is.",
            "tickers": [
                "MSFT",
                "META",
                "SON",
                "LAZ",
                "ENB",
                "CBOE",
                "NOK",
                "BYD"
            ]
        },
        {
            "id": "3799_Analyst Report_1596499200000",
            "headHtml": "Analyst Report: Enbridge Inc",
            "provider": "Argus Research",
            "reportDate": "2020-08-04T00:00:00Z",
            "reportTitle": "Enbridge Inc. is North America's largest energy infrastructure company. Enbridge has six operating segments: Liquids Pipelines, Gas Transmission & Midstream, Gas Distribution, Renewable Power Generation & Transmission, Energy Services, and Eliminations & Other. According to the company's most recent 10-K, Enbridge delivers over three million barrels of crude oil per day, and transports 62% of all U.S.-bound Canadian crude exports. The company also transports 18% of the natural gas used in the U.S. Its regulated utilities serve approximately 3.7 million retail customers.",
            "targetPrice": 38.0,
            "investmentRating": "Bullish",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "27589_Market Summary_1596499200000",
            "headHtml": "Market Digest: ENB, BYD, LAZ, MSFT, NOK, SON, CBOE, FB",
            "provider": "Argus Research",
            "reportDate": "2020-08-04T00:00:00Z",
            "reportTitle": "Much of the weekly data from Vickers Stock Research suggests that things are pretty much as expected in the world of insider transactions. Earnings season is still underway and the volume of insider transactions is therefore low. As well, most of Vickers' insider indexes and insider sell/buy ratios are either neutral or slightly bearish. That makes sense as insiders jumped in when stock prices cratered on COVID-19 fears, and those same insiders have pulled back as stocks have rebounded. So is there anything of note in current insider activity? Why yes there is.",
            "tickers": [
                "MSFT",
                "SON",
                "LAZ",
                "ENB",
                "CBOE",
                "NOK",
                "BYD",
                "FB"
            ]
        },
        {
            "id": "27063_Market Update_1590761426000",
            "headHtml": "Market Update: AAP, CAH, FL, NTAP, BBY, ENB, CMS",
            "provider": "Argus Research",
            "reportDate": "2020-05-29T14:10:26Z",
            "reportTitle": "Stocks were mixed on Friday morning amid continued U.S.-China tensions over Hong Kong and weak consumer spending data. The Commerce Department said that consumer spending fell 13.6% in April, nearly double the 6.9% drop in March and more than the Reuters consensus forecast, which called for a decline of 12.6%. The Dow fell 0.7%, the S&P fell 0.4%, and the Nasdaq rose 0.2%. Crude oil fell slightly to $33.50 per barrel, while gold rose $23 to $1751 per ounce.",
            "tickers": [
                "AAP",
                "NTAP",
                "FL",
                "ENB",
                "BBY",
                "CMS",
                "CAH"
            ]
        },
        {
            "id": "3799_Analyst Report_1590761426000",
            "headHtml": "Analyst Report: Enbridge Inc",
            "provider": "Argus Research",
            "reportDate": "2020-05-29T14:10:26Z",
            "reportTitle": "Enbridge Inc. is North America's largest energy infrastructure company. Enbridge has six operating segments: Liquids Pipelines, Gas Transmission & Midstream, Gas Distribution, Renewable Power Generation & Transmission, Energy Services, and Eliminations & Other. According to the company's most recent 10-K, Enbridge delivers over three million barrels of crude oil per day, and transports 62% of all U.S.-bound Canadian crude exports. The company also transports 18% of the natural gas used in the U.S. Its regulated utilities serve approximately 3.7 million retail customers.",
            "targetPrice": 38.0,
            "investmentRating": "Bullish",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "27063_Market Update_1590710400000",
            "headHtml": "Market Update: AAP, CAH, FL, NTAP, BBY, ENB, CMS",
            "provider": "Argus Research",
            "reportDate": "2020-05-29T00:00:00Z",
            "reportTitle": "Stocks were mixed on Friday morning amid continued U.S.-China tensions over Hong Kong and weak consumer spending data. The Commerce Department said that consumer spending fell 13.6% in April, nearly double the 6.9% drop in March and more than the Reuters consensus forecast, which called for a decline of 12.6%. The Dow fell 0.7%, the S&P fell 0.4%, and the Nasdaq rose 0.2%. Crude oil fell slightly to $33.50 per barrel, while gold rose $23 to $1751 per ounce.",
            "tickers": [
                "AAP",
                "NTAP",
                "FL",
                "ENB",
                "BBY",
                "CMS",
                "CAH"
            ]
        },
        {
            "id": "3799_Analyst Report_1590710400000",
            "headHtml": "Analyst Report: Enbridge Inc",
            "provider": "Argus Research",
            "reportDate": "2020-05-29T00:00:00Z",
            "reportTitle": "Enbridge Inc. is North America's largest energy infrastructure company. Enbridge has six operating segments: Liquids Pipelines, Gas Transmission & Midstream, Gas Distribution, Renewable Power Generation & Transmission, Energy Services, and Eliminations & Other. According to the company's most recent 10-K, Enbridge delivers over three million barrels of crude oil per day, and transports 62% of all U.S.-bound Canadian crude exports. The company also transports 18% of the natural gas used in the U.S. Its regulated utilities serve approximately 3.7 million retail customers.",
            "targetPrice": 38.0,
            "investmentRating": "Bullish",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "26296_Thematic Portfolio_1582786699000",
            "headHtml": "The Argus Global Dividend Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2020-02-27T06:58:19Z",
            "reportTitle": "Dividends are supposed to lend stability to a portfolio. However, U.S.-based equity income investors have experienced a high degree of volatility in recent years. In 2018, the Federal Reserve embarked on an aggressive campaign to raise interest rates -- causing Treasury yields to swoop and dive, resulting in a wild ride for supposedly stable U.S. high-income equities. In 2019, the Fed lowered rates, in order to restore a normal upward slope in the yield curve. And in 2020, global investors, fearing the spread of the coronavirus, have pushed rates lower still. The endless speculation over the direction of rates has created market-timing headaches for equity income investors. They have endured wide swings in prices for rate-sensitive equity classes such as utilities, REITs and MLPs -- even as generally positive industry fundamentals remained largely intact. In our view, investing in international income stocks is one way to increase portfolio diversification while reducing sensitivity to U.S interest rates. Investing in overseas stocks carries its own set of risks, including the impact of currency exchange and geopolitical turmoil. But there are also many positives in this asset class for U.S. investors.",
            "tickers": [
                "RY",
                "NVS",
                "BHP",
                "SLF",
                "RHHBY",
                "BP",
                "BUD",
                "CCEP",
                "UN",
                "GSK",
                "HMC",
                "SNY",
                "BCE",
                "ERIC",
                "PUK",
                "LRLCY",
                "VOD",
                "CP",
                "HSBC",
                "NGG",
                "TSM",
                "AZN",
                "ORAN",
                "BTI",
                "ENB",
                "RIO",
                "TM",
                "BSBR"
            ]
        },
        {
            "id": "26296_Thematic Portfolio_1582761600000",
            "headHtml": "The Argus Global Dividend Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2020-02-27T00:00:00Z",
            "reportTitle": "Dividends are supposed to lend stability to a portfolio. However, U.S.-based equity income investors have experienced a high degree of volatility in recent years. In 2018, the Federal Reserve embarked on an aggressive campaign to raise interest rates -- causing Treasury yields to swoop and dive, resulting in a wild ride for supposedly stable U.S. high-income equities. In 2019, the Fed lowered rates, in order to restore a normal upward slope in the yield curve. And in 2020, global investors, fearing the spread of the coronavirus, have pushed rates lower still. The endless speculation over the direction of rates has created market-timing headaches for equity income investors. They have endured wide swings in prices for rate-sensitive equity classes such as utilities, REITs and MLPs -- even as generally positive industry fundamentals remained largely intact. In our view, investing in international income stocks is one way to increase portfolio diversification while reducing sensitivity to U.S interest rates. Investing in overseas stocks carries its own set of risks, including the impact of currency exchange and geopolitical turmoil. But there are also many positives in this asset class for U.S. investors.",
            "tickers": [
                "RY",
                "NVS",
                "BHP",
                "SLF",
                "RHHBY",
                "BP",
                "BUD",
                "CCEP",
                "UN",
                "GSK",
                "HMC",
                "SNY",
                "BCE",
                "ERIC",
                "PUK",
                "LRLCY",
                "VOD",
                "CP",
                "HSBC",
                "NGG",
                "TSM",
                "AZN",
                "ORAN",
                "BTI",
                "ENB",
                "RIO",
                "TM",
                "BSBR"
            ]
        },
        {
            "id": "3799_Analyst Report_1582183611000",
            "headHtml": "Analyst Report: Enbridge Inc",
            "provider": "Argus Research",
            "reportDate": "2020-02-20T07:26:51Z",
            "reportTitle": "Enbridge Inc. is North America's largest energy infrastructure company. Enbridge has six operating segments: Liquids Pipelines, Gas Transmission & Midstream, Gas Distribution, Renewable Power Generation & Transmission, Energy Services, and Eliminations & Other. According to the company's most recent 10-K, Enbridge delivers over three million barrels of crude oil per day, and transports 62% of all U.S.-bound Canadian crude exports. The company also transports 18% of the natural gas used in the U.S. Its regulated utilities serve approximately 3.7 million retail customers.",
            "targetPrice": 46.0,
            "investmentRating": "Bullish",
            "tickers": [
                "ENB"
            ]
        },
        {
            "id": "26236_Market Summary_1582182711000",
            "headHtml": "Market Digest: BABA, AWK, ADI, ECL, LIN, ENB, FOXA, NLOK, TSN, ATO",
            "provider": "Argus Research",
            "reportDate": "2020-02-20T07:11:51Z",
            "reportTitle": "The Situation is Evolving: Scenarios for an Outbreak",
            "tickers": [
                "LIN",
                "BABA",
                "FOXA",
                "AWK",
                "ADI",
                "ENB",
                "ATO",
                "NLOK",
                "TSN",
                "ECL"
            ]
        }
    ],
    "sigDevs": [
        {
            "headline": "Enbridge Completes Sale Of Its Interests In Alliance Pipeline And Aux Sable",
            "date": "2024-04-01"
        }
    ],
    "secReports": [
        {
            "id": "0001104659-24-044281_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1712275200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000110465924044281/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-24-075276_895728",
            "type": "Annual Report to Shareholders",
            "title": "ARS : Annual Report to Shareholders",
            "description": "Annual report to security holders",
            "filingDate": 1711065600000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312524075276/thumbnail.png",
            "formType": "ARS"
        },
        {
            "id": "0001193125-24-075245_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1711065600000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312524075245/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-24-066167_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1710288000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312524066167/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-24-066168_895728",
            "type": "Periodic Financial Reports",
            "title": "10-K/A : Periodic Financial Reports",
            "description": "Annual report pursuant to Section 13 and 15(d)",
            "filingDate": 1710288000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312524066168/thumbnail.png",
            "formType": "10-K/A"
        },
        {
            "id": "0001193125-24-063693_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1709856000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312524063693/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000895728-24-000006_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1707436800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000089572824000006/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000895728-24-000007_895728",
            "type": "Periodic Financial Reports",
            "title": "10-K : Periodic Financial Reports",
            "description": "Annual report pursuant to Section 13 and 15(d)",
            "filingDate": 1707436800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000089572824000007/thumbnail.png",
            "formType": "10-K"
        },
        {
            "id": "0001193125-23-286293_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1701302400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312523286293/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001104659-23-116323_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1699488000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000110465923116323/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000895728-23-000033_895728",
            "type": "Periodic Financial Reports",
            "title": "10-Q : Periodic Financial Reports",
            "description": "Quarterly report pursuant to Section 13 or 15(d)",
            "filingDate": 1698969600000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000089572823000033/thumbnail.png",
            "formType": "10-Q"
        },
        {
            "id": "0000895728-23-000032_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1698969600000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000089572823000032/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-23-259955_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K/A : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1697760000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312523259955/thumbnail.png",
            "formType": "8-K/A"
        },
        {
            "id": "0001104659-23-105610_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1696204800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000110465923105610/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-23-233519_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1694476800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312523233519/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001104659-23-099330_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1694131200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000110465923099330/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001104659-23-098325_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1693872000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000110465923098325/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-23-216011_895728",
            "type": "Offering Registrations",
            "title": "S-8 : Offering Registrations",
            "description": "Initial registration statement for securities to be offered to employees pursuant to employee benefit plans",
            "filingDate": 1692316800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312523216011/thumbnail.png",
            "formType": "S-8"
        },
        {
            "id": "0000895728-23-000026_895728",
            "type": "Periodic Financial Reports",
            "title": "10-Q : Periodic Financial Reports",
            "description": "Quarterly report pursuant to Section 13 or 15(d)",
            "filingDate": 1691107200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000089572823000026/thumbnail.png",
            "formType": "10-Q"
        },
        {
            "id": "0001193125-23-203941_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K/A : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1691107200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312523203941/thumbnail.png",
            "formType": "8-K/A"
        },
        {
            "id": "0000895728-23-000024_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1691107200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000089572823000024/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-23-197747_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1690502400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312523197747/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-23-137898_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1683504000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312523137898/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000895728-23-000015_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1683244800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000089572823000015/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000895728-23-000016_895728",
            "type": "Periodic Financial Reports",
            "title": "10-Q : Periodic Financial Reports",
            "description": "Quarterly report pursuant to Section 13 or 15(d)",
            "filingDate": 1683244800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000089572823000016/thumbnail.png",
            "formType": "10-Q"
        },
        {
            "id": "0001193125-23-135947_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1683158400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312523135947/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-23-074829_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K/A : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1679270400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312523074829/thumbnail.png",
            "formType": "8-K/A"
        },
        {
            "id": "0001193125-23-071334_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1678838400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312523071334/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001104659-23-030128_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1678233600000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000110465923030128/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-23-060793_895728",
            "type": "Periodic Financial Reports",
            "title": "10-K/A : Periodic Financial Reports",
            "description": "Annual report pursuant to Section 13 and 15(d)",
            "filingDate": 1678060800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312523060793/thumbnail.png",
            "formType": "10-K/A"
        },
        {
            "id": "0001193125-23-060790_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1678060800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312523060790/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-23-058246_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1677715200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312523058246/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000895728-23-000007_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1675987200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000089572823000007/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000895728-23-000008_895728",
            "type": "Periodic Financial Reports",
            "title": "10-K : Periodic Financial Reports",
            "description": "Annual report pursuant to Section 13 and 15(d)",
            "filingDate": 1675987200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000089572823000008/thumbnail.png",
            "formType": "10-K"
        },
        {
            "id": "0001193125-22-305978_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K/A : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1671062400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312522305978/thumbnail.png",
            "formType": "8-K/A"
        },
        {
            "id": "0001193125-22-295420_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1669766400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312522295420/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000895728-22-000032_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1667520000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000089572822000032/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000895728-22-000033_895728",
            "type": "Periodic Financial Reports",
            "title": "10-Q : Periodic Financial Reports",
            "description": "Quarterly report pursuant to Section 13 or 15(d)",
            "filingDate": 1667520000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000089572822000033/thumbnail.png",
            "formType": "10-Q"
        },
        {
            "id": "0001193125-22-257129_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1664841600000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312522257129/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001104659-22-101576_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1663632000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000110465922101576/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000895728-22-000024_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1659052800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000089572822000024/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000895728-22-000026_895728",
            "type": "Periodic Financial Reports",
            "title": "10-Q : Periodic Financial Reports",
            "description": "Quarterly report pursuant to Section 13 or 15(d)",
            "filingDate": 1659052800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000089572822000026/thumbnail.png",
            "formType": "10-Q"
        },
        {
            "id": "0001193125-22-171959_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1654819200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312522171959/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000895728-22-000019_895728",
            "type": "Periodic Financial Reports",
            "title": "10-Q : Periodic Financial Reports",
            "description": "Quarterly report pursuant to Section 13 or 15(d)",
            "filingDate": 1651795200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000089572822000019/thumbnail.png",
            "formType": "10-Q"
        },
        {
            "id": "0000895728-22-000017_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1651795200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000089572822000017/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-22-142488_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1651708800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312522142488/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-22-078378_895728",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1647475200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000895728/000119312522078378/thumbnail.png",
            "formType": "8-K"
        }
    ]
}