{
    "MSFT": [
        {
            "symbol": "MSFT",
            "time": 1706572800000000000,
            "displayTime": "Tuesday, January 30 2024",
            "title": "Microsoft Q2 cloud revenue USD 33,700 million",
            "text": "Jan 30 (Reuters) - Microsoft Q2 EPS USD 2.93.:"
        },
        {
            "symbol": "MSFT",
            "time": 1706572800000000000,
            "displayTime": "Tuesday, January 30 2024",
            "title": "Microsoft Q2 cloud revenue USD 33,700 million",
            "text": "Jan 30 (Reuters) - Microsoft Q2 EPS USD 2.93.:."
        },
        {
            "symbol": "MSFT",
            "time": 1709856000000000000,
            "displayTime": "Friday, March 8 2024",
            "title": "Sam Altman To Return To Openai Board Of Directors - The Information",
            "text": "March 8 (Reuters) - :SAM ALTMAN TO RETURN TO OPENAI BOARD OF DIRECTORS- THE INFORMATION.ON FRIDAY, OPENAI WAS GETTING READY TO ANNOUNCE APPOINTMENT OF THREE NEW DIRECTORS - THE INFORMATION.SUE DESMOND-HELLMANN, NICOLE SELIGMAN, AND FIDJI SIMO TO JOIN OPENAI'S BOARD- THE INFORMATION.THE NEW OPENAI BOARD APPOINTMENTS WOULD INCREASE THE NUMBER OF DIRECTORS AT THE NONPROFIT TO SEVEN - THE INFORMATION.ILYA SUTSKEVER IS STILL IN TALKS ABOUT REMAINING AT THE COMPANY- THE INFORMATION.OPENAI HAS CONCLUDED INVESTIGATION SURROUNDING SAM ALTMAN'S FIRING - THE INFORMATION.Further company coverage: MSFT.O. ((Reuters.Briefs@thomsonreuters.com;))."
        },
        {
            "symbol": "MSFT",
            "time": 1704672000000000000,
            "displayTime": "Monday, January 8 2024",
            "title": "Openai Says We Regard The New York Times' Lawsuit To Be Without Merit",
            "text": "Jan 8 (Reuters) - :OPENAI SAYS STILL WE ARE HOPEFUL FOR A CONSTRUCTIVE PARTNERSHIP WITH THE NEW YORK TIMES .OPENAI SAYS WE REGARD THE NEW YORK TIMES’ LAWSUIT TO BE WITHOUT MERIT.OPENAI SAYS IT IS CONTINUALLY MAKING SYSTEMS MORE RESISTANT TO ADVERSARIAL ATTACKS TO REGURGITATE TRAINING DATA."
        },
        {
            "symbol": "MSFT",
            "time": 1704758400000000000,
            "displayTime": "Tuesday, January 9 2024",
            "title": "OMV And Microsoft Sign An Agreement For Purchase Of Sustainable Aviation Fuel Certificates",
            "text": "Jan 9 (Reuters) - OMV AG <OMVV.VI>::OMV AND MICROSOFT SIGN AN AGREEMENT FOR PURCHASE OF SUSTAINABLE AVIATION FUEL CERTIFICATES (SAFC).Further company coverage: OMVV.VI. (Gdansk Newsroom). ((gdansk.newsroom@thomsonreuters.com; +48 58 778 51 10;))."
        },
        {
            "symbol": "MSFT",
            "time": 1706572800000000000,
            "displayTime": "Tuesday, January 30 2024",
            "title": "Microsoft Sees Q3 Intelligent Cloud Revenue Of $26.0 To $26.3 Billion",
            "text": "Jan 31 (Reuters) - Microsoft Corp <MSFT.O>::MICROSOFT: SEES Q3 INTELLIGENT CLOUD REVENUE OF $26.0 TO $26.3 BILLION.MICROSOFT - SEES Q3 MORE PERSONAL COMPUTING REVENUE OF $14.7 TO $15.1 BILLION.MICROSOFT: SEES Q3 PRODUCTIVITY AND BUSINESS PROCESSES REVENUE OF $19.3 TO $19.6 BILLION.MICROSOFT - SEES Q3 COST OF REVENUE COGS OF $18.6 BILLION TO $18.8 BILLION.MICROSOFT - SEES FOREIGN CURRENCY IMPACT FOR FY24 AS INCREASE TO TOTAL REVENUE GROWTH OF LESS THAN 1 POINT.MICROSOFT: SEES Q3 FOREIGN CURRENCY IMPACT AS INCREASE TO REVENUE GROWTH AT TOTAL COMPANY AND ALL INDIVIDUAL SEGMENT LEVELS OF LESS THAN 1 POINT.MICROSOFT - FY24 OPERATING MARGINS EXPECTED TO INCREASE 1 TO 2 POINTS YOY.MICROSOFT: SEES Q3 OPERATING EXPENSES OF $15.8 TO $15.9 BILLION.Further company coverage: MSFT.O. ((Reuters.Briefs@thomsonreuters.com;))."
        },
        {
            "symbol": "MSFT",
            "time": 1708387200000000000,
            "displayTime": "Tuesday, February 20 2024",
            "title": "NYT Plans To Debut New Generative AI Ad Tool Later This Year - Axios",
            "text": "Feb 20 (Reuters) - :NYT PLANS TO DEBUT NEW GENERATIVE AI AD TOOL LATER THIS YEAR - AXIOS."
        }
    ]
}