{
    "4497221": {
        "id": 4497221,
        "significance": "1",
        "headline": "Microsoft Sees Q3 More Personal Computing Revenue Of $14.15 Bln To $14.45 Bln",
        "description": "Jan 25 (Reuters) - Microsoft Corp <MSFT.O>::MICROSOFT - SEES Q3 MORE PERSONAL COMPUTING REVENUE OF $14.15 BILLION TO $14.45 BILLION.MICROSOFT - SEES Q3 OPERATING EXPENSES OF $13.4 BILLION TO $13.5 BILLION.MICROSOFT - SEES Q3 PRODUCTIVITY AND BUSINESS PROCESSES REVENUE OF $15.6 BILLION TO $15.85 BILLION.MICROSOFT - INTEREST INCOME AND EXPENSE SHOULD OFFSET EACH OTHER IN Q3.MICROSOFT - SEES Q3 INTELLIGENT CLOUD REVENUE OF $18.75 BILLION TO $19.0 BILLION.MICROSOFT - DECREASE TO TOTAL REVENUE GROWTH OF APPROXIMATELY 2 POINTS EXPECTED IN Q3 FROM FOREIGN CURRENCY IMPACT.",
        "parentTopics": "Corporate Guidance"
    },
    "4535580": {
        "id": 4535580,
        "significance": "1",
        "headline": "Microsoft Sees Q4 Productivity And Business Processes Rev Of $16.65 To $16.9 Billion",
        "description": "April 26 (Reuters) - Microsoft Corp <MSFT.O>::MICROSOFT SEES Q4 MORE PERSONAL COMPUTING REVENUE OF $14.65 TO $14.95 BILLION.MICROSOFT - SEES Q4 PRODUCTIVITY AND BUSINESS PROCESSES REVENUE OF $16.65 BILLION TO $16.9 BILLION - PRESENTATION.MICROSOFT SEES Q4 COGS OF $16.6 TO $16.8 BILLION.MICROSOFT - SEES Q4 INTELLIGENT CLOUD REVENUE OF $21.1 BILLION TO $21.35 BILLION.MICROSOFT SEES Q4 OPERATING EXPENSES OF $14.8 TO S14.9 BILLION.MICROSOFT - SEES DECREASE TO COGS AND OPEX GROWTH OF APPROXIMATELY 1 POINT IN Q4 FROM FOREX IMPACT.MICROSOFT - SEES DECREASE TO TOTAL REVENUE GROWTH OF APPROXIMATELY 2 POINTS IN Q4 FROM FOREIGN CURRENCY IMPACT.",
        "parentTopics": "Corporate Guidance"
    },
    "4545142": {
        "id": 4545142,
        "significance": "1",
        "headline": "STMicroelectronics Collaborates With Microsoft On IoT Devices",
        "description": "May 11 (Reuters) - Microsoft Corp <MSFT.O>::STMICROELECTRONICS COLLABORATES WITH MICROSOFT TO STREAMLINE DEVELOPMENT OF HIGHLY SECURE IOT (INTERNET-OF-THINGS) DEVICES.JOINT EFFORTS DELIVER MICROSOFT AZURE IOT CLOUD REFERENCE IMPLEMENTATION INTEGRATING ARM TRUSTED FIRMWARE AND BASED ON STM32U5 IOT DISCOVERY KIT.ST WILL RELEASE AN STM32CUBE-BASED INTEGRATION OF REFERENCE IMPLEMENTATION IN Q3 2022 THAT WILL FURTHER SIMPLIFY IOT-DEVICE DESIGN LEVERAGING TIGHT INTEGRATION WITH WIDER STM32 ECOSYSTEM.",
        "parentTopics": "Products"
    },
    "4555108": {
        "id": 4555108,
        "significance": "1",
        "headline": "Microsoft - Updated Guidance For Quarter Ending June 30, 2022",
        "description": "June 2 (Reuters) - Microsoft Corp <MSFT.O>::MICROSOFT - UPDATED OUR GUIDANCE FOR QUARTER ENDING JUNE 30, 2022 DUE TO UNFAVORABLE FOREIGN EXCHANGE RATE MOVEMENT IN QUARTER THROUGH MAY.MICROSOFT - SEES Q4 REVENUE BETWEEN $51.94 BILLION - $52.74 BILLION.MICROSOFT- SEES Q4 DILUTED EPS $2.24 - $2.32.Q4 EARNINGS PER SHARE VIEW $2.33, REVENUE VIEW $52.87 BILLION -- REFINITIV IBES DATA.MICROSOFT - SEES Q4 GROSS MARGIN $35.45 BILLION TO $36.05 BILLION.MICROSOFT - SEES Q4 OPERATING INCOME $20.60 BILLION - $21.30 BILLION.MICROSOFT - UPDATED OUR GUIDANCE FOR QUARTER ENDING JUNE 30, 2022 DUE TO UNFAVORABLE FOREIGN EXCHANGE RATE MOVEMENT IN QUARTER THROUGH MAY.",
        "parentTopics": "Corporate Guidance"
    },
    "4571863": {
        "id": 4571863,
        "significance": "1",
        "headline": "Microsoft Sees Total Fy23 Revenue Expected To Grow Double-Digits",
        "description": "July 26 (Reuters) - Microsoft Corp <MSFT.O>::MICROSOFT - SEES TOTAL FY23 REVENUE EXPECTED TO GROW DOUBLE-DIGITS.MICROSOFT - SEES FY23 Q1 PRODUCTIVITY AND BUSINESS PROCESSES REVENUE OF $15.95 BILLION TO $16.25 BILLION.MICROSOFT - SEES FY23 Q1 INTELLIGENT CLOUD REVENUE OF $20.3 BILLION TO $20.6 BILLION.MICROSOFT - SEES FY23 Q1 MORE PERSONAL COMPUTING REVENUE $13.0 BILLION $13.4 BILLION.MICROSOFT - SEES FY23 Q1 OPERATING EXPENSES OF $13.3 BILLION TO $13.4 BILLION.MICROSOFT - SEES FY23 Q1 COST OF REVENUE $14.9 BILLION TO $15.1 BILLION.Further company coverage: MSFT.O. ((Reuters.Briefs@thomsonreuters.com;)).",
        "parentTopics": "Corporate Guidance"
    },
    "4596250": {
        "id": 4596250,
        "significance": "1",
        "headline": "Novo Nordisk, Microsoft Collaborate",
        "description": "Sept 12 (Reuters) - Microsoft Corp <MSFT.O>::NOVO NORDISK AND MICROSOFT COLLABORATE TO ACCELERATE DRUG DISCOVERY AND DEVELOPMENT USING BIG DATA AND ARTIFICIAL INTELLIGENCE.NOVO NORDISK AND MICROSOFT HAVE ENTERED A NEW STRATEGIC COLLABORATION.TO COMBINE MICROSOFT'S COMPUTATIONAL SERVICES, CLOUD AND ARTIFICIAL INTELLIGENCE (AI) WITH NOVO NORDISK'S DRUG DISCOVERY, DEVELOPMENT AND DATA SCIENCE CAPABILITIES.",
        "parentTopics": "Products"
    },
    "4649138": {
        "id": 4649138,
        "significance": "1",
        "headline": "Microsoft Sees Decrease To Q3 Total Revenue Growth Of About 3 Points Due To Foreign Currency Impact",
        "description": "Jan 24 (Reuters) - Microsoft Corp <MSFT.O>::MICROSOFT SEES DECREASE TO Q3 TOTAL REVENUE GROWTH OF ABOUT 3 POINTS DUE TO FOREIGN CURRENCY IMPACT.MICROSOFT SEES DECREASE TO Q3 COGS GROWTH OF ABOUT 1 POINT AND OPEX GROWTH OF ABOUT 2 POINTS DUE TO FOREIGN CURRENCY IMPACT.Further company coverage: MSFT.O. ((Reuters.Briefs@thomsonreuters.com;)).",
        "parentTopics": "Corporate Guidance"
    },
    "4649129": {
        "id": 4649129,
        "significance": "1",
        "headline": "Microsoft Qtrly Devices Revenue Down 39%",
        "description": "Jan 24 (Reuters) - Microsoft Corp <MSFT.O>::MICROSOFT - QTRLY  REVENUE IN INTELLIGENT CLOUD WAS $21.5 BILLION AND INCREASED 18%.MICROSOFT - QTRLY ADJUSTED EARNINGS PER SHARE $2.32.MICROSOFT - QTRLY REVENUE IN MORE PERSONAL COMPUTING WAS $14.2 BILLION AND DECREASED 19%.MICROSOFT - QTRLY REVENUE IN PRODUCTIVITY AND BUSINESS PROCESSES WAS $17.0 BILLION AND INCREASED 7%.Q2 EARNINGS PER SHARE VIEW $2.29, REVENUE VIEW $52.94 BILLION -- REFINITIV IBES DATA.MICROSOFT - QTRLY DEVICES REVENUE DOWN 39% DRIVEN BY CONTINUED PC MARKET WEAKNESS AND EXECUTION CHALLENGES ON NEW PRODUCT LAUNCHES.MICROSOFT - IN SECOND QUARTER, RECORDED COSTS RELATED TO DECISIONS ANNOUNCED ON JAN 18TH, INCLUDING EMPLOYEE SEVERANCE EXPENSES OF $800 MILLION.MICROSOFT - QTRLY XBOX HARDWARE REVENUE DECLINED 13%.MICROSOFT - QTRLY AZURE AND OTHER CLOUD SERVICES REVENUE GROWTH OF 31% DRIVEN BY STRONG DEMAND FOR CONSUMPTION-BASED SERVICES.Further company coverage: <MSFT.O>. ((Reuters.Briefs@thomsonreuters.com;)).",
        "parentTopics": "Corporate Guidance"
    },
    "4649139": {
        "id": 4649139,
        "significance": "1",
        "headline": "Microsoft Sees Q3 Productivity And Business Processes Revenue $16.9 Billion To $17.2 Billion - Presentation",
        "description": "Jan 24 (Reuters) - Microsoft Corp <MSFT.O>::MICROSOFT SEES Q3 COST OF REVENUE COGS OF $15.65 BILLION TO $15.85 BILLION .MICROSOFT SEES Q3 PRODUCTIVITY AND BUSINESS PROCESSES REVENUE $16.9 BILLION TO $17.2 BILLION.MICROSOFT SEES Q3 MORE PERSONAL COMPUTING REVENUE $11.9 BILLION TO $12.3 BILLION.MICROSOFT SEES Q3 INTELLIGENT CLOUD REVENUE $21.7 BILLION TO $22 BILLION.MICROSOFT SEES Q3 OPERATING EXPENSES OF $14.7 BILLION TO $14.8 BILLION.MICROSOFT - FY OPERATING MARGINS EXPECTED TO DECREASE ROUGHLY 2 POINTS YOY EXCLUDING Q2 CHARGE & FAVOURABLE IMPACT FROM CHANGE IN ACCOUNTING ESTIMATE.Further company coverage: MSFT.O. ((Reuters.Briefs@thomsonreuters.com;)).",
        "parentTopics": "Corporate Guidance"
    },
    "4695510": {
        "id": 4695510,
        "significance": "1",
        "headline": "Microsoft Reports Quarterly Revenue In More Personal Computing Was $13.3 Billion And Decreased 9%",
        "description": "April 25 (Reuters) - Microsoft Corp <MSFT.O>::MICROSOFT - QTRLY REVENUE IN PRODUCTIVITY AND BUSINESS PROCESSES WAS $17.5 BILLION AND INCREASED 11%.MICROSOFT - QTRLY REVENUE IN INTELLIGENT CLOUD WAS $22.1 BILLION AND INCREASED 16%.MICROSOFT - QTRLY REVENUE IN MORE PERSONAL COMPUTING WAS $13.3 BILLION AND DECREASED 9%.Further company coverage: MSFT.O. ((Reuters.Briefs@thomsonreuters.com;)).",
        "parentTopics": "Corporate Guidance"
    },
    "4695644": {
        "id": 4695644,
        "significance": "1",
        "headline": "Microsoft Says Sees Q4 Intelligent Cloud Revenue Of $23.6 Billion To $23.9 Billion",
        "description": "April 25 (Reuters) - Microsoft Corp <MSFT.O>::MICROSOFT - SEES Q4 PRODUCTIVITY AND BUSINESS PROCESSES REVENUE OF $17.9 BILLION TO $18.2 BILLION.MICROSOFT - SEES Q4 COST OF REVENUE COGS OF $16.8 TO $17.0 BILLION.MICROSOFT - SEES Q4 INTELLIGENT CLOUD REVENUE OF $23.6 BILLION TO $23.9 BILLION.MICROSOFT - SEES Q4 OPERATING EXPENSES OF $15.1 TO $15.2 BILLION.MICROSOFT - SEES Q4 MORE PERSONAL COMPUTING REVENUE OF $13.35 BILLION  TO $13.75 BILLION.MICROSOFT - SEES DECREASE TO TOTAL REVENUE GROWTH OF ABOUT 2 POINTS IN Q4 DUE TO FOREIGN CURRENCY IMPACT.MICROSOFT - SEES Q4 AZURE AND OTHER CLOUD SERVICES REVENUE GROWTN OF 26% TO 27% IN CONSTANT CURRENCY IN INTELLIGENT CLOUD SEGMENT.",
        "parentTopics": "Corporate Guidance"
    },
    "4696423": {
        "id": 4696423,
        "significance": "1",
        "headline": "Activision Blizzard Announces First Quarter 2023 Financial Results",
        "description": "April 26 (Reuters) - Activision Blizzard Inc <ATVI.O>::ACTIVISION BLIZZARD ANNOUNCES FIRST QUARTER 2023 FINANCIAL RESULTS.Q1 GAAP OPERATING INCOME GREW APPROXIMATELY 70% YEAR-OVER-YEAR.Q1 EARNINGS PER SHARE VIEW $0.52, REVENUE VIEW $1.79 BILLION -- REFINITIV IBES DATA.REMAIN CONFIDENT THAT OUR DEAL WITH MICROSOFT BENEFITS COMPETITION, CONSUMERS, AND JOB CREATION IN MARKETS AROUND WORLD.ACTIVISION SEGMENT REVENUE GREW 28% YEAR-OVER-YEAR IN THE FIRST QUARTER.\"CONSIDERS THAT CMA'S DECISION IS DISPROPORTIONATE, IRRATIONAL AND INCONSISTENT WITH EVIDENCE\".BLIZZARD SEGMENT REVENUE INCREASED 62% YEAR-OVER-YEAR IN THE FIRST QUARTER.PARTIES CONTINUE TO FULLY ENGAGE WITH OTHER REGULATORS REVIEWING MICROSOFT DEAL TO OBTAIN ANY REQUIRED REGULATORY APPROVALS.FOR QUARTER ENDED MARCH 31, 2023, ACTIVISION BLIZZARD'S NET BOOKINGS WERE $1.86 BILLION, AS COMPARED WITH $1.48 BILLION FOR Q1 OF 2022.WILL WORK  WITH MICROSOFT TO REVERSE CMA'S REPORT ON APPEAL.FOR THE QUARTER ENDED MARCH 31, 2023, OVERALL ACTIVISION BLIZZARD MONTHLY ACTIVE USERS WERE 368 MILLION.CONTINUE TO EXPECT AT LEAST HIGH-TEENS YEAR-OVER-YEAR GROWTH FOR GAAP REVENUE IN 2023.SEES AT LEAST HIGH-SINGLE DIGIT YEAR-OVER-YEAR GROWTH IN NET BOOKINGS AND TOTAL SEGMENT OPERATING INCOME FOR YEAR.WE EXPECT ACTIVISION BLIZZARD Q2 GAAP REVENUE TO GROW AT LEAST 10%.ACTIVISION BLIZZARD ENDED QUARTER WITH A NET CASH POSITION OF APPROXIMATELY $8.9 BILLION.CASH AND SHORT-TERM INVESTMENTS AT END OF Q1 STOOD AT $12.6 BILLION.",
        "parentTopics": "Corporate Guidance"
    },
    "4699419": {
        "id": 4699419,
        "significance": "1",
        "headline": "Meta Is Talking To Microsoft\\/OpenAI About Doing An Internal AI Coding Assistant For Its Engineers - Verge Reporter Tweet",
        "description": "April 28 (Reuters) - :META IS TALKING TO MICROSOFT\\/OPENAI ABOUT DOING AN INTERNAL AI CODING ASSISTANT FOR ITS ENGINEERS - VERGE REPORTER TWEET.",
        "parentTopics": "Corporate Guidance"
    },
    "4738151": {
        "id": 4738151,
        "significance": "1",
        "headline": "Microsoft Sees Q1 Intelligent Cloud Revenue Of $23.3 To $23.6 Bln",
        "description": "July 25 (Reuters) - Microsoft Corp <MSFT.O>::MICROSOFT - SEES Q1 INTELLIGENT CLOUD REVENUE OF $23.3 TO $23.6 BILLION.MICROSOFT SEES FY24 COST OF REVENUE GROWTH RATES EXPECTED TO BE HIGHER THAN IN FY23.MICROSOFT - SEES Q1 PRODUCTIVITY AND BUSINESS PROCESSES REVENUE OF $18.0 TO $18.3 BILLION.MICROSOFT SEES FY24 CAPITAL EXPENDITURES EXPECTED TO INCREASE SEQUENTIALLY EACH QUARTER THROUGH THE YEAR.MICROSOFT - SEES Q1 MORE PERSONAL COMPUTING REVENUE OF $12.5 TO $12.9 BILLION.MICROSOFT SEES FY24 FOREIGN CURRENCY IMPACT INCREASE TO TOTAL REVENUE GROWTH OF APPROXIMATELY 1 POINT.MICROSOFT - SEES Q1 COST OF REVENUE COGS OF $16.6 TO $16.8 BILLION.MICROSOFT SEES FY24 OPERATING EXPENSES GROWTH RATES EXPECTED TO REMAIN LOW.MICROSOFT - SEES Q1 OPERATING EXPENSES EXPENSES OF $13.5 TO $13.6 BILLION.MICROSOFT SEES FY24 OPERATING MARGINS EXPECTED TO REMAIN FLAT YEAR-OVER-YEAR.MICROSOFT - SEES Q1 FOREIGN CURRENCY IMPACT TO INCREASE TO TOTAL REVENUE GROWTH OF ABOUT 1 POINT, WITH 1 POINT IN INTELLIGENT CLOUD.Further company coverage: MSFT.O. ((Reuters.Briefs@thomsonreuters.com;)).",
        "parentTopics": "Corporate Guidance"
    },
    "4777021": {
        "id": 4777021,
        "significance": "1",
        "headline": "Microsoft Sees Q2 Intelligent Cloud Revenue Of $25.1 Bln To $25.4 Bln",
        "description": "Oct 24 (Reuters) - Microsoft Corp <MSFT.O>::MICROSOFT - SEES Q2 PRODUCTIVITY AND BUSINESS PROCESSES  REVENUE OF $18.8 BILLION TO $19.1 BILLION.MICROSOFT - SEES Q2 INTELLIGENT CLOUD REVENUE OF $25.1 BILLION TO $25.4 BILLION.MICROSOFT SEES FY24 OPERATING MARGINS TO REMAIN FLAT YEAR-OVER-YEAR INCLUSIVE OF NET IMPACT FROM ACTIVISION DEAL.MICROSOFT - SEES Q2 MORE PERSONAL COMPUTING REVENUE OF $16.5 BILLION TO $16.9 BILLION.MICROSOFT - SEES Q2 COST OF REVENUE COGS OF $19.4 BILLION TO $19.6 BILLION.MICROSOFT SEES Q2 EXPENSES OF $15.5-$15.6 BILLION INCLUDING $0.4 BILLION OF PURCHASE ACCOUNTING ADJUSTMENTS, INTEGRATION RELATED COSTS FROM ACTIVISION DEAL.Further company coverage: MSFT.O. ((Reuters.Briefs@thomsonreuters.com;;)).",
        "parentTopics": "Corporate Guidance"
    },
    "4805847": {
        "id": 4805847,
        "significance": "1",
        "headline": "OpenaAI'S Annualized Revenue Tops $1.6 Billion- The Information",
        "description": "Dec 30 (Reuters) - :OPENAI’S ANNUALIZED REVENUE TOPS $1.6 BILLION- THE INFORMATION.",
        "parentTopics": "Corporate Guidance"
    },
    "4807694": {
        "id": 4807694,
        "significance": "1",
        "headline": "Openai Says We Regard The New York Times' Lawsuit To Be Without Merit",
        "description": "Jan 8 (Reuters) - :OPENAI SAYS STILL WE ARE HOPEFUL FOR A CONSTRUCTIVE PARTNERSHIP WITH THE NEW YORK TIMES .OPENAI SAYS WE REGARD THE NEW YORK TIMES’ LAWSUIT TO BE WITHOUT MERIT.OPENAI SAYS IT IS CONTINUALLY MAKING SYSTEMS MORE RESISTANT TO ADVERSARIAL ATTACKS TO REGURGITATE TRAINING DATA.",
        "parentTopics": "Corporate Guidance"
    },
    "4807892": {
        "id": 4807892,
        "significance": "1",
        "headline": "OMV And Microsoft Sign An Agreement For Purchase Of Sustainable Aviation Fuel Certificates",
        "description": "Jan 9 (Reuters) - OMV AG <OMVV.VI>::OMV AND MICROSOFT SIGN AN AGREEMENT FOR PURCHASE OF SUSTAINABLE AVIATION FUEL CERTIFICATES (SAFC).Further company coverage: OMVV.VI. (Gdansk Newsroom). ((gdansk.newsroom@thomsonreuters.com; +48 58 778 51 10;)).",
        "parentTopics": "Corporate Guidance"
    },
    "4815551": {
        "id": 4815551,
        "significance": "1",
        "headline": "Microsoft Sees Q3 Intelligent Cloud Revenue Of $26.0 To $26.3 Billion",
        "description": "Jan 31 (Reuters) - Microsoft Corp <MSFT.O>::MICROSOFT: SEES Q3 INTELLIGENT CLOUD REVENUE OF $26.0 TO $26.3 BILLION.MICROSOFT - SEES Q3 MORE PERSONAL COMPUTING REVENUE OF $14.7 TO $15.1 BILLION.MICROSOFT: SEES Q3 PRODUCTIVITY AND BUSINESS PROCESSES REVENUE OF $19.3 TO $19.6 BILLION.MICROSOFT - SEES Q3 COST OF REVENUE COGS OF $18.6 BILLION TO $18.8 BILLION.MICROSOFT - SEES FOREIGN CURRENCY IMPACT FOR FY24 AS INCREASE TO TOTAL REVENUE GROWTH OF LESS THAN 1 POINT.MICROSOFT: SEES Q3 FOREIGN CURRENCY IMPACT AS INCREASE TO REVENUE GROWTH AT TOTAL COMPANY AND ALL INDIVIDUAL SEGMENT LEVELS OF LESS THAN 1 POINT.MICROSOFT - FY24 OPERATING MARGINS EXPECTED TO INCREASE 1 TO 2 POINTS YOY.MICROSOFT: SEES Q3 OPERATING EXPENSES OF $15.8 TO $15.9 BILLION.Further company coverage: MSFT.O. ((Reuters.Briefs@thomsonreuters.com;)).",
        "parentTopics": "Corporate Guidance"
    },
    "4825301": {
        "id": 4825301,
        "significance": "1",
        "headline": "NYT Plans To Debut New Generative AI Ad Tool Later This Year - Axios",
        "description": "Feb 20 (Reuters) - :NYT PLANS TO DEBUT NEW GENERATIVE AI AD TOOL LATER THIS YEAR - AXIOS.",
        "parentTopics": "Corporate Guidance"
    }
}