{
    "symbol": "PFE",
    "instrumentInfo": {
        "technicalEvents": {
            "provider": "Trading Central",
            "sector": "Healthcare",
            "shortTermOutlook": {
                "stateDescription": "Recent bearish events outweigh bullish events.",
                "direction": "Bearish",
                "score": 2,
                "scoreDescription": "Bearish Evidence",
                "sectorDirection": "Bearish",
                "sectorScore": 2,
                "sectorScoreDescription": "Bearish Evidence",
                "indexDirection": "Bearish",
                "indexScore": 3,
                "indexScoreDescription": "Strong Bearish Evidence"
            },
            "intermediateTermOutlook": {
                "stateDescription": "All events are bullish.",
                "direction": "Bullish",
                "score": 3,
                "scoreDescription": "Strong Bullish Evidence",
                "sectorDirection": "Neutral",
                "sectorScore": 0,
                "sectorScoreDescription": "Neutral Evidence",
                "indexDirection": "Bearish",
                "indexScore": 1,
                "indexScoreDescription": "Weak Bearish Evidence"
            },
            "longTermOutlook": {
                "stateDescription": "All events are bearish.",
                "direction": "Bearish",
                "score": 2,
                "scoreDescription": "Bearish Evidence",
                "sectorDirection": "Bullish",
                "sectorScore": 2,
                "sectorScoreDescription": "Bullish Evidence",
                "indexDirection": "Bullish",
                "indexScore": 1,
                "indexScoreDescription": "Weak Bullish Evidence"
            }
        },
        "keyTechnicals": {
            "provider": "Trading Central",
            "support": 27.315,
            "resistance": 27.6,
            "stopLoss": 25.943193
        },
        "valuation": {
            "color": 1.0,
            "description": "Undervalued",
            "discount": "64%",
            "relativeValue": "Discount",
            "provider": "Trading Central"
        }
    },
    "companySnapshot": {
        "sectorInfo": "Healthcare",
        "company": {
            "innovativeness": 0.8841,
            "hiring": 0.9109999999999999,
            "sustainability": 0.6695,
            "insiderSentiments": 0.716,
            "earningsReports": 0.9793999999999999,
            "dividends": 0.9571
        },
        "sector": {
            "innovativeness": 0.5,
            "hiring": 0.5,
            "sustainability": 0.5,
            "insiderSentiments": 0.5,
            "earningsReports": 0.5,
            "dividends": 0.5
        }
    },
    "recommendation": {
        "provider": "Argus Research",
        "rating": "HOLD"
    },
    "upsell": {
        "msBullishSummary": [
            "Pfizer's pipeline productivity is improving with several successful recent drug launches. In particular, cardiovascular drug Vyndaqel is a potential game-changer in the rare-disease arena.",
            "Pfizer's strong success in developing a COVID-19 vaccine and treatment is yielding a massive cash windfall.",
            "Pfizer's decision to divest its off-patent division should result in a faster-growing, innovative company."
        ],
        "msBearishSummary": [
            "Aggressive cost-cutting in research and development could hurt Pfizer's long-term prospects, given the importance of continued investment in innovation.",
            "Competition is increasing for Prevnar (especially from Merck's new pneumococcal vaccine) and Ibrance (from Novartis' Kisqali).",
            "The likely decline of COVID-19 products will create a drag on growth as the pandemic recedes. "
        ],
        "companyName": "Pfizer, Inc.",
        "msBullishBearishSummariesPublishDate": 1709267489000,
        "upsellReportType": "MORNINGSTAR_ANALYST"
    },
    "upsellSearchDD": {
        "researchReports": {
            "reportId": "ARGUS_3305_AnalystReport_1711105128000",
            "provider": "Argus",
            "title": "Downgrading to BUY from HOLD",
            "reportDate": "2024-03-22T10:58:48Z",
            "summary": "Pfizer is a leading developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "investmentRating": "Neutral"
        }
    },
    "events": [
        {
            "eventType": "Price Crosses Moving Average",
            "pricePeriod": "D",
            "tradingHorizon": "I",
            "tradeType": "L",
            "imageUrl": "https://s.yimg.com/uc/fin/img/assets/generic.svg",
            "startDate": 1711459800,
            "endDate": 1711459800
        }
    ],
    "reports": [
        {
            "id": "3305_Analyst Report_1711105128000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2024-03-22T10:58:48Z",
            "reportTitle": "Pfizer is a leading developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "investmentRating": "Neutral",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "39482_Market Summary_1711104228000",
            "headHtml": "Market Digest: ACN, PFE, SRE, PANW",
            "provider": "Argus Research",
            "reportDate": "2024-03-22T10:43:48Z",
            "reportTitle": "Stocks rallied on Thursday, extending yesterday's gains on rate-cut optimism. Turning to stocks, shares of Apple (AAPL) are down after the U.S. Department of Justice filed a lawsuit accusing the company of engineering a monopoly in the smartphone market. Bank stocks are up today as investors are optimistic that the anticipated rate cuts this year will drive more transactions. The S&P 500 is up 0.3%, the Dow is up 0.7%, the Nasdaq is up 0.2%, and the Russell 2000 is up 1.16%.",
            "tickers": [
                "SRE",
                "ACN",
                "PFE",
                "PANW"
            ]
        },
        {
            "id": "39326_Technical Analysis_1709812383000",
            "headHtml": "Technical Assessment: Neutral in the Intermediate-Term",
            "provider": "Argus Research",
            "reportDate": "2024-03-07T11:53:03Z",
            "reportTitle": "As if the stock market needed more help, now we have declining Treasury yields across the entire yield curve. Treasury yields fell consistently from October 19, 2023, until their most-recent bottom on December 27. That move certainly helped stocks rally off their October 27 low. Yields popped from 12/27/23 until 2/22/24 and stocks ignored the increase. Since their closing peaks of 4.33% a few weeks ago, both the 5- and 10-year yields have dropped to 4.1% while the 2-year has declined to 4.56% from 4.7%.",
            "tickers": [
                "NTAP",
                "PFE"
            ]
        },
        {
            "id": "39247_Thematic Portfolio_1709130218000",
            "headHtml": "The Argus High-Yield Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2024-02-28T14:23:38Z",
            "reportTitle": "Value stocks -- a market segment that includes high-yield stocks -- outperformed growth stocks in 2022. That's a recent rarity, as for the past decade-plus, the performance record has favored growth. But the tide turned in 2022. The rollout of COVID-19 vaccines gave a lift to some of the cyclical companies (energy and regional banks) that had lagged in recent quarters, and value stocks outpaced growth stocks that year. While growth stocks have retaken the lead since 2023, the Federal Reserve continues to keep interest rates high to fend off inflation. This could possibly cap multiple expansion for growth companies in coming quarters. In any event, the value sector is the place to achieve income.",
            "tickers": [
                "C",
                "CVX",
                "LAZ",
                "VZ",
                "F",
                "K",
                "SPG",
                "SLF",
                "PFE",
                "TFC",
                "PRU",
                "GLW",
                "LYB",
                "IBM",
                "VLO",
                "DUK",
                "SO",
                "SNY",
                "OMC",
                "BCE",
                "CCI",
                "QSR",
                "LMT",
                "PSX",
                "EIX",
                "XOM",
                "ENB",
                "GILD",
                "PM",
                "KEY"
            ]
        },
        {
            "id": "39217_Stock Picks_1708951050000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2024-02-26T12:37:30Z",
            "reportTitle": "Value stocks -- a market segment that includes high-yield stocks -- outperformed growth stocks in 2022. That's a recent rarity, as for more than a decade, the performance record favored growth. Since 2010, the Russell 1000 Growth Index has climbed more than 575%, compared to an advance of almost 200% for the Russell 1000 Value Index. In 10 of the past 13 years, growth stocks have topped value stocks.  That hasn't always been the case. In the 2000-2010 decade, including the Great Recession, value stocks were better performers than growth stocks, advancing an admittedly low 8% (but still better than growth, which declined 15% during the decade). Value investors trace their roots to the famous \"Security Analysis\" textbook, written by Ben Graham, an economics professor at Columbia University.  Warren Buffett was one of his students. Why the recent deviation in performance? Several reasons, including changes in the make-up of the economy, growth in intangible assets, and the current level of interest rates. But the tide turned back in 2022, at least for a while, as the rollout of COVID-19 vaccines gave a lift to some of the cyclical companies (energy and regional banks) that had lagged in recent years. While growth stocks have recaptured the lead since 2023, the Federal Reserve continues to keep interest rates high to fend off inflation. This could possibly cap multiple expansion for growth companies in coming quarters. In any event, the value sector is the place to achieve income. The current yield on the iShares Russell 1000 Value Index ETF is 2.0%, compared to the 0.7% current yield on the iShares Russell 1000 Growth Index ETF. For our list this week, we have screened our coverage universe for stocks that are BUY-rated by Argus Research analysts, have an Argus Financial Strength Rating of at least Medium, and have a yield of 3.0% or higher. Here's a baker's dozen that meet the criteria. These stocks are also featured in our High-Yield theme model portfolio.",
            "tickers": [
                "C",
                "VZ",
                "BCE",
                "F",
                "CCI",
                "SPG",
                "PFE",
                "PRU",
                "PSX",
                "EIX",
                "IBM",
                "ENB",
                "GILD",
                "PM"
            ]
        },
        {
            "id": "38940_Stock Picks_1706530281000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2024-01-29T12:11:21Z",
            "reportTitle": "With many of the elite stocks technically overbought after huge moves in late 2023 and early 2024, we've done a search for stocks that might provide some 'alpha' if the red-hot AI stocks finally take a break. We examined how much the actual return of an investment might exceed its expected return based on its risk level.  We asked our Certified Market Technician Mark Arbeter to study charts for technical signals that favor individual stocks and predict their alpha. Mark reported that it is difficult to find strong technical setups at this time. Still, he looked for stocks that have been beaten down but show evidence that the worst is over. Technical characteristics for these stocks include an existing intermediate- to long-term downtrend, capitulatory volume during weakness followed by an upside reversal, bullish daily and weekly momentum divergences, and (most importantly) signs that the stock is at least attempting to trace out a bottoming pattern. Mark looks for these bottom formations in certain trading patterns. Here's a list of Argus Research BUY-rated stocks that fit Mark's technical model, signally possibly upside ahead.",
            "tickers": [
                "BCE",
                "ASH",
                "BHP",
                "MRNA",
                "PFE",
                "BIIB"
            ]
        },
        {
            "id": "38634_Stock Picks_1703593430000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2023-12-26T12:23:50Z",
            "reportTitle": "Many investors are getting a nice holiday present this December, as 2023 is closing out with a burst higher for stocks. The gains have been swift in the last month or so and are spread across sectors and market caps. Yet some companies have not joined in the party - and we think they may present opportunities. We used the Argus screening tool to generate a list of companies that have clean balance sheets and a proven track record for profits. We also like the management teams and strategies at these companies. For our list, we identified 11 BUY-rated large- or mega-cap companies across numerous industries that are selling at more than 25% below their 52-week highs. The list includes stocks in multiple sectors.",
            "tickers": [
                "PYPL",
                "TFC",
                "CFG",
                "ALB",
                "INCY",
                "MRNA",
                "KEY",
                "PFE",
                "APTV",
                "HSY",
                "NEE"
            ]
        },
        {
            "id": "38595_Top/Bottom Insider Activity_1703071871000",
            "headHtml": "Daily – Vickers Top Buyers & Sellers for 12/20/2023",
            "provider": "Argus Research",
            "reportDate": "2023-12-20T11:31:11Z",
            "reportTitle": "The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions.",
            "tickers": [
                "ASYS",
                "AVGO",
                "CAR",
                "MATV",
                "FLO",
                "XAIR",
                "RWAY",
                "PXD",
                "PFE",
                "IOT"
            ]
        },
        {
            "id": "3305_Analyst Report_1700834000000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2023-11-24T13:53:20Z",
            "reportTitle": "Pfizer is a leading developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 39.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "38361_Market Summary_1700833100000",
            "headHtml": "Market Digest: DE, PFE, PXD",
            "provider": "Argus Research",
            "reportDate": "2023-11-24T13:38:20Z",
            "reportTitle": "Recession Fears Fade away as Earnings, Economy Deliver",
            "tickers": [
                "DE",
                "PXD",
                "PFE"
            ]
        },
        {
            "id": "37853_Technical Analysis_1696330477000",
            "headHtml": "Technical Assessment: Neutral in the Intermediate-Term",
            "provider": "Argus Research",
            "reportDate": "2023-10-03T10:54:37Z",
            "reportTitle": "We're sorry to sound like a broken record, but Monday was yet another day with poor market breadth. The major indices masked the weakness under the hood, with the S&P 500 (SPX) finishing the first trading day of October flat, the Nasdaq gaining 0.7%, and the Nasdaq 100 popping 0.8%. The two SPX sectors that rose on the day were Technology (XLK +0.8%) and Communication Services (XLC +0.6%).",
            "tickers": [
                "META",
                "PFE"
            ]
        },
        {
            "id": "37526_Thematic Portfolio_1693410045000",
            "headHtml": "The Argus High-Yield Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2023-08-30T15:40:45Z",
            "reportTitle": "Value stocks -- a market segment that includes high-yield stocks -- outperformed growth stocks in 2022 for the first time since 2016. Indeed, for the past decade, the performance record has favored growth. But the tide turned in 2022. The rollout of COVID-19 vaccines gave a lift to some of the cyclical companies (energy companies and regional banks) that had lagged in recent quarters, and value stocks outpaced growth stocks over the past year. Meanwhile, the Federal Reserve continues to lift interest rates to fend off inflation, which could possibly cap multiple expansion for growth companies for a few more quarters. Regardless, the value sector is the place to achieve income. The current yield on the iShares Russell 1000 Value Index ETF is 2.2%, compared to the 0.9% current yield on the iShares Russell 1000 Growth Index ETF.  For our High-Yield Theme Model Portfolio, we are seeking stocks with yields of at least 3.0%.  This moves us deep into the value segment of the market.",
            "tickers": [
                "C",
                "LAZ",
                "CVX",
                "VZ",
                "F",
                "K",
                "SPG",
                "SLF",
                "PFE",
                "TFC",
                "PRU",
                "LYB",
                "IBM",
                "VLO",
                "UPS",
                "DUK",
                "SO",
                "SNY",
                "OMC",
                "BCE",
                "IP",
                "DOW",
                "QSR",
                "PSX",
                "EIX",
                "XOM",
                "ENB",
                "GILD",
                "PM",
                "KEY"
            ]
        },
        {
            "id": "37526_Thematic Portfolio_1693409145000",
            "headHtml": "The Argus High-Yield Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2023-08-30T15:25:45Z",
            "reportTitle": "Value stocks -- a market segment that includes high-yield stocks -- outperformed growth stocks in 2022 for the first time since 2016. Indeed, for the past decade, the performance record has favored growth. But the tide turned in 2022. The rollout of COVID-19 vaccines gave a lift to some of the cyclical companies (energy companies and regional banks) that had lagged in recent quarters, and value stocks outpaced growth stocks over the past year. Meanwhile, the Federal Reserve continues to lift interest rates to fend off inflation, which could possibly cap multiple expansion for growth companies for a few more quarters. Regardless, the value sector is the place to achieve income. The current yield on the iShares Russell 1000 Value Index ETF is 2.2%, compared to the 0.9% current yield on the iShares Russell 1000 Growth Index ETF.  For our High-Yield Theme Model Portfolio, we are seeking stocks with yields of at least 3.0%.  This moves us deep into the value segment of the market.",
            "tickers": [
                "C",
                "LAZ",
                "CVX",
                "VZ",
                "F",
                "K",
                "SPG",
                "SLF",
                "PFE",
                "TFC",
                "PRU",
                "LYB",
                "IBM",
                "VLO",
                "UPS",
                "DUK",
                "SO",
                "SNY",
                "OMC",
                "BCE",
                "IP",
                "DOW",
                "QSR",
                "PSX",
                "EIX",
                "XOM",
                "ENB",
                "GILD",
                "PM",
                "KEY"
            ]
        },
        {
            "id": "37491_Stock Picks_1693222889000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2023-08-28T11:41:29Z",
            "reportTitle": "August has been rough for stocks. The markets are down from their highs, although the year overall has been upbeat for stocks -- especially compared to a dismal 2022. The continued stress on the economy from higher interest rates, and questions about whether the Federal Reserve is done raising them, have weighed on valuations. Most economists are not convinced that the recession question has been answered. While there are strengths in the economy -- like the labor market and consumer spending -- inflation indicators inched up last month. The uncertain environment has impacted small-caps, mid-caps, large-caps, and even mega-caps. There is a wide range in data that shows how sectors are weathering this climate, with Communication Services up nearly 40% year-to-date but Consumer Staples down 2% for the same time period. In our opinion, some solid companies with strong financials have been oversold. For our list this week, we identified 10 BUY-rated large- or mega-cap companies across numerous industries that are selling at attractive valuations (more than 20% below their 52-week highs). They are listed according to company size, with the largest first.",
            "tickers": [
                "TSLA",
                "BAC",
                "VZ",
                "QCOM",
                "AMD",
                "SCHW",
                "BHP",
                "PFE",
                "DIS",
                "NEE"
            ]
        },
        {
            "id": "37405_Technical Analysis_1692356649000",
            "headHtml": "Technical Assessment: Neutral in the Intermediate-Term",
            "provider": "Argus Research",
            "reportDate": "2023-08-18T11:04:09Z",
            "reportTitle": "Market breadth has deteriorated quickly, which is surprising after the recent strong advance. Every recent rally attempt has been stepped on by sellers. Seasonals are playing out and historically don't get better until October. Not much is working, as stocks, bonds, commodities, and crypto are being dumped.",
            "tickers": [
                "CBOE",
                "PFE"
            ]
        },
        {
            "id": "3305_Analyst Report_1692012634000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2023-08-14T11:30:34Z",
            "reportTitle": "Pfizer is a leading developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 45.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "37349_Market Summary_1692011734000",
            "headHtml": "Market Digest: BXP, DIS, DVN, EA, VIAV, MET, OGE, PFE, PXD, PSX, APTV",
            "provider": "Argus Research",
            "reportDate": "2023-08-14T11:15:34Z",
            "reportTitle": "Monday Tee Up: Walmart's Turn",
            "tickers": [
                "VIAV",
                "PSX",
                "BXP",
                "EA",
                "OGE",
                "DVN",
                "MET",
                "PXD",
                "PFE",
                "APTV",
                "DIS"
            ]
        },
        {
            "id": "37217_Thematic Portfolio_1690824817000",
            "headHtml": "The Argus Min Vol Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2023-07-31T17:33:37Z",
            "reportTitle": "Rapidly rising inflation in 2022 knocked stocks into a bear market. While growth strategies suffered the most, value strategies also declined. Even bond prices were lower last year. Stocks have recovered thus far in 2023, but gains have been largely driven by only a handful of high-tech companies.  Inflation remains high and the Fed continues to raise rates.  Is a recession in the offing?  With all the uncertainty, is it time for investors to cash in their chips? We note that investors exit the stock market at their own peril, as long-term returns from equities consistently have outpaced long-term returns from other asset classes, such as fixed income and cash. Argus believes that Min Vol is an all-weather strategy that is timely in any investing climate. Academic literature and, more to the point, returns history, indicate that Min Vol can deliver market-matching returns on an absolute basis and superior returns on a risk-adjusted basis over various time periods.",
            "tickers": [
                "CSCO",
                "CTVA",
                "JPM",
                "JNJ",
                "TXN",
                "PFE",
                "ABT",
                "GLW",
                "WM",
                "TRV",
                "CME",
                "CMI",
                "TJX",
                "OMC",
                "BCE",
                "HON",
                "CL",
                "AEP",
                "HSY",
                "MCD",
                "EXC",
                "LMT",
                "CMCSA",
                "MCK",
                "APD",
                "XOM",
                "PG",
                "ENB",
                "PEP",
                "EQIX",
                "GPC",
                "HD",
                "WMT"
            ]
        },
        {
            "id": "3305_Analyst Report_1684344137000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2023-05-17T17:22:17Z",
            "reportTitle": "Pfizer is a leading developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 50.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "36501_Market Update_1684343237000",
            "headHtml": "Market Update: PARA, HD, NSC, PFE, CBOE",
            "provider": "Argus Research",
            "reportDate": "2023-05-17T17:07:17Z",
            "reportTitle": "Stocks rose on Wednesday morning as investors awaited new developments in the debt ceiling negotiations in Washington. Housing market data was mixed, with growth in both single- and multi-family housing starts, but a decline in total building permits. Overall housing starts rose 2.2% to an annualized 1.401 million units, slightly above the Reuters consensus forecast. The Dow rose 0.4%, the S&P 0.4%, and the Nasdaq 0.6%. Crude oil traded near $72 per barrel, while gold fell $7 to $1986 per ounce.",
            "tickers": [
                "PARA",
                "CBOE",
                "HD",
                "PFE",
                "NSC"
            ]
        },
        {
            "id": "35705_Stock Picks_1677502614000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2023-02-27T12:56:54Z",
            "reportTitle": "For our list this week, we are focusing on the Healthcare Sector, which we rank as one of our favorites with an Over-Weight rating.  Healthcare was an outperformer in 2022, falling only 4% while the S&P 500 dropped 19%, but has lagged in the early weeks of 2023. We think the recent relative weakness may offer a buying opportunity. Post-COVID, consumers are more willing to spend on lifestyle enhancements along with necessary spending on life-saving treatments. In addition, the survival of the Affordable Care Act has kept the ranks of insured U.S. citizens above the historical average, further increasing consumer spending on healthcare services and products. Meanwhile, companies with experience in diagnostic testing, vaccines, and antiviral medicines, as well as suppliers of protective equipment and other hospital products, have benefited from efforts to contain the pandemic. The sector accounts for 14.7% of the S&P 500, and includes companies in the pharmaceuticals, medical devices, healthcare services, and insurance industries. Here's our list of Argus BUY-rated Healthcare stocks that are large-cap and have solid books. We sorted by the largest percentage from the 52-week high.",
            "tickers": [
                "JNJ",
                "ZTS",
                "CRL",
                "MRNA",
                "RHHBY",
                "ISRG",
                "PFE",
                "UTHR",
                "DHR",
                "IQV"
            ]
        },
        {
            "id": "35649_Thematic Portfolio_1676992411000",
            "headHtml": "The Argus High-Yield Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2023-02-21T15:13:31Z",
            "reportTitle": "Value stocks -- a market segment that includes high-yield stocks -- outperformed growth stocks in 2022 for the first time since 2016. Indeed, for the past decade, the performance record has favored growth. But the tide turned in 2022. The rollout of COVID-19 vaccines gave a lift to some of the cyclical companies (energy companies and regional banks) that had lagged in recent quarters, and value stocks outpaced growth stocks over the past year. Meanwhile, the Federal Reserve continues to lift interest rates to fend off inflation, which could possibly cap multiple expansion for growth companies for a few more quarters. Regardless, the value sector is the place to achieve income. The current yield on the iShares Russell 1000 Value Index ETF is 2.2%, compared to the 0.9% current yield on the iShares Russell 1000 Growth Index ETF.  For our High-Yield Theme Model Portfolio, we are seeking stocks with yields of at least 3.0%.  This moves us deep into the value segment of the market.",
            "tickers": [
                "C",
                "LAZ",
                "CVX",
                "VZ",
                "F",
                "K",
                "SPG",
                "SLF",
                "PFE",
                "TFC",
                "PRU",
                "LYB",
                "IBM",
                "VLO",
                "UPS",
                "DUK",
                "SO",
                "SNY",
                "OMC",
                "BCE",
                "IP",
                "ABBV",
                "DOW",
                "QSR",
                "PSX",
                "EIX",
                "XOM",
                "ENB",
                "GILD",
                "PM"
            ]
        },
        {
            "id": "35495_Market Summary_1675686868000",
            "headHtml": "Market Digest: AMGN, ASH, EPD, LAZ, MMM, MO, PFE, ROP, SBUX, SWK, APTV, AGNC",
            "provider": "Argus Research",
            "reportDate": "2023-02-06T12:34:28Z",
            "reportTitle": "Monday Tee Up: Heavy on Earnings, Light on the Economy",
            "tickers": [
                "MO",
                "ROP",
                "LAZ",
                "SBUX",
                "AGNC",
                "ASH",
                "SWK",
                "EPD",
                "MMM",
                "AMGN",
                "PFE",
                "APTV"
            ]
        },
        {
            "id": "3305_Analyst Report_1675686868000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2023-02-06T12:34:28Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 60.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "35405_Thematic Portfolio_1674748218000",
            "headHtml": "The Argus Min Vol Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2023-01-26T15:50:18Z",
            "reportTitle": "Rapidly rising inflation 2022 knocked stocks into a bear market. While growth strategies suffered the most, value strategies also declined. Even bond prices were lower last year. Volatility, which has dropped from the highs of 2020, still has not returned to pre-COVID levels. Is it time for investors to cash in their chips? We note that investors exit the stock market at their own peril, as long-term returns from equities consistently have outpaced long-term returns from other asset classes, such as fixed income and cash. As well, those fixed-income returns are from eras when the 10-year Treasury bond yield was much higher than the current 3.5% level. So what's a potential equity strategy for investors amid all the uncertainty? Argus believes that Min Vol is an all-weather strategy that is timely in any investing climate.",
            "tickers": [
                "CSCO",
                "CTVA",
                "VZ",
                "JNJ",
                "MRK",
                "TXN",
                "ADP",
                "PFE",
                "DHR",
                "ABT",
                "UNP",
                "WM",
                "TRV",
                "KO",
                "OMC",
                "BCE",
                "HON",
                "CL",
                "AEP",
                "AVB",
                "HSY",
                "MCD",
                "EXC",
                "LMT",
                "MCK",
                "APD",
                "XOM",
                "PG",
                "ENB",
                "PEP",
                "GPC",
                "AJG",
                "WMT"
            ]
        },
        {
            "id": "3305_Analyst Report_1667931119000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2022-11-08T18:11:59Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 65.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "34663_Market Update_1667930219000",
            "headHtml": "Market Update: CLX, NFG, PFE, SANM, SBUX, MDLZ, W",
            "provider": "Argus Research",
            "reportDate": "2022-11-08T17:56:59Z",
            "reportTitle": "Stocks rose on Tuesday morning as investors awaited the results of the midterm elections, with late polls pointing to a Republican victory in the House and a tight race in the Senate. On the earnings front, Lyft shares fell more than 20% after the ride-hailing firm posted weaker-than-expected 3Q revenue and earnings. The Dow rose 1.3%, the S&P 1.1%, and the Nasdaq 1.3%. Crude oil fell slightly to $91.50 per barrel, while gold rose $36 to $1717 per ounce.",
            "tickers": [
                "MDLZ",
                "SBUX",
                "W",
                "SANM",
                "CLX",
                "NFG",
                "PFE"
            ]
        },
        {
            "id": "34643_Stock Picks_1667823926000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2022-11-07T12:25:26Z",
            "reportTitle": "Both the potential onset of recession (if the economy is not in one already) and the sharp move higher in interest rates have pulled the foundation out from under the equity market in 2022.  Few sectors have been spared, with only the Energy industry in the green on a year-to-date basis. The broad retrenchment has dragged down small-caps, mid-caps, large-caps, and even the mega-caps that had previously pushed stocks to new heights as the economy recovered from the pandemic. In our opinion, some of these world-class companies have been oversold. For our list this week, we have identified 11 BUY-rated large- or mega-cap companies across numerous industries that are selling at attractive valuations and are more than 20% below their 52-week highs.",
            "tickers": [
                "MSFT",
                "GOOGL",
                "NVDA",
                "TSLA",
                "BAC",
                "VZ",
                "JPM",
                "HD",
                "AMZN",
                "PFE",
                "DIS"
            ]
        },
        {
            "id": "34361_Stock Picks_1665401832000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2022-10-10T11:37:12Z",
            "reportTitle": "Healthcare is a sector that includes many categories and investing disciplines. It is innovative, can be either growth or value, and can involve start-ups or mature companies. A healthcare company can be built around one product that is leveraged in broad and creative ways, or a company with depth, breadth and products that have many touchpoints. Many of the companies are truly science-based, some with managers who are stronger as scientists than as executives running a company; others have scientists focus on science while practiced managers mind the books. The Healthcare sector accounts for 15% of the S&P 500, with an overall market cap of $1.4 trillion dollars. Subsectors include Biotechnology, Healthcare Distributors, Healthcare Equipment, Healthcare Supplies, Life Sciences Tools and Services, Managed Healthcare, and Pharmaceuticals. We think investors should Over-Weight the sector and consider allocating about 15% of their diversified portfolios to stocks in the sector. Healthcare is slightly outperforming the S&P 500 thus far in 2022, with a loss of 14% compared to the 25% loss for the S&P 500. The following are some Argus BUY-rated Healthcare companies. The stocks were selected using the Argus screening tool and the following criteria: BUY-rated; large-cap (greater than $8 billion market capitalization); a Financial Strength rating of Medium-High or High; and paying a dividend. We feel these companies currently are best in class for the sector. Some are also part of our model portfolios (Growth & Income, Equity Income, Growth, and Institutional).",
            "tickers": [
                "DGX",
                "BDX",
                "JNJ",
                "MRK",
                "ZTS",
                "RHHBY",
                "PFE",
                "UNH"
            ]
        },
        {
            "id": "33863_Thematic Portfolio_1660853633000",
            "headHtml": "The Argus High-Yield Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2022-08-18T20:13:53Z",
            "reportTitle": "Value stocks -- a market segment that includes high-yield stocks -- are outperforming growth stocks in 2022 for the first time since 2016. Indeed, for the past decade, the performance record has favored growth. In nine of the past 10 years, growth stocks have topped value stocks. But the tide may be turning. The rollout of COVID-19 vaccines has given a lift to some of the cyclical companies (energy companies and regional banks) that have lagged in recent quarters, and value stocks have kept up the pace with growth stocks in the past year. Now, the Federal Reserve lifting interest rates to fend off inflation, which will likely cap multiple expansion for growth companies. Regardless, the value sector is the place to achieve income. The current yield on the iShares Russell 1000 Value Index ETF is 2.1%, compared to the 0.8% current yield on the iShares Russell 1000 Growth Index ETF.  For our High-Yield Theme Model Portfolio, we are seeking stocks with yields of at least 3.0%.  This moves us deep into the value segment of the market.",
            "tickers": [
                "C",
                "CVX",
                "VZ",
                "AGNC",
                "DLR",
                "SPG",
                "SLF",
                "PPL",
                "PFE",
                "PRU",
                "LYB",
                "IBM",
                "VNO",
                "UL",
                "VLO",
                "NLY",
                "DUK",
                "SO",
                "SNY",
                "OMC",
                "BCE",
                "IP",
                "ABBV",
                "DOW",
                "PSX",
                "EIX",
                "BTI",
                "INTC",
                "XOM",
                "ENB",
                "GILD"
            ]
        },
        {
            "id": "3305_Analyst Report_1660239464000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2022-08-11T17:37:44Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 65.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "33789_Market Update_1660239464000",
            "headHtml": "Market Update: CENT, EBAY, PFE, VMC, RKT",
            "provider": "Argus Research",
            "reportDate": "2022-08-11T17:37:44Z",
            "reportTitle": "Stocks were mostly higher on Thursday morning amid more signs of moderating inflation. The Labor Department said that its producer price index for final demand fell 0.5% in July, down from a 1.0% increase in June. The reading was the first negative number since April 2020 and below the Reuters consensus forecast, which called for an increase of 0.2%. The Dow rose 0.5%, the S&P rose 0.4%, and the Nasdaq was flat. Crude oil rose 1.5% to $93.50 per barrel, while gold rose $8 to $1806 per ounce.",
            "tickers": [
                "EBAY",
                "CENT",
                "RKT",
                "VMC",
                "PFE"
            ]
        },
        {
            "id": "33645_Thematic Portfolio_1659015021000",
            "headHtml": "The Argus Min Vol Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2022-07-28T13:30:21Z",
            "reportTitle": "Rapidly rising inflation in 2022 has knocked the stock market into a bear market. While growth strategies have suffered the most, value strategies also have declined. Even year-to-date bond prices are lower. Volatility, which has dropped from the highs of 2020, still has not returned to pre-COVID levels. Is it time for investors to cash in their chips? We note that investors exit the stock market at their own peril, as long-term returns from equities consistently have outpaced long-term returns from other asset classes, such as fixed income and cash. As well, those returns are from eras when the 10-year Treasury bond yield was much higher than the current 3.0% level. So what's a potential equity strategy for investors amid all the uncertainty? Argus believes that Min Vol is an all-weather strategy that is timely in any investing climate. Academic literature and, more to the point, returns history, indicate that Min Vol can deliver market-matching returns on an absolute basis and superior returns on a risk-adjusted basis over various time periods.",
            "tickers": [
                "CSCO",
                "VZ",
                "JNJ",
                "MRK",
                "TXN",
                "RHHBY",
                "ADP",
                "PFE",
                "DHR",
                "ABT",
                "UNP",
                "WM",
                "UL",
                "TRV",
                "AEE",
                "KO",
                "OMC",
                "BCE",
                "HON",
                "CL",
                "AEP",
                "AVB",
                "DEO",
                "HSY",
                "MCD",
                "LMT",
                "APD",
                "XOM",
                "PG",
                "ENB",
                "PEP",
                "GPC",
                "WMT"
            ]
        },
        {
            "id": "33349_Technical Analysis_1656399850000",
            "headHtml": "Technical Assessment: Bearish in the Intermediate-Term",
            "provider": "Argus Research",
            "reportDate": "2022-06-28T07:04:10Z",
            "reportTitle": "Monday provided a much-needed rest for the stock market after a very large rebound last week. Following that strong week (and we've seen this before during the current decline), the \"bottom-callers\" are out, but not in big numbers. That's probably a good thing, as others are calling this another bear-market rally. From a technical perspective and using our own interpretation, it is far too early to call the bottom as there is just not enough of the needed evidence.",
            "tickers": [
                "NDAQ",
                "PFE"
            ]
        },
        {
            "id": "33025_Technical Analysis_1653461515000",
            "headHtml": "Technical Assessment: Neutral in the Intermediate-Term",
            "provider": "Argus Research",
            "reportDate": "2022-05-25T06:51:55Z",
            "reportTitle": "We are raising our intermediate-term technical outlook to neutral from bearish. This reverses our April 22 intermediate-term downgrade from neutral to bearish. This action is not a green light and we are not saying the bottom is in and it's up, up, and away from here. But we do think the major indices are attempting to hammer out (via a candlestick pattern) a bottom because we have seen a few \"sticks\" in recent trading sessions. Simply put, we are seeing days where stocks trade significantly lower but then finish strong.",
            "tickers": [
                "EOG",
                "PFE"
            ]
        },
        {
            "id": "32923_Top/Bottom Insider Activity_1652682720000",
            "headHtml": "Daily – Vickers Top Buyers & Sellers for 05/16/2022",
            "provider": "Argus Research",
            "reportDate": "2022-05-16T06:32:00Z",
            "reportTitle": "The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions.",
            "tickers": [
                "ECAT",
                "CRSR",
                "RILY",
                "RHI",
                "IMBI",
                "AN",
                "KAR",
                "PAYC",
                "PFE",
                "RCMT"
            ]
        },
        {
            "id": "32911_Top/Bottom Insider Activity_1652424855000",
            "headHtml": "Daily – Vickers Top Buyers & Sellers for 05/13/2022",
            "provider": "Argus Research",
            "reportDate": "2022-05-13T06:54:15Z",
            "reportTitle": "The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions.",
            "tickers": [
                "RILY",
                "IHRT",
                "SBUX",
                "PBF",
                "BANF",
                "TLS",
                "TMST",
                "PFE"
            ]
        },
        {
            "id": "3305_Analyst Report_1652189023000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2022-05-10T13:23:43Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 65.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "32877_Market Update_1652188123000",
            "headHtml": "Market Update: GILD, PFE, SYY, TSN, VTR, FBHS",
            "provider": "Argus Research",
            "reportDate": "2022-05-10T13:08:43Z",
            "reportTitle": "Stocks gave up early gains on Tuesday morning amid continued concerns about inflation, Fed rate hikes, and lackluster corporate earnings. The slide followed Monday's massive selloff, which sent the S&P below 4,000 for the first time since March 2021. Peloton shares dropped more than 15% after the fitness equipment maker posted a wider-than-expected fiscal 3Q loss, offered disappointing 4Q revenue guidance, and said that it was 'thinly capitalized.' The Dow fell 0.4%, the S&P 0.4%, and the Nasdaq 0.3%. Crude oil traded near $101 per barrel, while gold fell $13 to $1845 per ounce.",
            "tickers": [
                "SYY",
                "VTR",
                "FBHS",
                "GILD",
                "PFE",
                "TSN"
            ]
        },
        {
            "id": "32858_Market Outlook_1652082896000",
            "headHtml": "Daily Spotlight: Core of U.S. Economy Still on Growth Path",
            "provider": "Argus Research",
            "reportDate": "2022-05-09T07:54:56Z",
            "reportTitle": "We expect resiliency from the U.S. economy and don't anticipate a recession in the near term, based in large part on strength in the all-important consumer and investment sectors of the economy. But there are risks, especially if the Fed moves too quickly to raise rates. The domestic employment environment is nearing full strength, although consumer confidence trends are mixed.  Auto sales have recovered from pandemic lows, but at an uneven pace. The U.S. housing market has aided the economic recovery from the pandemic; while high prices have cooled the market a bit, many metrics remain positive. The risk here is that the Fed moves too fast and the consumer sector stalls. Businesses are expanding, but growth is slowing somewhat. Exports are under pressure from the geopolitical tensions in Europe and the rising dollar. But import growth will not continue at the recent high-teens pace. Government spending trends should smooth out as well. Rolling all the data up, our GDP growth forecast in 2022 is now 2.2%, down from our prior forecast of 2.8%.  Our estimates are a bit lower than those of other forecasters.",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "32857_Stock Picks_1652081585000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2022-05-09T07:33:05Z",
            "reportTitle": "Markets have faced difficult times before, with challenging economic environments, wars, disease, banking and housing crises, and inflation much worse than we are seeing now, to name but a few. Of late, stock investors had it very good for a very long time -- but now, finding opportunities requires much more work. There is no secret sauce, but there are principals that are worth reviewing: 1) diversify; 2) look for strong management; 3) look for solid balance sheets; 4) do your homework; and 5) adapt. To assemble this week's list, we looked across several sectors that historically are considered to be the most-shielded from high inflation and high interest rates. We then cross-referenced our coverage universe for companies where our analysts recently raised target prices; that have an Argus Financial Strength rating of at least Medium-High; and that pay dividends of least 3%. Some companies also are featured in our model portfolios (Growth & Income, Equity Income, Growth, and Institutional). Here is our list of companies we believe to be recession-proof, all of which are rated BUY at Argus.",
            "tickers": [
                "CVS",
                "CVX",
                "KO",
                "JNJ",
                "CL",
                "ADM",
                "K",
                "AMGN",
                "PFE",
                "HAL",
                "PEG",
                "PSX",
                "XOM",
                "PG",
                "UL",
                "ENB",
                "EPD",
                "PNW",
                "VLO",
                "PEP",
                "PXD"
            ]
        },
        {
            "id": "32247_Thematic Portfolio_1645782233000",
            "headHtml": "The Argus High-Yield Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2022-02-25T09:43:53Z",
            "reportTitle": "Value stocks -- a market segment that includes high-yield stocks -- are outperforming growth stocks in 2022. For the past decade, the performance record has favored growth, but the tide may be turning. The rollout of COVID-19 vaccines has given a lift to some of the cyclical companies (energy companies and regional banks) that have lagged in recent quarters, and value stocks have kept up the pace with growth stocks in the past year. Now, the Federal Reserve is poised to lift interest rates to fend off inflation, which will likely cap multiple expansion for growth companies. Regardless, the value sector is the place to achieve income. The current yield on the iShares Russell 1000 Value Index ETF is 1.6%, compared to the 0.5% current yield on the iShares Russell 1000 Growth Index ETF.  For our High-Yield Theme Model Portfolio, we are seeking stocks with yields of at least 3.0%. This moves us deep into the value segment of the market.",
            "tickers": [
                "CVX",
                "VZ",
                "AGNC",
                "K",
                "SPG",
                "SLF",
                "AMGN",
                "PPL",
                "PFE",
                "TFC",
                "PRU",
                "LYB",
                "IBM",
                "VNO",
                "UL",
                "VLO",
                "NLY",
                "DUK",
                "SO",
                "SNY",
                "BCE",
                "IP",
                "ABBV",
                "DOW",
                "PSX",
                "EIX",
                "INTC",
                "XOM",
                "ENB",
                "MET"
            ]
        },
        {
            "id": "32134_Market Update_1644585579000",
            "headHtml": "Market Update: APD, MAS, MAT, PFE, TWTR",
            "provider": "Argus Research",
            "reportDate": "2022-02-11T13:19:39Z",
            "reportTitle": "Stocks fell again on Friday morning amid continued concerns about surging inflation and the impact of Fed rate hikes. Consumer confidence data was weaker than expected. The University of Michigan's consumer sentiment index fell to 61.7 in the first half of February, down from 67.2 in January and below the Reuters consensus forecast of 67.5. The Dow was flat, the S&P fell 0.3%, and the Nasdaq fell 0.7%. Crude oil rose to more than $91 per barrel, while gold traded near $1835 per ounce.",
            "tickers": [
                "MAT",
                "APD",
                "TWTR",
                "MAS",
                "PFE"
            ]
        },
        {
            "id": "3305_Analyst Report_1644585579000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2022-02-11T13:19:39Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 65.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "32065_Market Outlook_1644218662000",
            "headHtml": "Daily Spotlight: We Look For 2.1% Growth in 1Q GDP",
            "provider": "Argus Research",
            "reportDate": "2022-02-07T07:24:22Z",
            "reportTitle": "Recent data illustrates that U.S. GDP is still expanding (despite the pandemic), though not consistently across all segments of the economy. It seems that some variant of COVID-19 is going to be affecting GDP for several more quarters, at least. We expect resiliency from the economy and don't anticipate a recession in the near term. The primary driver of GDP over the next few quarters is likely to be developments in the pandemic. Trends here have been positive of late, as the impact of Omicron seemingly has passed a peak. The domestic employment environment is in better shape than it was a year ago, although consumer confidence trends are mixed. Auto sales have recovered from pandemic lows, but growth has slowed due to supply-chain issues (that we note are starting to improve). Businesses are again expanding. But the housing marke has started to cool as home prices soar. Rolling the data up, our model calls for a 2.1% increase in 1Q22 GDP. We look for improving growth as 2022 progresses, as Omicron fears fade. On an annual basis, our forecast for 2022 GDP growth is 3.4%. Our estimates are a bit lower than other forecasters. The Federal Reserve and the IMF are anticipating 2022 growth of 4.0%. The Philadelphia Federal Reserve's Survey of Professional Forecasters is calling for growth of 3.9% in 2022. That said, the GDPNow Forecast from the Federal Reserve Bank of Atlanta is only 0.1% for 1Q22.",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "31993_Thematic Portfolio_1643287499000",
            "headHtml": "The Argus Min Vol Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2022-01-27T12:44:59Z",
            "reportTitle": "The onset of the coronavirus in 2020 knocked stocks into a bear market. Though equities recovered, the U.S. economy is about to slow down and COVID-19 cases are rising again as virus variants spread. Volatility, which has dropped from the highs of 2020, still has not returned to pre-COVID levels.  Daily prices can swing wildly, as they did three times in 2021 when stocks dropped 4%-5% in a matter of a few days. Is it time for investors to cash in their chips? We note that investors exit the stock market at their own peril, as long-term returns from equities consistently have outpaced long-term returns from other asset classes, such as fixed income and cash. As well, those returns are from eras when the 10-year Treasury bond yield was not sub-2.0%. So what's a potential equity strategy for investors amid all the uncertainty? Argus believes that Min Vol is an all-weather strategy that is timely in any investing climate. Academic literature and, more to the point, returns history indicate that Min Vol can deliver market-matching returns on an absolute basis and superior returns on a risk-adjusted basis over various time periods.",
            "tickers": [
                "CSCO",
                "VZ",
                "JNJ",
                "MRK",
                "TXN",
                "RHHBY",
                "PFE",
                "DHR",
                "MSFT",
                "ABT",
                "WM",
                "UL",
                "UPS",
                "AEE",
                "KO",
                "ICE",
                "ACN",
                "AEP",
                "DEO",
                "MCD",
                "LMT",
                "ROP",
                "CMCSA",
                "APD",
                "PG",
                "ENB",
                "PEP",
                "CHD",
                "ODFL",
                "WMT"
            ]
        },
        {
            "id": "31577_Top/Bottom Insider Activity_1638858778000",
            "headHtml": "Daily – Vickers Top Buyers & Sellers for 12/07/2021",
            "provider": "Argus Research",
            "reportDate": "2021-12-07T06:32:58Z",
            "reportTitle": "The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions.",
            "tickers": [
                "PYPL",
                "VBTX",
                "NEO",
                "UFI",
                "FCX",
                "AMG",
                "DELL",
                "PFE",
                "PRGO"
            ]
        },
        {
            "id": "31528_Top/Bottom Insider Activity_1638338977000",
            "headHtml": "Daily – Vickers Top Buyers & Sellers for 12/01/2021",
            "provider": "Argus Research",
            "reportDate": "2021-12-01T06:09:37Z",
            "reportTitle": "The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions.",
            "tickers": [
                "CANO",
                "THG",
                "PCOR",
                "BILL",
                "DNUT",
                "KD",
                "TMDX",
                "BCAB",
                "PFE"
            ]
        },
        {
            "id": "3305_Analyst Report_1635947558000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2021-11-03T13:52:38Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 55.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "31306_Market Update_1635946658000",
            "headHtml": "Market Update: ADTN, PFE, TROW, WY, LEA, KHC",
            "provider": "Argus Research",
            "reportDate": "2021-11-03T13:37:38Z",
            "reportTitle": "Stocks were mixed on Wednesday morning as investors awaited the details of the Fed's tapering plan. Employment data was stronger than expected. Payroll provider ADP said that U.S. private employers added 571,000 payroll jobs in October, up from 523,000 in September and above the Reuters consensus forecast of 400,000. The Dow fell 0.2%, the S&P fell 0.1%, and the Nasdaq rose 0.2%. Crude oil traded near $81.50 per barrel, while gold fell $20 to $1770 per ounce.",
            "tickers": [
                "TROW",
                "WY",
                "ADTN",
                "KHC",
                "LEA",
                "PFE"
            ]
        },
        {
            "id": "3305_Analyst Report_1633612186000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2021-10-07T13:09:46Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 55.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "31081_Market Update_1633611286000",
            "headHtml": "Market Update: PFE, DELL",
            "provider": "Argus Research",
            "reportDate": "2021-10-07T12:54:46Z",
            "reportTitle": "Stocks rose on Thursday morning on lessening fears concerning the debt ceiling. Lawmakers have reached a deal to extend the debt limit through the beginning of December. The Labor Department reported that initial unemployment claims for the week ended October 2 were 326,000 vs. 348,000 expected and an upwardly revised 364,000 during prior week. Continuing claims for the week ended September 25 were 2.7 million, less than the 2.8 million expected. The Dow rose 1.5%, the S&P 1.5%, and the Nasdaq 1.7%. Crude oil traded near $78 per barrel, while gold traded near $1758 per ounce.",
            "tickers": [
                "DELL",
                "PFE"
            ]
        },
        {
            "id": "31065_Market Outlook_1633503187000",
            "headHtml": "Daily Spotlight: Another Reduction to Argus' 3Q GDP Forecast",
            "provider": "Argus Research",
            "reportDate": "2021-10-06T06:53:07Z",
            "reportTitle": "Data that has emerged in recent weeks illustrates that the economy is still expanding, though some white-hot growth rates in certain sectors are starting to cool. The primary driver of GDP over the next few quarters is likely to be the country's physical health, as the nation recovers from the COVID-19 pandemic. Trends here have been slightly more positive in recent weeks, as the fourth wave of the pandemic, due largely to the Delta variant of COVID-19, may be past its peak. The domestic employment environment is in better shape than it was a year ago, though still far from full strength -- and it has weakened recently due to the Delta variant. Auto sales have recovered, but inventories are low due to bottlenecks. And the housing market, which had been strong in 1H21, is starting to cool as house prices soar. Rolling all the data up, and taking into account rising COVID cases as well as emerging supply chain issues and inventory levels, our GDP model now calls for 4.2% increase in GDP in 3Q21. We expect better growth in 4Q, too, before rates fall somewhat more sharply in 2022. On an annual basis, we look for overall GDP growth of approximately 5.8% in 2021 and 3.7% in 2022. Our estimates are consistent with consensus forecasts and the outlook from the Federal Reserve, which call for growth of 4%-6% in 2021. The GDPNow Forecast from the Federal Reserve Bank of Atlanta is 3.2% for 3Q21.",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "30815_Market Outlook_1631000020000",
            "headHtml": "Daily Spotlight: Slight Reduction to Argus' 3Q GDP Forecast",
            "provider": "Argus Research",
            "reportDate": "2021-09-07T07:33:40Z",
            "reportTitle": "The data that has emerged in recent weeks illustrates that the economy is still expanding, though some white-hot growth rates in certain sectors are starting to cool. As we do each month, we have reviewed more than 25 important demographic and economic data points, from all sectors of the economy including consumer, housing, automotive, manufacturing and exports, among others. We also pay close attention to Federal Reserve activity, oil prices, the dollar, and trends in COVID-19. Rolling all the data up, and looking out two years, our GDP model now calls for 5.3% increase in GDP in 3Q21, down from our earlier forecast of 5.8%.  We expect good growth in 4Q as well, before rates fall more sharply in 2022. On an annual basis, we look for overall GDP growth of approximately 6.0 % in 2021 and 3.7% in 2022. Our estimates are consistent with consensus forecasts and the outlook from the Federal Reserve, which call for growth of 4%-7% in 2021. The GDPNow Forecast from the Federal Reserve Bank of Atlanta is 5.3% for 3Q21.  For more details of the trends inthis data and our assumptions, see the Argus Viewpoint report.",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "30670_Thematic Portfolio_1629282444000",
            "headHtml": "The Argus High-Yield Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2021-08-18T10:27:24Z",
            "reportTitle": "Value stocks are outperforming growth in 2021 for the first time since 2016. While a recent rally in growth stocks has narrowed the performance advantage for value in the year to date, an environment of historically low interest rates is one in which many investors are still searching for high levels of income -- which often can be found in value stocks. When we look for attractive high-yield/deep-value stocks at Argus, we look for low valuations on metrics such as price/earnings, price/sales, price/book, yield, and price/cash flow. We also look for companies with clean balance sheets, high levels of profitability, high-quality earnings, and experienced management teams. We seek to avoid companies in industries that are in secular decline, or with dividend yields that are so high that the payout is clearly at risk. Based on numerous requests from clients, we have designed a portfolio of companies that are BUY-rated at Argus Research, have a Financial Strength rating of at least Medium, and have a yield of 3.0% or higher.",
            "tickers": [
                "CVX",
                "VZ",
                "AGNC",
                "CFG",
                "SLF",
                "AMGN",
                "PPL",
                "PFE",
                "TFC",
                "PRU",
                "LYB",
                "IBM",
                "VNO",
                "UL",
                "VLO",
                "NLY",
                "DUK",
                "SO",
                "SNY",
                "IP",
                "ABBV",
                "MMM",
                "DOW",
                "PSX",
                "EIX",
                "ENB",
                "DRI",
                "PEAK",
                "MET"
            ]
        },
        {
            "id": "30645_Stock Picks_1629098776000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2021-08-16T07:26:16Z",
            "reportTitle": "Second-quarter earnings announcements are nearly complete, with some 90% of S&P 500 companies having reported. The profit recovery from the depths of the pandemic low in 2Q20 was been swift, with earnings growth of 93% in 2Q21, according to Refinitiv. But earnings do not look good just on a relative basis -- the $53.93 projected to be earned by S&P 500 companies for the second quarter is the highest ever for the index. Investors can now turn their attention to the third quarter, when earnings are expected to rise a still-strong 30% year-over-year.  Our analysts are always on the lookout for companies that raise their outlooks during earnings season.  Management's ability to \"raise guidance\" can often be a catalyst to strong returns in the quarters ahead.  Here are 20 BUY-rated companies in Argus coverage for which management has raised guidance or increased its outlook during the 2Q21 EPS reporting season.",
            "tickers": [
                "PYPL",
                "CARR",
                "WEN",
                "NOC",
                "KO",
                "GPN",
                "FISV",
                "ABBV",
                "ACM",
                "PFE",
                "UNH",
                "TMUS",
                "ROP",
                "INTC",
                "NOW",
                "ANTM",
                "MCO",
                "GNRC",
                "SPGI",
                "EA",
                "MAS"
            ]
        },
        {
            "id": "30528_Stock Picks_1627894097000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2021-08-02T08:48:17Z",
            "reportTitle": "Consumers are now more willing to spend on lifestyle enhancements along with necessary spending on life-saving treatments. In addition, the survival of the Affordable Care Act has kept the ranks of insured U.S. citizens above the historical average, further increasing consumer spending on healthcare services and products. Meanwhile, companies with experience in diagnostic testing, vaccines, and antiviral medicines, as well as suppliers of protective equipment and other hospital products, should benefit from efforts to contain the coronavirus pandemic. The sector accounts for 13.0% of the S&P 500, and includes companies in the pharmaceuticals, medical devices, healthcare services, and insurance industries. The sector is underperforming the market thus far in 2021, with a gain of 12.9%. We think the sector should account for 15-17% of diversified portfolios. Here is how we use our analysts' Financial Services sector ideas in our Focus List and Model Portfolios. All stocks are rated BUY at Argus.",
            "tickers": [
                "ZBH",
                "ABC",
                "SYK",
                "CTLT",
                "HCA",
                "JNJ",
                "ABBV",
                "PFE",
                "BMY",
                "DHR",
                "TECH",
                "SILK",
                "MCK",
                "BDX",
                "TMO",
                "ANTM",
                "LLY",
                "ZTS",
                "ISRG"
            ]
        },
        {
            "id": "30509_Market Update_1627566246000",
            "headHtml": "Market Update: ADP, BA, BYD, JBLU, PFE, QCOM, XLNX, V, PYPL",
            "provider": "Argus Research",
            "reportDate": "2021-07-29T13:44:06Z",
            "reportTitle": "Stocks rose on Thursday morning, a day after the Federal Reserve signaled that it would wait for further economic recovery before paring back its $120 billion per month bond-buying program. The Commerce Department reported that the U.S. economy expanded at a 6.5% annualized rate in 2Q, up from 6.3% in 1Q, but well below the Bloomberg consensus forecast of 8.4%. The Dow rose 0.5%, the S&P 0.5%, and the Nasdaq 0.4%. Crude oil rose 1% to $73 per barrel, while gold traded near $1829 per ounce.",
            "tickers": [
                "PYPL",
                "JBLU",
                "QCOM",
                "V",
                "XLNX",
                "BYD",
                "ADP",
                "PFE",
                "BA"
            ]
        },
        {
            "id": "3305_Analyst Report_1627566246000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2021-07-29T13:44:06Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 55.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "30483_Thematic Portfolio_1627381274000",
            "headHtml": "The Argus Min Vol Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2021-07-27T10:21:14Z",
            "reportTitle": "The onset of the coronavirus in 2020 knocked the stock market into a bear market. Though stocks have recovered, the U.S. economy is about to slow down and COVID-19 cases are rising again as virus variants spread. Volatility, which has dropped from the highs of 2020, still has not returned to pre-COVID levels.  Daily prices can swing wildly, as they did during two consecutive days in mid-July when the Dow Jones Industrial Average plummeted more than 1,000 points. Yet investors exit the stock market at their own peril, as long-term returns from equities consistently have outpaced long-term returns from other asset classes. Argus believes that Min Vol is an all-weather strategy that is timely in any investing climate and can deliver market-matching returns on an absolute basis and superior returns on a risk-adjusted basis over various time periods.",
            "tickers": [
                "CSCO",
                "VZ",
                "JNJ",
                "MRK",
                "TXN",
                "AMGN",
                "PFE",
                "DHR",
                "MSFT",
                "WM",
                "UL",
                "UPS",
                "MKC",
                "AMT",
                "CL",
                "ICE",
                "ACN",
                "MMM",
                "MCD",
                "NEE",
                "LMT",
                "CMCSA",
                "WEC",
                "APD",
                "PG",
                "ENB",
                "PEP",
                "CHD",
                "ODFL",
                "WMT"
            ]
        },
        {
            "id": "30297_Technical Analysis_1625555758000",
            "headHtml": "Technical Assessment: Bullish in the Intermediate-Term",
            "provider": "Argus Research",
            "reportDate": "2021-07-06T07:15:58Z",
            "reportTitle": "Since May and June, we have seen and commented on a marked improvement in the relative strength of the Nasdaq, the Nasdaq 100 (QQQ), and many Tech ETFs (like the XLK, IGV-iShares N.A. Tech-Software, $NYFANG-NYSE Fang Plus Index, and the SKYY or First Trust Cloud Computing.",
            "tickers": [
                "PFE",
                "UNH"
            ]
        },
        {
            "id": "30074_Market Outlook_1623138028000",
            "headHtml": "Daily Spotlight: Second-Quarter GDP Forecast Now 8.9%",
            "provider": "Argus Research",
            "reportDate": "2021-06-08T07:40:28Z",
            "reportTitle": "Recent economic data illustrates that conditions are improving, though serious risks remain. The primary driver of GDP over the next few quarters is likely to be the country's physical health, as the nation recovers from COVID-19. Elsewhere, the employment environment is in better shape than it was a year ago (though still far from strong) and consumer confidence is improving. We expect that rising confidence will lead to continued growth in consumer spending. Auto sales have recovered, and the housing market remains strong, even as interest rates tick higher. Businesses are again expanding. Our GDP model now calls for a 2.1% increase in absolute GDP in 2Q21 from 1Q21, which translates to an annualized gain of 8.9%, up from our prior forecast of 8.8%. We expect further improvement into 2H21. On an annual basis, we look for overall GDP growth of approximately 5.7% in 2021 and 3.7% in 2022. Our estimates are consistent with consensus forecasts and the outlook from the Federal Reserve, which call for growth of 4%-6% in 2021. The GDPNow forecast from the Federal Reserve Bank of Atlanta is 10.3% for 2Q21.",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "30052_Technical Analysis_1622790063000",
            "headHtml": "Technical Assessment: Bullish in the Intermediate-Term",
            "provider": "Argus Research",
            "reportDate": "2021-06-04T07:01:03Z",
            "reportTitle": "As we approach the midpoint of 2021, and as we have pointed out many times this year and at the end of last year, index and sector outperformance has flipped 180 degrees. Year-to-date (YTD), the S&P 500 has tacked on 11.6%, the Dow Jones Industrials and the NYSE Composite have added almost 15%, the Nasdaq has gained 5.6%, and the Nasdaq 100 (QQQ) is up 5%. Meanwhile, the S&P Mid-Cap 400 has jumped 18%, the Russell 2000 (IWM) has leapt 15.7%, and the S&P Small-Cap 600 (SML) has catapulted 23%.",
            "tickers": [
                "NOV",
                "PFE"
            ]
        },
        {
            "id": "30012_Market Summary_1622531573000",
            "headHtml": "Market Digest: HPQ, PFE, BCE, FOXA",
            "provider": "Argus Research",
            "reportDate": "2021-06-01T07:12:53Z",
            "reportTitle": "The stock market moved higher last week, with technology stocks outperforming blue chips. During Friday's session, the Dow Jones Industrial Average increased 65 points, or 0.19%. The S&P 500 was up 0.08%, and the Nasdaq Composite was up 0.09%. For the week, the DJIA was up 322 points, or 0.94%, the S&P 500 was up 1.16%, and the Nasdaq Composite was up 2.06%. Year-to-date, the DJIA is up 12.82%, the S&P 500 is up 11.93%, and the Nasdaq Composite is up 6.68%.",
            "tickers": [
                "FOXA",
                "BCE",
                "HPQ",
                "PFE"
            ]
        },
        {
            "id": "3305_Analyst Report_1622531573000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2021-06-01T07:12:53Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 55.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "29743_Technical Analysis_1619594192000",
            "headHtml": "Technical Assessment: Bullish in the Intermediate-Term",
            "provider": "Argus Research",
            "reportDate": "2021-04-28T07:16:32Z",
            "reportTitle": "As we have pointed out several times of late, 2021 has not been close to normal. One of the biggest surprises has been that 2021 appears to be \"The Year of Retail.\" We're not talking about the online world dominated by Amazon, but rather the tried-and-true brick-and-mortar retail world that not long ago seemed to be going under. But by now, most companies in the space have shifted to online sales -- and, so far, the market seems to think these firms may have a chance.",
            "tickers": [
                "THO",
                "PFE"
            ]
        },
        {
            "id": "29502_Technical Analysis_1617086510000",
            "headHtml": "Technical Assessment: Bullish in the Intermediate-Term",
            "provider": "Argus Research",
            "reportDate": "2021-03-30T06:41:50Z",
            "reportTitle": "Last week was a wild affair, as major stock indices saw multiple reversals. After Friday's surge, the S&P 500 actually made a very marginal (less than 1 point) all-time high, though many other indices are still in short-term downtrends.",
            "tickers": [
                "CLX",
                "PFE"
            ]
        },
        {
            "id": "3305_Analyst Report_1613027405000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2021-02-11T07:10:05Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 55.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "29117_Market Summary_1613027405000",
            "headHtml": "Market Digest: CHKP, CMI, CSCO, IEX, J, PFE, CBOE, OTIS",
            "provider": "Argus Research",
            "reportDate": "2021-02-11T07:10:05Z",
            "reportTitle": "Earnings Help Support a Stretched Market",
            "tickers": [
                "CSCO",
                "CHKP",
                "CBOE",
                "J",
                "OTIS",
                "IEX",
                "CMI",
                "PFE"
            ]
        },
        {
            "id": "28728_Thematic Portfolio_1608633108000",
            "headHtml": "The Argus High-Yield Model Portfolio",
            "provider": "Argus Research",
            "reportDate": "2020-12-22T10:31:48Z",
            "reportTitle": "Growth stocks may be outperforming value, again, in 2020. But in an environment of historically low interest rates (and with the coronavirus and economic shutdown seemingly poised to keep them low for a long time), many investors are still searching for high levels of income, which can often be found in value stocks. Progress on COVID-19 vaccines has given a lift to some of the cyclical companies (energy companies and regional banks) that have lagged in recent quarters, and value stocks have kept up the pace with growth stocks in the past quarter. The current yield on the iShares Russell 1000 Value Index ETF is 2.5%, compared to the 1.0% current yield on the iShares Russell 1000 Growth Index ETF.  This is not unimportant, as the current yield on the 10-year Treasury bond is 0.95%.",
            "tickers": [
                "AVGO",
                "CVX",
                "VZ",
                "AGNC",
                "CFG",
                "MRK",
                "K",
                "PPL",
                "NFG",
                "PFE",
                "TFC",
                "PRU",
                "T",
                "IBM",
                "STX",
                "PNW",
                "VLO",
                "NLY",
                "SO",
                "MO",
                "USB",
                "ABBV",
                "PKG",
                "LMT",
                "PSX",
                "EIX",
                "REG",
                "ENB",
                "GPC",
                "MET"
            ]
        },
        {
            "id": "28599_Stock Picks_1607345037000",
            "headHtml": "Weekly Stock List",
            "provider": "Argus Research",
            "reportDate": "2020-12-07T12:43:57Z",
            "reportTitle": "The onset of the coronavirus earlier this year knocked the stock market into a bear market.  Though stocks have recovered, the U.S. economy is still in recession and COVID-19 cases are spiking as the weather turns colder and people head indoors.  Volatility, which was low in early 2020 after a robust year for equities in 2019, has spiked higher, and has remained elevated. Is it time to cash in the chips?  We note that investors exit the stock market at their own peril, as long-term returns from equities consistently have outpaced long-term returns from other asset classes such as fixed income and cash. As well, those returns are from eras when the 10-year Treasury bond yield was not sub-1.0%.  So what's a potential equity strategy for investors amid all the uncertainty? Argus believes that Min Vol is an all-weather strategy that is timely in any investing climate. Academic literature and, more to the point returns history, indicate that Min Vol can deliver market-matching returns on an absolute basis and superior returns on a risk-adjusted basis over various time periods.  Stocks included in our Min Vol model portfolio and typically industry leaders and have received a high score from our A6 Quant Model on Financial Strength and a low score on Risk. Stocks in the portfolio include the following.",
            "tickers": [
                "HRL",
                "MKC",
                "VZ",
                "APD",
                "UPS",
                "ICE",
                "TXN",
                "AMGN",
                "CHD",
                "PFE"
            ]
        },
        {
            "id": "3305_Analyst Report_1604410075000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2020-11-03T13:27:55Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 55.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "28335_Market Update_1604410075000",
            "headHtml": "Market Update: BSX, TPR, FLEX, K, PFE, YUM, CBOE, PYPL, ANET",
            "provider": "Argus Research",
            "reportDate": "2020-11-03T13:27:55Z",
            "reportTitle": "Stocks rose strongly on Tuesday morning as American voters went to the polls and waited anxiously for the first returns this evening. Despite substantial uncertainty about the counting of mail-in ballots, tightening polls in several swing states, and control of the Senate, the rally suggested that investors were betting on a clear victory for Joe Biden and Senate Democrats, and on the economic boost that would come from a strong fiscal stimulus package. The Dow rose 2.5%, the S&P 2.3%, and the Nasdaq 2.1%. Crude oil traded near $38 per barrel, while gold rose $15 to $1908 per ounce.",
            "tickers": [
                "PYPL",
                "YUM",
                "ANET",
                "BSX",
                "TPR",
                "FLEX",
                "CBOE",
                "K",
                "PFE"
            ]
        },
        {
            "id": "28067_Market Outlook_1601535114000",
            "headHtml": "Daily Spotlight: Coast to the Finish from Here?",
            "provider": "Argus Research",
            "reportDate": "2020-10-01T06:51:54Z",
            "reportTitle": "In theory, investors can breathe easier heading into the fourth quarter, when markets typically post the strongest returns of the year. We analyzed data collected on S&P 500 performance from 1980-2020. By our calculations, the 4Q has generated average gains of 4.2%, compared to gains of 2.1%, 3.1% and 0.5% for 1Q, 2Q and 3Q, respectively. And the fourth quarter is consistent as well, with a \"win percentage\" of 80%.  That means that 4Q stock returns are positive four years out of five, and compares to winning percentages of 66% in 1Q, 66% in 2Q and 63% in 3Q.  To be sure, the 4Q has posted its share of clunkers. In 1987, which included Black Friday, stocks fell 23% during the period; in 2008, they sold off 18%, after the collapse of Lehman Brothers and as the U.S. economy plunged into a deep recession. As recently as 2018, stocks slid 14% in the final quarter as trade wars deepened and the Fed raised rates.  This time around, it is not unreasonable to expect volatility, given the pandemic, recession and election. The fourth quarter of election years historically has been in the red. We recommend clients focus on quality companies with clean balance sheets and experienced management teams.",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "28067_Market Outlook_1601510400000",
            "headHtml": "Daily Spotlight: Coast to the Finish from Here?",
            "provider": "Argus Research",
            "reportDate": "2020-10-01T00:00:00Z",
            "reportTitle": "In theory, investors can breathe easier heading into the fourth quarter, when markets typically post the strongest returns of the year. We analyzed data collected on S&P 500 performance from 1980-2020. By our calculations, the 4Q has generated average gains of 4.2%, compared to gains of 2.1%, 3.1% and 0.5% for 1Q, 2Q and 3Q, respectively. And the fourth quarter is consistent as well, with a \"win percentage\" of 80%.  That means that 4Q stock returns are positive four years out of five, and compares to winning percentages of 66% in 1Q, 66% in 2Q and 63% in 3Q.  To be sure, the 4Q has posted its share of clunkers. In 1987, which included Black Friday, stocks fell 23% during the period; in 2008, they sold off 18%, after the collapse of Lehman Brothers and as the U.S. economy plunged into a deep recession. As recently as 2018, stocks slid 14% in the final quarter as trade wars deepened and the Fed raised rates.  This time around, it is not unreasonable to expect volatility, given the pandemic, recession and election. The fourth quarter of election years historically has been in the red. We recommend clients focus on quality companies with clean balance sheets and experienced management teams.",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "3305_Analyst Report_1601385260000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2020-09-29T13:14:20Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 55.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "28051_Market Update_1601384360000",
            "headHtml": "Market Update: DVN, KMX, PFE",
            "provider": "Argus Research",
            "reportDate": "2020-09-29T12:59:20Z",
            "reportTitle": "Stocks fell on Tuesday morning, giving back some of Monday's gains as investors awaited the first presidential debate. On the economic front, the Commerce Department said that the U.S. trade deficit in goods rose 3.5% to $82.9 billion in August, reflecting strong imports of consumer goods and slower growth in exports. The increased deficit could weigh on 3Q GDP. Meanwhile, the Conference Board reported that its consumer confidence index rose to 101.8 in September, up from 86.3 in August and well above the Reuters consensus forecast of 89.5. The Dow fell 0.5%, the S&P 0.4%, and the Nasdaq 0.1%. Crude oil traded near $39 per barrel, while gold rose $10 to $1892 per ounce.",
            "tickers": [
                "KMX",
                "DVN",
                "PFE"
            ]
        },
        {
            "id": "3305_Analyst Report_1601337600000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2020-09-29T00:00:00Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 55.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "28051_Market Update_1601337600000",
            "headHtml": "Market Update: DVN, KMX, PFE",
            "provider": "Argus Research",
            "reportDate": "2020-09-29T00:00:00Z",
            "reportTitle": "Stocks fell on Tuesday morning, giving back some of Monday's gains as investors awaited the first presidential debate. On the economic front, the Commerce Department said that the U.S. trade deficit in goods rose 3.5% to $82.9 billion in August, reflecting strong imports of consumer goods and slower growth in exports. The increased deficit could weigh on 3Q GDP. Meanwhile, the Conference Board reported that its consumer confidence index rose to 101.8 in September, up from 86.3 in August and well above the Reuters consensus forecast of 89.5. The Dow fell 0.5%, the S&P 0.4%, and the Nasdaq 0.1%. Crude oil traded near $39 per barrel, while gold rose $10 to $1892 per ounce.",
            "tickers": [
                "KMX",
                "DVN",
                "PFE"
            ]
        },
        {
            "id": "27709_Technical Analysis_1597734627000",
            "headHtml": "Technical Assessment: Bullish in the Intermediate-Term",
            "provider": "Argus Research",
            "reportDate": "2020-08-18T07:10:27Z",
            "reportTitle": "With crude oil (WTI) pushing up against the top of its range near $43, and the extremely tight range continuing since June, it's possible that we'll start to see some upside fireworks. When? Well...timing is not a particular strength of technical analysis.",
            "tickers": [
                "COP",
                "PFE"
            ]
        },
        {
            "id": "27709_Technical Analysis_1597708800000",
            "headHtml": "Technical Assessment: Bullish in the Intermediate-Term",
            "provider": "Argus Research",
            "reportDate": "2020-08-18T00:00:00Z",
            "reportTitle": "With crude oil (WTI) pushing up against the top of its range near $43, and the extremely tight range continuing since June, it's possible that we'll start to see some upside fireworks. When? Well...timing is not a particular strength of technical analysis.",
            "tickers": [
                "COP",
                "PFE"
            ]
        },
        {
            "id": "3305_Analyst Report_1596118362000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2020-07-30T14:12:42Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 55.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "27564_Market Update_1596117462000",
            "headHtml": "Market Update: ASH, EBAY, LRCX, ODFL, PFE, QCOM, STX, MDLZ, PYPL",
            "provider": "Argus Research",
            "reportDate": "2020-07-30T13:57:42Z",
            "reportTitle": "Stocks fell on Thursday morning following a historically weak GDP report and continued grim employment data. The Commerce Department said that U.S. GDP fell at a 32.9% annualized rate in the second quarter. The decline was the steepest since the start of record-keeping in 1947. On the employment front, the Labor Department reported that 1.434 million Americans filed for state unemployment benefits in the week ended July 25, slightly below the consensus forecast and up from 1.416 million a week earlier. The Dow fell 1.1%, the S&P 0.7%, and the Nasdaq 0.1%. Crude oil fell more than 3% to $40 per barrel, while gold fell $20 to $1957 per ounce.",
            "tickers": [
                "PYPL",
                "MDLZ",
                "EBAY",
                "QCOM",
                "STX",
                "ASH",
                "LRCX",
                "PFE",
                "ODFL"
            ]
        },
        {
            "id": "3305_Analyst Report_1596067200000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2020-07-30T00:00:00Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 55.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "27564_Market Update_1596067200000",
            "headHtml": "Market Update: ASH, EBAY, LRCX, ODFL, PFE, QCOM, STX, MDLZ, PYPL",
            "provider": "Argus Research",
            "reportDate": "2020-07-30T00:00:00Z",
            "reportTitle": "Stocks fell on Thursday morning following a historically weak GDP report and continued grim employment data. The Commerce Department said that U.S. GDP fell at a 32.9% annualized rate in the second quarter. The decline was the steepest since the start of record-keeping in 1947. On the employment front, the Labor Department reported that 1.434 million Americans filed for state unemployment benefits in the week ended July 25, slightly below the consensus forecast and up from 1.416 million a week earlier. The Dow fell 1.1%, the S&P 0.7%, and the Nasdaq 0.1%. Crude oil fell more than 3% to $40 per barrel, while gold fell $20 to $1957 per ounce.",
            "tickers": [
                "PYPL",
                "MDLZ",
                "EBAY",
                "QCOM",
                "STX",
                "ASH",
                "LRCX",
                "PFE",
                "ODFL"
            ]
        },
        {
            "id": "27364_Market Summary_1594192370000",
            "headHtml": "Market Digest: TMUS, PFE",
            "provider": "Argus Research",
            "reportDate": "2020-07-08T07:12:50Z",
            "reportTitle": "In the first quarter, the S&P 500 declined 20% on a capital-appreciation basis (excluding dividends). In the second quarter, the index jumped back by a rounded 20%. Sector performance was abysmal across the board in the first quarter, while second-quarter sector performance showed some clear trends. The sector-performance map in the first half may hold some clues for second-half performance.",
            "tickers": [
                "TMUS",
                "PFE"
            ]
        },
        {
            "id": "3305_Analyst Report_1594192370000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2020-07-08T07:12:50Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 55.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "27364_Market Summary_1594166400000",
            "headHtml": "Market Digest: TMUS, PFE",
            "provider": "Argus Research",
            "reportDate": "2020-07-08T00:00:00Z",
            "reportTitle": "In the first quarter, the S&P 500 declined 20% on a capital-appreciation basis (excluding dividends). In the second quarter, the index jumped back by a rounded 20%. Sector performance was abysmal across the board in the first quarter, while second-quarter sector performance showed some clear trends. The sector-performance map in the first half may hold some clues for second-half performance.",
            "tickers": [
                "TMUS",
                "PFE"
            ]
        },
        {
            "id": "3305_Analyst Report_1594166400000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2020-07-08T00:00:00Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 55.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "27345_Market Outlook_1594020941000",
            "headHtml": "Daily Spotlight: Valuation Model Points to Stocks",
            "provider": "Argus Research",
            "reportDate": "2020-07-06T07:35:41Z",
            "reportTitle": "The asset-allocation portion of our bond/stock model favors stocks over bonds, despite the April-June rally in equities that has brought them back above fair value. With interest rates near all-time lows, bond yields are below fair value and bond prices are well above fair value. Our model takes into account current levels and forecasts of bond yields, inflation, stock prices, GDP and corporate earnings. Generally, the model has done a good job of highlighting value. For example, stocks were very attractive compared to bonds in the late 1970s, when benchmark Treasury rates were in the high teens before heading consistently lower over recent decades. The model indicated that stocks were at a sharp premium to fair value prior to the \"dot-com\" crash of 2001 and at a premium prior to the Great Recession in 2007-2009. Starting in 2009, the model favored stocks -- another good call, until 1Q20. The model is not perfect: it failed to call the pandemic. But it has responded to the changes in prices, rates and EPS forecasts, and it still suggests that stocks are the more attractively valued asset class with the S&P 500 priced 10% below its all-time high.",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "26850_Market Outlook_1588662868000",
            "headHtml": "Daily Spotlight: Stocks Back Near Fair Value",
            "provider": "Argus Research",
            "reportDate": "2020-05-05T07:14:28Z",
            "reportTitle": "Our Bond/Stock Model asset allocation favors stocks over bonds, despite the April rally in equities that brought them back to fair value.  Bonds remain below fair value, as interest rates are near all-time lows.  Our model takes into account current levels and forecasts of bond yields, inflation, stock prices, GDP and corporate earnings. The model generally has done a good job of highlighting value. For example, stocks were very attractive compared to bonds in the late 1970s, when benchmark Treasury rates were in the high teens before heading consistently lower over recent decades. The model indicated that stocks were at a sharp premium to fair value prior to the \"dot-com\" crash of 2001 and also at a premium prior to the Great Recession in 2007-2009.  Starting in 2009, the model favored stocks -- another good call, until 1Q20. The model is not perfect: it failed to call the pandemic. But it has responded to the changes in prices, rates and EPS forecasts, and it still suggests that stocks are the more attractively valued asset class, with the S&P 500 priced 18% below its all-time high.",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "26850_Market Outlook_1588636800000",
            "headHtml": "Daily Spotlight: Stocks Back Near Fair Value",
            "provider": "Argus Research",
            "reportDate": "2020-05-05T00:00:00Z",
            "reportTitle": "Our Bond/Stock Model asset allocation favors stocks over bonds, despite the April rally in equities that brought them back to fair value.  Bonds remain below fair value, as interest rates are near all-time lows.  Our model takes into account current levels and forecasts of bond yields, inflation, stock prices, GDP and corporate earnings. The model generally has done a good job of highlighting value. For example, stocks were very attractive compared to bonds in the late 1970s, when benchmark Treasury rates were in the high teens before heading consistently lower over recent decades. The model indicated that stocks were at a sharp premium to fair value prior to the \"dot-com\" crash of 2001 and also at a premium prior to the Great Recession in 2007-2009.  Starting in 2009, the model favored stocks -- another good call, until 1Q20. The model is not perfect: it failed to call the pandemic. But it has responded to the changes in prices, rates and EPS forecasts, and it still suggests that stocks are the more attractively valued asset class, with the S&P 500 priced 18% below its all-time high.",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "3305_Analyst Report_1588346235000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2020-05-01T15:17:15Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 55.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "26834_Market Update_1588346235000",
            "headHtml": "Market Update: AAPL, IQV, MSFT, NOK, PFE, TSLA, V, BA, IPG, LEN, RJF",
            "provider": "Argus Research",
            "reportDate": "2020-05-01T15:17:15Z",
            "reportTitle": "Stocks fell sharply on Friday morning after President Trump threatened to impose new tariffs on China for its handling of the coronavirus crisis. Manufacturing data was also weak. The Institute for Supply Management said that its factory index fell to 41.5 in April, the lowest level since April 2009, from 49.1 in March. Amazon shares fell more than 7% after the company warned that it could post a quarterly loss due to high expenses related to the pandemic. The S&P fell 2.8%, the Dow 2.4%, and the Nasdaq 3.1%. Crude oil rose slightly to $19 per barrel, while gold rose $14 to $1708 per ounce.",
            "tickers": [
                "MSFT",
                "IPG",
                "AAPL",
                "TSLA",
                "LEN",
                "V",
                "NOK",
                "PFE",
                "BA",
                "IQV",
                "RJF"
            ]
        },
        {
            "id": "26834_Market Update_1588291200000",
            "headHtml": "Market Update: AAPL, IQV, MSFT, NOK, PFE, TSLA, V, BA, IPG, LEN, RJF",
            "provider": "Argus Research",
            "reportDate": "2020-05-01T00:00:00Z",
            "reportTitle": "Stocks fell sharply on Friday morning after President Trump threatened to impose new tariffs on China for its handling of the coronavirus crisis. Manufacturing data was also weak. The Institute for Supply Management said that its factory index fell to 41.5 in April, the lowest level since April 2009, from 49.1 in March. Amazon shares fell more than 7% after the company warned that it could post a quarterly loss due to high expenses related to the pandemic. The S&P fell 2.8%, the Dow 2.4%, and the Nasdaq 3.1%. Crude oil rose slightly to $19 per barrel, while gold rose $14 to $1708 per ounce.",
            "tickers": [
                "MSFT",
                "IPG",
                "AAPL",
                "TSLA",
                "LEN",
                "V",
                "NOK",
                "PFE",
                "BA",
                "IQV",
                "RJF"
            ]
        },
        {
            "id": "3305_Analyst Report_1588291200000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2020-05-01T00:00:00Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 55.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        },
        {
            "id": "26748_Thematic Portfolio_1587540212000",
            "headHtml": "Argus High-Yield Portfolio",
            "provider": "Argus Research",
            "reportDate": "2020-04-22T07:23:32Z",
            "reportTitle": "Growth stocks may be outperforming value, again, in 2020. But in an environment of historically low interest rates (and with the coronavirus and economic shutdown seemingly poised to keep them low for a long time), many investors are still searching for high levels of income, which can often be found in value stocks. When we look for attractive high-yield/value stocks at Argus, we look for low valuations on metrics such as price/earnings, price/sales, price/book, yield and price/cash flow. But we also look for companies with clean balance sheets, high levels of profitability, cash-flow generation, and an experienced management teams. We seek to avoid companies in industries that are in secular decline, or with dividend yields that are so high that the payout is clearly at risk. To us, right now, that level is 8%-9%-plus. That said, many value companies may face a substantial near-term industry problem. Based on numerous requests from clients, we have designed a portfolio of companies followed by Argus Research analysts that are BUY-rated on a long-term (five-year) basis, have a Financial Strength rating of at least Medium, and have a yield of 3.5% or higher.",
            "tickers": [
                "AVGO",
                "CSCO",
                "CVX",
                "D",
                "PNC",
                "VZ",
                "JPM",
                "NVS",
                "SLF",
                "PFE",
                "TFC",
                "GLW",
                "T",
                "WFC",
                "STX",
                "WDC",
                "UPS",
                "SO",
                "CMI",
                "NUE",
                "PSA",
                "SNY",
                "MO",
                "KO",
                "BCE",
                "COP",
                "USB",
                "IP",
                "AZN",
                "PAYX",
                "GPC",
                "HPE",
                "MET",
                "PM",
                "ETN"
            ]
        },
        {
            "id": "26748_Thematic Portfolio_1587539312000",
            "headHtml": "Argus High-Yield Portfolio",
            "provider": "Argus Research",
            "reportDate": "2020-04-22T07:08:32Z",
            "reportTitle": "Growth stocks may be outperforming value, again, in 2020. But in an environment of historically low interest rates (and with the coronavirus and economic shutdown seemingly poised to keep them low for a long time), many investors are still searching for high levels of income, which can often be found in value stocks. When we look for attractive high-yield/value stocks at Argus, we look for low valuations on metrics such as price/earnings, price/sales, price/book, yield and price/cash flow. But we also look for companies with clean balance sheets, high levels of profitability, cash-flow generation, and an experienced management teams. We seek to avoid companies in industries that are in secular decline, or with dividend yields that are so high that the payout is clearly at risk. To us, right now, that level is 8%-9%-plus. That said, many value companies may face a substantial near-term industry problem. Based on numerous requests from clients, we have designed a portfolio of companies followed by Argus Research analysts that are BUY-rated on a long-term (five-year) basis, have a Financial Strength rating of at least Medium, and have a yield of 3.5% or higher.",
            "tickers": [
                "AVGO",
                "CSCO",
                "CVX",
                "D",
                "PNC",
                "VZ",
                "JPM",
                "NVS",
                "SLF",
                "PFE",
                "TFC",
                "GLW",
                "T",
                "WFC",
                "STX",
                "WDC",
                "UPS",
                "SO",
                "CMI",
                "NUE",
                "PSA",
                "SNY",
                "MO",
                "KO",
                "BCE",
                "COP",
                "USB",
                "IP",
                "AZN",
                "PAYX",
                "GPC",
                "HPE",
                "MET",
                "PM",
                "ETN"
            ]
        },
        {
            "id": "26748_Thematic Portfolio_1587513600000",
            "headHtml": "Argus High-Yield Portfolio",
            "provider": "Argus Research",
            "reportDate": "2020-04-22T00:00:00Z",
            "reportTitle": "Growth stocks may be outperforming value, again, in 2020. But in an environment of historically low interest rates (and with the coronavirus and economic shutdown seemingly poised to keep them low for a long time), many investors are still searching for high levels of income, which can often be found in value stocks. When we look for attractive high-yield/value stocks at Argus, we look for low valuations on metrics such as price/earnings, price/sales, price/book, yield and price/cash flow. But we also look for companies with clean balance sheets, high levels of profitability, cash-flow generation, and an experienced management teams. We seek to avoid companies in industries that are in secular decline, or with dividend yields that are so high that the payout is clearly at risk. To us, right now, that level is 8%-9%-plus. That said, many value companies may face a substantial near-term industry problem. Based on numerous requests from clients, we have designed a portfolio of companies followed by Argus Research analysts that are BUY-rated on a long-term (five-year) basis, have a Financial Strength rating of at least Medium, and have a yield of 3.5% or higher.",
            "tickers": [
                "AVGO",
                "CSCO",
                "CVX",
                "D",
                "PNC",
                "VZ",
                "JPM",
                "NVS",
                "SLF",
                "PFE",
                "TFC",
                "GLW",
                "T",
                "WFC",
                "STX",
                "WDC",
                "UPS",
                "SO",
                "CMI",
                "NUE",
                "PSA",
                "SNY",
                "MO",
                "KO",
                "BCE",
                "COP",
                "USB",
                "IP",
                "AZN",
                "PAYX",
                "GPC",
                "HPE",
                "MET",
                "PM",
                "ETN"
            ]
        },
        {
            "id": "3305_Analyst Report_1580390475000",
            "headHtml": "Analyst Report: Pfizer Inc.",
            "provider": "Argus Research",
            "reportDate": "2020-01-30T13:21:15Z",
            "reportTitle": "Pfizer is a leading global developer and manufacturer of pharmaceuticals and biotech drugs. Its products include oncology and immunology drugs, treatments for rare diseases, and vaccines.",
            "targetPrice": 55.0,
            "investmentRating": "Bullish",
            "tickers": [
                "PFE"
            ]
        }
    ],
    "sigDevs": [
        {
            "headline": "Haleon Announces Closing Of Secondary Global Offering By Pfizer",
            "date": "2024-03-21"
        }
    ],
    "secReports": [
        {
            "id": "0000078003-24-000082_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13D/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities",
            "filingDate": 1711065600000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001900304/000007800324000082/thumbnail.png",
            "formType": "SC 13D/A"
        },
        {
            "id": "0000078003-24-000080_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13D/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities",
            "filingDate": 1710806400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001900304/000007800324000080/thumbnail.png",
            "formType": "SC 13D/A"
        },
        {
            "id": "0000078003-24-000075_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13G/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities by passive investors and certain institutions",
            "filingDate": 1710460800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001827506/000007800324000075/thumbnail.png",
            "formType": "SC 13G/A"
        },
        {
            "id": "0000078003-24-000068_78003",
            "type": "Proxy Statements",
            "title": "DEF 14A : Proxy Statements",
            "description": "Definitive proxy statements",
            "filingDate": 1710374400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000007800324000068/thumbnail.png",
            "formType": "DEF 14A"
        },
        {
            "id": "0000078003-24-000070_78003",
            "type": "Proxy Statements",
            "title": "DEFA14A : Proxy Statements",
            "description": "Definitive additional proxy soliciting materials including Rule 14(a)(12) material. Note: Submission type DEFA14A can be filed as part of Form 8-K. For filers subject to 8-K filing requirements we recommend the use of the 8-K combined form type as the easiest method for fulfilling your filing requirement for both forms",
            "filingDate": 1710374400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000007800324000070/thumbnail.png",
            "formType": "DEFA14A"
        },
        {
            "id": "0000078003-24-000072_78003",
            "type": "Annual Report to Shareholders",
            "title": "ARS : Annual Report to Shareholders",
            "description": "Annual report to security holders",
            "filingDate": 1710374400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000007800324000072/thumbnail.png",
            "formType": "ARS"
        },
        {
            "id": "0000078003-24-000052_78003",
            "type": "Offering Registrations",
            "title": "S-8 : Offering Registrations",
            "description": "Initial registration statement for securities to be offered to employees pursuant to employee benefit plans",
            "filingDate": 1708646400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000007800324000052/thumbnail.png",
            "formType": "S-8"
        },
        {
            "id": "0000078003-24-000039_78003",
            "type": "Periodic Financial Reports",
            "title": "10-K : Periodic Financial Reports",
            "description": "Annual report pursuant to Section 13 and 15(d)",
            "filingDate": 1708560000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000007800324000039/thumbnail.png",
            "formType": "10-K"
        },
        {
            "id": "0000078003-24-000035_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13G/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities by passive investors and certain institutions",
            "filingDate": 1707868800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001828522/000007800324000035/thumbnail.png",
            "formType": "SC 13G/A"
        },
        {
            "id": "0000078003-24-000033_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13G/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities by passive investors and certain institutions",
            "filingDate": 1707868800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001672619/000007800324000033/thumbnail.png",
            "formType": "SC 13G/A"
        },
        {
            "id": "0000078003-24-000031_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13G/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities by passive investors and certain institutions",
            "filingDate": 1707868800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001880438/000007800324000031/thumbnail.png",
            "formType": "SC 13G/A"
        },
        {
            "id": "0000078003-24-000027_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13G/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities by passive investors and certain institutions",
            "filingDate": 1707868800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001744659/000007800324000027/thumbnail.png",
            "formType": "SC 13G/A"
        },
        {
            "id": "0000078003-24-000029_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13G/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities by passive investors and certain institutions",
            "filingDate": 1707868800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001627281/000007800324000029/thumbnail.png",
            "formType": "SC 13G/A"
        },
        {
            "id": "0000078003-24-000017_78003",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1706572800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000007800324000017/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000078003-24-000015_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13D/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities",
            "filingDate": 1706486400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001832168/000007800324000015/thumbnail.png",
            "formType": "SC 13D/A"
        },
        {
            "id": "0000078003-24-000010_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13D/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities",
            "filingDate": 1705622400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001900304/000007800324000010/thumbnail.png",
            "formType": "SC 13D/A"
        },
        {
            "id": "0000078003-24-000004_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13D/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities",
            "filingDate": 1704844800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001832168/000007800324000004/thumbnail.png",
            "formType": "SC 13D/A"
        },
        {
            "id": "0000078003-24-000006_78003",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1704844800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000007800324000006/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-23-294930_78003",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1702512000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000119312523294930/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-23-295562_78003",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K/A : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1702512000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000119312523295562/thumbnail.png",
            "formType": "8-K/A"
        },
        {
            "id": "0000078003-23-000120_78003",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1702425600000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000007800323000120/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000078003-23-000118_78003",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1702339200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000007800323000118/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000078003-23-000115_78003",
            "type": "Periodic Financial Reports",
            "title": "10-Q : Periodic Financial Reports",
            "description": "Quarterly report pursuant to Section 13 or 15(d)",
            "filingDate": 1699401600000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000007800323000115/thumbnail.png",
            "formType": "10-Q"
        },
        {
            "id": "0000078003-23-000111_78003",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1698710400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000007800323000111/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000078003-23-000109_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13G : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities by passive investors and certain institutions",
            "filingDate": 1698364800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001827506/000007800323000109/thumbnail.png",
            "formType": "SC 13G"
        },
        {
            "id": "0000078003-23-000104_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13D/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities",
            "filingDate": 1698192000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001737287/000007800323000104/thumbnail.png",
            "formType": "SC 13D/A"
        },
        {
            "id": "0000078003-23-000102_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13D/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities",
            "filingDate": 1697587200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001805387/000007800323000102/thumbnail.png",
            "formType": "SC 13D/A"
        },
        {
            "id": "0000078003-23-000099_78003",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1697155200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000007800323000099/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000078003-23-000096_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13D/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities",
            "filingDate": 1696896000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001900304/000007800323000096/thumbnail.png",
            "formType": "SC 13D/A"
        },
        {
            "id": "0000078003-23-000093_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13D/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities",
            "filingDate": 1694390400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001900304/000007800323000093/thumbnail.png",
            "formType": "SC 13D/A"
        },
        {
            "id": "0000078003-23-000088_78003",
            "type": "Periodic Financial Reports",
            "title": "10-Q : Periodic Financial Reports",
            "description": "Quarterly report pursuant to Section 13 or 15(d)",
            "filingDate": 1691539200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000007800323000088/thumbnail.png",
            "formType": "10-Q"
        },
        {
            "id": "0000078003-23-000085_78003",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1690848000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000007800323000085/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000078003-23-000081_78003",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1690416000000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000007800323000081/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000078003-23-000079_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13G : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities by passive investors and certain institutions",
            "filingDate": 1688947200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001619856/000007800323000079/thumbnail.png",
            "formType": "SC 13G"
        },
        {
            "id": "0001193125-23-149364_78003",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1684454400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000119312523149364/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001193125-23-144089_78003",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1684108800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000119312523144089/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001628280-23-017196_78003",
            "type": "Periodic Financial Reports",
            "title": "10-Q : Periodic Financial Reports",
            "description": "Quarterly report pursuant to Section 13 or 15(d)",
            "filingDate": 1683676800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000162828023017196/thumbnail.png",
            "formType": "10-Q"
        },
        {
            "id": "0001628280-23-014759_78003",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1682985600000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000162828023014759/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0001628280-23-014368_78003",
            "type": "Corporate Changes & Voting Matters",
            "title": "8-K : Corporate Changes & Voting Matters",
            "description": "Current report filing",
            "filingDate": 1682899200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000162828023014368/thumbnail.png",
            "formType": "8-K"
        },
        {
            "id": "0000078003-23-000068_78003",
            "type": "Proxy Statements",
            "title": "DEFA14A : Proxy Statements",
            "description": "Definitive additional proxy soliciting materials including Rule 14(a)(12) material. Note: Submission type DEFA14A can be filed as part of Form 8-K. For filers subject to 8-K filing requirements we recommend the use of the 8-K combined form type as the easiest method for fulfilling your filing requirement for both forms",
            "filingDate": 1681084800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000007800323000068/thumbnail.png",
            "formType": "DEFA14A"
        },
        {
            "id": "0000078003-23-000067_78003",
            "type": "Proxy Statements",
            "title": "DEFA14A : Proxy Statements",
            "description": "Definitive additional proxy soliciting materials including Rule 14(a)(12) material. Note: Submission type DEFA14A can be filed as part of Form 8-K. For filers subject to 8-K filing requirements we recommend the use of the 8-K combined form type as the easiest method for fulfilling your filing requirement for both forms",
            "filingDate": 1681084800000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000007800323000067/thumbnail.png",
            "formType": "DEFA14A"
        },
        {
            "id": "0000078003-23-000060_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13G : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities by passive investors and certain institutions",
            "filingDate": 1680134400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001855644/000007800323000060/thumbnail.png",
            "formType": "SC 13G"
        },
        {
            "id": "0000078003-23-000061_78003",
            "type": "Proxy Statements",
            "title": "DEFA14A : Proxy Statements",
            "description": "Definitive additional proxy soliciting materials including Rule 14(a)(12) material. Note: Submission type DEFA14A can be filed as part of Form 8-K. For filers subject to 8-K filing requirements we recommend the use of the 8-K combined form type as the easiest method for fulfilling your filing requirement for both forms",
            "filingDate": 1680134400000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0000078003/000007800323000061/thumbnail.png",
            "formType": "DEFA14A"
        },
        {
            "id": "0000078003-23-000056_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13D/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities",
            "filingDate": 1679875200000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001832168/000007800323000056/thumbnail.png",
            "formType": "SC 13D/A"
        },
        {
            "id": "0000078003-23-000053_78003",
            "type": "Tender Offer/Acquisition Reports",
            "title": "SC 13G/A : Tender Offer/Acquisition Reports",
            "description": "Schedule filed to report acquisition of beneficial ownership of 5% or more of a class of equity securities by passive investors and certain institutions",
            "filingDate": 1679529600000,
            "snapshotUrl": "https://cdn.yahoofinance.com/prod/sec-reports-thumbnails/0001782223/000007800323000053/thumbnail.png",
            "formType": "SC 13G/A"
        }
    ]
}