{
    "4071397": {
        "id": 4071397,
        "significance": "1",
        "headline": "Simon Property Group Reports Second Quarter 2019 FFO Per Share Of $2.99",
        "description": "July 31 (Reuters) - Simon Property Group Inc <SPG.N>::GROUP REPORTS SECOND QUARTER 2019 RESULTS AND RAISES QUARTERLY DIVIDEND.Q2 FFO PER SHARE $2.99.SEES FY 2019 FFO PER SHARE $12.30 TO $12.40.GROUP INC - BOARD OF DIRECTORS DECLARED A QUARTERLY COMMON STOCK DIVIDEND OF $2.10 PER SHARE..",
        "parentTopics": "Corporate Guidance"
    },
    "4072651": {
        "id": 4072651,
        "significance": "1",
        "headline": "Spark Power Expands Western Canada Footprint With Addition Of 3-Phase Electrical To Spark Power Group Of Companies",
        "description": "Aug 1 (Reuters) - Spark Power Group Inc <SPG.TO>::SPARK POWER EXPANDS WESTERN CANADA FOOTPRINT WITH THE ADDITION OF 3-PHASE ELECTRICAL TO THE SPARK POWER GROUP OF COMPANIES.SPARK POWER GROUP INC - ACQUISITION OF 3-PHASE ELECTRICAL LTD., BY WAY OF A SHARE PRICE AGREEMENT.SPARK POWER GROUP INC - 3-PHASE ELECTRICAL LTD WILL BECOME A WHOLLY-OWNED SUBSIDIARY OF SPARK POWER, OPERATING WITHIN ITS TECHNICAL SERVICES GROUP.SPARK POWER GROUP INC - WHILE TERMS OF DEAL ARE CONFIDENTIAL, ACQUISITION IS EXPECTED TO BE IMMEDIATELY ACCRETIVE TO EARNINGS.SPARK POWER GROUP INC - IN NEAR TERM, 3-PHASE WILL CONTINUE TO OPERATE UNDER ITS BRAND NAME.",
        "parentTopics": "Products"
    },
    "4076952": {
        "id": 4076952,
        "significance": "1",
        "headline": "Spark Power Provides Further Information Respecting The Acquisition Of 3-Phase Electrical Ltd",
        "description": "Aug 7 (Reuters) - Spark Power Group Inc <SPG.TO>::SPARK POWER PROVIDES FURTHER INFORMATION RESPECTING THE ACQUISITION OF 3-PHASE ELECTRICAL LTD. AND ANNOUNCES THE RESIGNATION OF DON MORRISON AS A DIRECTOR OF SPARK POWER GROUP INC..CASH PORTION OF PURCHASE PRICE WAS FUNDED FROM COMPANY'S ACQUISITION FACILITY.TRANSACTION IS EXPECTED TO BE IMMEDIATELY ACCRETIVE (BEFORE POTENTIAL SYNERGIES) TO SPARK POWER'S REVENUE AND EARNINGS.",
        "parentTopics": "Corporate Guidance"
    },
    "4116000": {
        "id": 4116000,
        "significance": "1",
        "headline": "Simon Property Group Reports Q3 Ffo Per Share $3.05",
        "description": "Oct 30 (Reuters) - Simon Property Group Inc <SPG.N>::SIMON PROPERTY GROUP REPORTS THIRD QUARTER 2019 RESULTS.Q3 FFO PER SHARE $3.05.U.S. MALLS AND PREMIUM OUTLETS OCCUPANCY WAS 94.7% AT SEPTEMBER 30, 2019.ESTIMATES 2019 COMPARABLE FFO TO BE WITHIN A RANGE OF $12.33 TO $12.38 PER DILUTED SHARE.SEES 2019 NET INCOME TO BE WITHIN A RANGE OF $6.76 TO $6.81 PER DILUTED SHARE.CURRENTLY ESTIMATES 2019 FFO TO BE WITHIN A RANGE OF $12.00 TO $12.05 PER DILUTED SHARE.Q3 FFO PER SHARE VIEW $3.06 -- REFINITIV IBES DATA.FY2019 FFO PER SHARE VIEW $12.05 -- REFINITIV IBES DATA.",
        "parentTopics": "Corporate Guidance"
    },
    "4161125": {
        "id": 4161125,
        "significance": "1",
        "headline": "Simon Property Group Reports Fourth Quarter And Full Year 2019 Results",
        "description": "Feb 4 (Reuters) - Simon Property Group Inc <SPG.N>::SIMON PROPERTY GROUP REPORTS FOURTH QUARTER AND FULL YEAR 2019 RESULTS.Q4 NON-GAAP FFO PER SHARE $3.29.Q4 FFO PER SHARE $2.96.SEES FY 2020 FFO PER SHARE $12.25 TO $12.40.ESTIMATES NET INCOME TO BE WITHIN A RANGE OF $7.15 TO $7.30 PER DILUTED SHARE FOR YEAR ENDING DECEMBER 31, 2020.U.S. MALLS AND PREMIUM OUTLETS OCCUPANCY WAS 95.1% AT DECEMBER 31, 2019.Q4 FFO PER SHARE VIEW $2.95 -- REFINITIV IBES DATA.FY2019 FFO PER SHARE VIEW $12.04 -- REFINITIV IBES DATA.FY2019 EARNINGS PER SHARE VIEW $6.70 -- REFINITIV IBES DATA.CO DECLARED A COMMON STOCK DIVIDEND OF $2.10 PER SHARE FOR Q1 OF 2020.SIMON'S BOARD DECLARED A COMMON STOCK DIVIDEND OF $2.10 PER SHARE FOR Q1 OF 2020.",
        "parentTopics": "Corporate Guidance"
    },
    "4164085": {
        "id": 4164085,
        "significance": "1",
        "headline": "Simon Property Group To Acquire Taubman Centers",
        "description": "Feb 10 (Reuters) - Taubman Centers Inc <TCO.N>::SIMON PROPERTY GROUP TO ACQUIRE TAUBMAN CENTERS, INC..TAUBMAN CENTERS INC - TAUBMAN SHAREHOLDERS TO RECEIVE $52.50 PER SHARE IN CASH.TAUBMAN CENTERS INC - TRANSACTION EXPECTED TO BE IMMEDIATELY ACCRETIVE TO SIMON'S FUNDS FROM OPERATIONS.TAUBMAN CENTERS INC - SIMON EXPECTS TO FUND TOTAL REQUIRED CASH CONSIDERATION OF APPROXIMATELY $3.6 BILLION WITH EXISTING LIQUIDITY.TAUBMAN CENTERS INC - TAUBMAN FAMILY WILL SELL ABOUT ONE-THIRD OF ITS OWNERSHIP INTEREST AT TRANSACTION PRICE AND REMAIN A 20% PARTNER IN TRG.TAUBMAN CENTERS - DEAL UNANIMOUSLY RECOMMENDED BY A SPECIAL COMMITTEE OF INDEPENDENT DIRECTORS OF CO AND APPROVED UNANIMOUSLY BY BOARDS OF BOTH COS.TAUBMAN CENTERS INC - SIMON, THROUGH ITS OPERATING PARTNERSHIP, SIMON PROPERTY GROUP, L.P., WILL ACQUIRE ALL OF TAUBMAN COMMON STOCK.TAUBMAN CENTERS INC - SIMON WILL ACQUIRE AN 80% OWNERSHIP INTEREST IN TAUBMAN REALTY GROUP LIMITED PARTNERSHIP.TAUBMAN CENTERS - DEAL EXPECTED TO BE AT LEAST 3% ACCRETIVE TO SIMON'S FFO PER SHARE ON ANNUALIZED BASIS, BEGINNING IMMEDIATELY UPON DEAL CONSUMMATION.TAUBMAN CENTERS - TAUBMAN FAMILY, WHICH REPRESENTS ABOUT 29% OF OUTSTANDING TAUBMAN VOTING STOCK, HAS AGREED TO VOTE IN FAVOR OF DEAL.",
        "parentTopics": "Ownership\\/Control"
    },
    "4216440": {
        "id": 4216440,
        "significance": "1",
        "headline": "Simon Property Group Reports Q1 FFO Per Share $2.78",
        "description": "May 11 (Reuters) - Simon Property Group Inc <SPG.N>::GROUP REPORTS FIRST QUARTER 2020 RESULTS AND PROVIDES BUSINESS UPDATE.Q1 FFO PER SHARE $2.78.GROUP INC QTRLY NET INCOME ATTRIBUTABLE TO COMMON STOCKHOLDERS WAS $1.43 PER DILUTED SHARE.WITHDRAWING FULL-YEAR 2020 GUIDANCE FOR ESTIMATED NET INCOME ATTRIBUTABLE TO COMMON STOCKHOLDERS PER DILUTED SHARE.WITHDRAWING FULL-YEAR 2020 GUIDANCE FOR ESTIMATED FFO PER DILUTED SHARE, COMPARABLE PROPERTY NOI GROWTH.GROUP - AS OF MAY 11, REOPENED 77 OF U.S. RETAIL PROPERTIES IN MARKETS WHERE LOCAL AND STATE ORDERS HAVE BEEN LIFTED.GROUP INC - AS OF MAY 11, TWELVE OF SIMON'S DESIGNER AND INTERNATIONAL PREMIUM OUTLETS PROPERTIES HAVE REOPENED.GROUP INC - HAS SUSPENDED OR ELIMINATED MORE THAN $1.0 BILLION OF CAPITAL FOR NEW AND REDEVELOPMENT PROJECTS.GROUP - U.S. MALLS AND PREMIUM OUTLETS OCCUPANCY WAS 94.0% AT MARCH 31, 2020 COMPARED TO 95.1% AT MARCH 31, 2019 REPORTED LAST YEAR.GROUP - HAS SUSPENDED OR ELIMINATED MORE THAN $1.0 BILLION OF CAPITAL FOR NEW AND REDEVELOPMENT PROJECTS.GROUP INC - AS OF MARCH 31, 2020, SIMON HAD APPROXIMATELY $8.7 BILLION OF LIQUIDITY CONSISTING OF $4.1 BILLION OF CASH ON HAND.GROUP INC - INTENDS TO MAINTAIN A COMMON STOCK DIVIDEND PAID IN CASH AND EXPECTS TO DISTRIBUTE AT LEAST 100% OF ITS REIT TAXABLE INCOME.SHARE OF REMAINING REQUIRED CASH FUNDING FOR NEW & REDEVELOPMENT PROJECTS SCHEDULED TO BE COMPLETED IN 2020 OR 2021 IS ABOUT $160 MILLION.",
        "parentTopics": "Corporate Guidance"
    },
    "4259058": {
        "id": 4259058,
        "significance": "1",
        "headline": "Simon Property Group Reports Q2 FFO Per Share $2.12",
        "description": "Aug 10 (Reuters) - Simon Property Group Inc <SPG.N>::GROUP REPORTS SECOND QUARTER 2020 RESULTS.Q2 FFO PER SHARE $2.12.GROUP INC - LOST NEARLY 10,500 SHOPPING DAYS IN U.S. PORTFOLIO IN Q2.GROUP INC - HAVE GENERALLY BEEN ENCOURAGED BY SHOPPER RESPONSE, PARTICULARLY IN CERTAIN LOCATIONS, AFTER RE-OPENING.GROUP INC - QTRLY FUNDS FROM OPERATIONS WERE $2.12 PER DILUTED SHARE.GROUP INC - AS OF AUGUST 7, 91% OF TENANTS ACROSS COMPANY'S U.S. RETAIL PROPERTIES WERE OPEN AND OPERATING.GROUP - MORE THAN HALF OF REMAINING UNOPENED TENANTS ARE CLOSED BECAUSE OF GOVERNMENTAL ORDERS LIMITING OR PROHIBITING THEIR OPERATIONS.GROUP INC - QTRLY U.S. MALLS AND PREMIUM OUTLETS OCCUPANCY WAS 92.9% AT JUNE 30, 2020.GROUP INC- QTRLY COMPARABLE PROPERTY NET OPERATING INCOME DECLINED 18.5% AND PORTFOLIO NOI DECLINED 21.0%.",
        "parentTopics": "Corporate Guidance"
    },
    "4259183": {
        "id": 4259183,
        "significance": "1",
        "headline": "Simon Property Group CEO Says There Will Be Some Level Abatements And Collection Issues For The Rest Of 2020",
        "description": "Aug 10 (Reuters) - Simon Property Group Inc <SPG.N>::SIMON PROPERTY GROUP -  TENANT BANKRUPTCIES AND LOWER SPECIALTY LEASING DURING Q2 DUE TO COVID-19 IMPACTED OCCUPANCY ABOUT 60 BASIS POINTS- CONF CALL.SIMON PROPERTY GROUP - CURRENTLY 91% OF TENANTS OR NEARLY 23,000 TENANTS ACROSS U.S. PORTFOLIO ARE OPEN AND OPERATING.SIMON PROPERTY GROUP - WE'RE ALL OPEN, EXCEPT FOR THE 7 RECENT CLOSINGS IN CALIFORNIA- CEO.SIMON PROPERTY GROUP - SPARC GROUP'S INVESTMENTS IN BROOKS BROTHERS AND LUCKY BRAND JEANS ARE EXPECTED TO GENERATE POSITIVE EBITDA AFTER INTEGRATION.SIMON PROPERTY GROUP - EXPECT ANY EQUITY INVESTMENTS BY SPARC TO BE RETURNED WITHIN A YEAR AFTER INTEGRATION OF OPERATIONS.SIMON PROPERTY GROUP CEO - BUYING INTO BROOKS BROTHERS AND LUCKY BECAUSE \"WE THINK WE CAN MAKE MONEY\".SIMON PROPERTY GROUP- CEO SAYS WILL NOT RESPOND TO MARKET RUMORS OR SPECULATION ON TALKS WITH AMAZON TO CONVERT VACANT STORES INTO FULFILLMENT CENTERS.SIMON PROPERTY GROUP CEO- WILL STILL DEAL WITH ISSUES GOING FORWARD, THERE'LL BE SOME LEVEL ABATEMENTS AND COLLECTION ISSUES FOR THE REST OF 2020.",
        "parentTopics": "Corporate Guidance"
    },
    "4301714": {
        "id": 4301714,
        "significance": "1",
        "headline": "Simon Property Group Reports Q3 FFO PER SHARE $2.05",
        "description": "Nov 9 (Reuters) - Simon Property Group Inc <SPG.N>::QTRLY TOTAL REVENUE $1.06 BILLION VERSUS $1.42 BILLION .SIMON PROPERTY GROUP REPORTS THIRD QUARTER 2020 RESULTS.Q3 FFO PER SHARE $2.05.QTRLY EARNINGS PER SHARE $0.48.U.S. MALLS AND PREMIUM OUTLETS OCCUPANCY WAS 91.4% AT SEPTEMBER 30, 2020 COMPARED  TO 94.7% AT SEPTEMBER 30, 2019.SIMON PROPERTY GROUP - PORTFOLIO NET OPERATING INCOME FOR QUARTER ENDED SEPTEMBER 30, 2020 DECLINED 22.4% AND COMPARABLE PROPERTY NOI DECLINED 24.4%.Q3 FFO PER SHARE VIEW $2.28 -- REFINITIV IBES DATA.",
        "parentTopics": "Corporate Guidance"
    },
    "4301675": {
        "id": 4301675,
        "significance": "1",
        "headline": "Simon Property Group Reports Q3 FFO Per Share Of $2.05",
        "description": "Nov 9 (Reuters) - Simon Property Group Inc <SPG.N>::SIMON PROPERTY GROUP REPORTS THIRD QUARTER 2020 RESULTS.Q3 FFO PER SHARE $2.05.QTRLY EARNINGS PER SHARE $0.48.U.S. MALLS AND PREMIUM OUTLETS OCCUPANCY WAS 91.4% AT SEPTEMBER 30, 2020 COMPARED  TO 94.7% AT SEPTEMBER 30, 2019.SIMON PROPERTY GROUP - PORTFOLIO NET OPERATING INCOME FOR QUARTER ENDED SEPTEMBER 30, 2020 DECLINED 22.4% AND COMPARABLE PROPERTY NOI DECLINED 24.4%.Q3 FFO PER SHARE VIEW $2.28 -- REFINITIV IBES DATA.QTRLY TOTAL REVENUE $696.2 MILLION VERSUS $845.8 MILLION.",
        "parentTopics": "Corporate Guidance"
    },
    "4339680": {
        "id": 4339680,
        "significance": "1",
        "headline": "Simon Property Group Sees FY 2021 FFO Per Share $9.50 To $9.75",
        "description": "Feb 8 (Reuters) - Simon Property Group Inc <SPG.N>::SIMON PROPERTY GROUP REPORTS FOURTH QUARTER AND FULL YEAR 2020 RESULTS.SEES FY 2021 FFO PER SHARE $9.50 TO $9.75.Q4 FFO PER SHARE $2.17.ESTIMATES NET INCOME TO BE WITHIN A RANGE OF $4.60 TO $4.85 PER DILUTED SHARE FOR 2021.FFO WILL BE WITHIN A RANGE OF $9.50 TO $9.75 PER DILUTED SHARE FOR 2021.U.S. MALLS AND PREMIUM OUTLETS OCCUPANCY WAS 91.3% AT DECEMBER 31, 2020.EXPECT GROWTH IN EARNINGS AND CASH FLOW IN 2021.QTRLY NET INCOME ATTRIBUTABLE TO COMMON STOCKHOLDERS WAS $0.86 PER DILUTED SHARE.FY2021 FFO PER SHARE VIEW $9.55 -- REFINITIV IBES DATA.Q1 FFO PER SHARE VIEW $2.29 -- REFINITIV IBES DATA.Q4 FFO PER SHARE VIEW $2.22 -- REFINITIV IBES DATA.SIMON PROPERTY GROUP - AS OF FEB 5,, HAS COLLECTED FROM ITS U.S. RETAIL PORTFOLIO, 90% OF NET BILLED RENTS FOR SECOND, THIRD, FOURTH QTRS, COMBINED.",
        "parentTopics": "Corporate Guidance"
    },
    "4387564": {
        "id": 4387564,
        "significance": "1",
        "headline": "Simon Property Sees FY FFO Per Share $9.70 To $9.80",
        "description": "Simon Property Group Inc <SPG.N>::SIMON PROPERTY GROUP REPORTS FIRST QUARTER 2021 RESULTS AND RAISES FULL YEAR 2021 GUIDANCE.SEES FY FFO PER SHARE $9.70 TO $9.80.Q1 FFO PER SHARE $2.48.QTRLY NET INCOME ATTRIBUTABLE TO COMMON STOCKHOLDERS WAS $1.36 PER DILUTED SHARE.U.S. MALLS AND PREMIUM OUTLETS OPERATING STATISTICS OCCUPANCY WAS 90.8% AT MARCH 31, 2021.WILL DECLARE A COMMON STOCK CASH DIVIDEND FOR Q2 OF 2021 ON OR BEFORE JUNE 30, 2021.SIMON PROPERTY- COMPANY CURRENTLY ESTIMATES NET INCOME TO BE WITHIN A RANGE OF $4.47 TO $4.57 PER DILUTED SHARE FOR YEAR ENDING DECEMBER 31, 2021.",
        "parentTopics": "Corporate Guidance"
    },
    "4423680": {
        "id": 4423680,
        "significance": "1",
        "headline": "Simon Property Group Raises Quarterly Dividend",
        "description": "Aug 2 (Reuters) - Simon Property Group Inc <SPG.N>::SIMON PROPERTY GROUP REPORTS SECOND QUARTER 2021 RESULTS AND INCREASES FULL YEAR 2021 GUIDANCE AND RAISES QUARTERLY DIVIDEND.SEES FY FFO PER SHARE $10.70 TO $10.80.Q2 FFO PER SHARE $3.24.U.S. MALLS AND PREMIUM OUTLETS OCCUPANCY WAS 91.8% AT JUNE 30, 2021.CURRENTLY ESTIMATES 2021 NET INCOME TO BE WITHIN A RANGE OF $5.47 TO $5.57 PER DILUTED SHARE.DECLARED A QUARTERLY COMMON STOCK CASH DIVIDEND OF $1.50 FOR Q3 A 7.1% INCREASE COMPARED TO Q2 DIVIDEND.Q2 FFO PER SHARE VIEW $2.38 -- REFINITIV IBES DATA.FY2021 FFO PER SHARE VIEW $9.86 -- REFINITIV IBES DATA.",
        "parentTopics": "Performance"
    },
    "4463326": {
        "id": 4463326,
        "significance": "1",
        "headline": "Simon Property Group Posts Quarterly EPS Of $2.07",
        "description": "Nov 1 (Reuters) - Simon Property Group Inc <SPG.N>::SIMON PROPERTY GROUP REPORTS THIRD QUARTER 2021 RESULTS; INCREASES FULL YEAR 2021 GUIDANCE AND RAISES QUARTERLY DIVIDEND.SEES FY FFO PER SHARE $11.55 TO $11.65.ONCE AGAIN INCREASING FULL-YEAR 2021 GUIDANCE AND RAISING OUR QUARTERLY DIVIDEND.QTRLY EARNINGS PER SHARE  $2.07.QTRLY FFO WAS $1.176 BILLION, OR $3.13 PER DILUTED SHARE, VERSUS $723.2 MILLION, OR $2.05 PER DILUTED SHARE, IN PRIOR YEAR PERIOD.CURRENTLY ESTIMATES NET INCOME TO BE WITHIN A RANGE OF $6.61 TO $6.71 PER DILUTED SHARE IN 2021.FY2021 FFO PER SHARE VIEW $10.93 -- REFINITIV IBES DATA.Q3 FFO PER SHARE VIEW $2.52 -- REFINITIV IBES DATA.Q3 EARNINGS PER SHARE VIEW $1.09 -- REFINITIV IBES DATA.U.S. MALLS AND PREMIUM OUTLETS OCCUPANCY WAS 92.8% AT SEPTEMBER 30, 2021.",
        "parentTopics": "Corporate Guidance"
    },
    "4502249": {
        "id": 4502249,
        "significance": "1",
        "headline": "Simon Property Sees FY FFO Per Share $11.50 To $11.70",
        "description": "Feb 7 (Reuters) - Simon Property Group Inc <SPG.N>::SIMON PROPERTY GROUP REPORTS FOURTH QUARTER AND FULL YEAR 2021 RESULTS.SEES FY FFO PER SHARE $11.50 TO $11.70.Q4 FFO PER SHARE $3.09.SIMON PROPERTY - SEES 2022 NET INCOME TO BE WITHIN A RANGE OF $5.90 TO $6.10 PER SHARE AND FFO WITHIN A RANGE OF $11.50 TO $11.70 PER SHARE.U.S. MALLS AND PREMIUM OUTLETS OCCUPANCY WAS 93.4% AT DECEMBER 31, 2021.Q4 EARNINGS PER SHARE VIEW $1.44, REVENUE VIEW $1.24 BILLION -- REFINITIV IBES DATA.FY2022 EARNINGS PER SHARE VIEW $6.10 -- REFINITIV IBES DATA.",
        "parentTopics": "Corporate Guidance"
    },
    "4575435": {
        "id": 4575435,
        "significance": "1",
        "headline": "Simon Property Sees FY Non-GAAP FFO Per Share $11.70 To $11.77",
        "description": "Aug 1 (Reuters) - Simon Property Group Inc <SPG.N>::SIMON® REPORTS SECOND QUARTER 2022 RESULTS AND INCREASES FULL YEAR 2022 GUIDANCE AND RAISES QUARTERLY DIVIDEND.Q2 FFO PER SHARE $2.91.SEES FY NON-GAAP FFO PER SHARE $11.70 TO $11.77.QTRLY COMPARABLE FFO WAS $1.111 BILLION, OR $2.96 PER DILUTED SHARE.QTRLY U.S. MALLS AND PREMIUM OUTLETS OCCUPANCY WAS 93.9% AT JUNE 30, 2022, COMPARED TO 91.8% AT JUNE 30, 2021.SEES FY 2022 EARNINGS PER SHARE $5.93 TO $6.00.Q2 FFO PER SHARE VIEW $2.90 -- REFINITIV IBES DATA.FY2022 FFO PER SHARE VIEW $11.71 -- REFINITIV IBES DATA.",
        "parentTopics": "Corporate Guidance"
    },
    "4615838": {
        "id": 4615838,
        "significance": "1",
        "headline": "Simon Reports Q3 2022 Results And Increases Full Year 2022 Guidance And Raises Quarterly Dividend",
        "description": "Nov 1 (Reuters) - Simon Property Group Inc <SPG.N>::SIMON® REPORTS THIRD QUARTER 2022 RESULTS AND INCREASES FULL YEAR 2022 GUIDANCE AND RAISES QUARTERLY DIVIDEND.SIMON PROPERTY SEES FY NON-GAAP FFO PER SHARE $11.83 TO $11.88.SIMON PROPERTY Q3 NON-GAAP FFO PER SHARE $2.97.ESTIMATES FY NET INCOME TO BE WITHIN A RANGE OF $6.16 TO $6.21 PER DILUTED SHARE.U.S. MALLS AND PREMIUM OUTLETS OCCUPANCY WAS 94.5% AT SEPTEMBER 30, 2022.SEES COMPARABLE FFO TO BE WITHIN A RANGE OF $11.83 TO $11.88 PER DILUTED SHARE FOR YEAR ENDING DECEMBER 31, 2022.Q3 EARNINGS PER SHARE VIEW $1.44, REVENUE VIEW $1.23 BILLION -- REFINITIV IBES DATA.FY2022 EARNINGS PER SHARE VIEW $5.53, REVENUE VIEW $4.85 BILLION -- REFINITIV IBES DATA.",
        "parentTopics": "Performance"
    },
    "4655160": {
        "id": 4655160,
        "significance": "1",
        "headline": "Simon Reports Fourth Quarter And Full Year 2022 Results",
        "description": "Feb 6 (Reuters) - Simon Property Group Inc <SPG.N>::SIMON® REPORTS FOURTH QUARTER AND FULL YEAR 2022 RESULTS.QTRLY EPS $2.06.CURRENTLY ESTIMATES NET INCOME IN 2023 TO BE WITHIN A RANGE OF $6.35 TO $6.60 PER DILUTED SHARE.SEES COMPARABLE FFO TO BE WITHIN A RANGE OF $11.70 TO $11.95 PER DILUTED SHARE FOR YEAR ENDING DECEMBER 31, 2023.Q4 EARNINGS PER SHARE VIEW $1.70, REVENUE VIEW $1.27 BILLION -- REFINITIV IBES DATA.SEES 2023 NET INCOME ATTRIBUTABLE TO COMMON STOCKHOLDERS PER DILUTED SHARE BETWEEN $6.35 - $6.60.FY2023 EARNINGS PER SHARE VIEW $6.20, REVENUE VIEW $4.96 BILLION -- REFINITIV IBES DATA.",
        "parentTopics": "Corporate Guidance"
    },
    "4701013": {
        "id": 4701013,
        "significance": "1",
        "headline": "Simon Reports First Quarter 2023 Results",
        "description": "May 2 (Reuters) - Simon Property Group Inc <SPG.N>::SIMON® REPORTS FIRST QUARTER 2023 RESULTS AND INCREASES FULL YEAR 2023 GUIDANCE AND RAISES QUARTERLY DIVIDEND.QTRLY FUNDS FROM OPERATIONS $2.74 PER DILUTED SHARE.QTRLY NET INCOME ATTRIBUTABLE TO COMMON STOCKHOLDERS WAS $1.38 PER DILUTED SHARE.CURRENTLY ESTIMATES 2023 NET INCOME TO BE WITHIN A RANGE OF $6.45 TO $6.60 PER DILUTED SHARE.SEES 2023 FFO TO BE WITHIN A RANGE OF $11.80 TO $11.95 PER DILUTED SHARE.FY2023 FFO PER SHARE VIEW $11.93 -- REFINITIV IBES DATA.FY2023 EARNINGS PER SHARE VIEW $6.00 -- REFINITIV IBES DATA.Q1 FFO PER SHARE VIEW $2.81 -- REFINITIV IBES DATA.",
        "parentTopics": "Corporate Guidance"
    }
}