{
    "4244661": {
        "id": 4244661,
        "significance": "1",
        "headline": "TomTom Eyes Better Operational Revenues In H2 - Conf Call",
        "description": "July 15 (Reuters) - TomTom NV <TOM2.AS>::H1: WE STARTED TO GET CONTRACTS FOR ONLINE TECHNOLOGIES WHICH IS VERY SIGNIFICANT FOR US - CONF CALL.OPERATIONAL REVENUE: Q3 WILL BE BETTER THAN Q2, BUT Q4 WILL BE EVEN BETTER THAN Q3 - CONF CALL.I DO NOT SEE A STRATEGIC SHIFT IN THE PRIORITIES OF CARMAKERS - CEO DURING CONF CALL.ON APPLE: I THINK THERE WILL BE OPPORTUNITIES FOR EXTENDING THAT RELATIONSHIP, BUT IT WILL BE OF A DIFFERENT NATURE THAN IT USED TO BE - CEO DURING CONF CALL.",
        "parentTopics": "Corporate Deals"
    },
    "4252812": {
        "id": 4252812,
        "significance": "1",
        "headline": "Apple Reports Q3 Earnings Of $2.58 Per Share",
        "description": "July 30 (Reuters) - Apple Inc <AAPL.O>::QUARTERLY EARNINGS PER SHARE $2.58.QUARTERLY REVENUE OF $59.69 BILLION, UP 11% FROM YEAR-AGO QUARTER.Q3 EARNINGS PER SHARE VIEW $2.04, REVENUE VIEW $52.25 BILLION -- REFINITIV IBES DATA.INTERNATIONAL SALES ACCOUNTED FOR 60% OF QUARTER'S REVENUE.SAYS BOARD DECLARED CASH DIVIDEND OF $0.82 PER SHARE.SAYS BOARD APPROVED A FOUR-FOR-ONE STOCK SPLIT; TRADING WILL BEGIN ON A SPLIT-ADJUSTED BASIS ON AUG. 31, 2020.QUARTERLY GREATER CHINA REVENUE $9.33 BILLION VERSUS $9.16 BILLION LAST YEAR.SAYS GENERATED OPERATING CASH FLOW OF $16.3 BILLION DURING THE QUARTER.QUARTERLY IPAD REVENUE $6.58 BILLION VERSUS $5.02 BILLION LAST YEAR.QUARTERLY IPHONE REVENUE $26.42 BILLION VERSUS $25.99 BILLION LAST YEAR.QUARTERLY MAC REVENUE $7.08 BILLION VERSUS $5.82 BILLION LAST YEAR.QUARTERLY SERVICES REVENUE $13.16 BILLION VERSUS $11.46 BILLION LAST YEAR.QUARTERLY WEARABLES, HOME AND ACCESSORIES REVENUE $6.45 BILLION VERSUS $5.53 BILLION LAST YEAR.",
        "parentTopics": "Corporate Guidance"
    },
    "4258235": {
        "id": 4258235,
        "significance": "1",
        "headline": "Berkshire Hathaway In First Six Months, Paid $6.7 Bln To Repurchase Shares Of Class A And B Common Stock",
        "description": "Aug 8 (Reuters) - Berkshire Hathaway Inc <BRKa.N>::IN THE FIRST SIX MONTHS OF 2020, BERKSHIRE PAID $6.7 BILLION TO REPURCHASE SHARES OF CLASS A AND B COMMON STOCK.BERKSHIRE OWNED $91.5 BILLION APPLE <<<AAPL.O>>> SHARES AS OF JUNE 30, COMPARED WITH REPORTED $63.8 BILLION AS OF MARCH 31.BERKSHIRE HATHAWAY- IN Q2, REEVALUATED GOODWILL, INDEFINITE-LIVED INTANGIBLE ASSETS OF CERTAIN UNITS FOR IMPAIRMENT DUE TO DISRUPTIONS FROM COVID-19 PANDEMIC.BERKSHIRE HATHAWAY-   CARRYING VALUE OF PCC-RELATED GOODWILL AND INDEFINITE-LIVED INTANGIBLE ASSETS PRIOR TO IMPAIRMENT CHARGES WAS ABOUT $31 BILLION.IN THE SECOND QUARTER AND FIRST SIX MONTHS OF 2020, PCC EXPERIENCED SIGNIFICANT DECLINES IN AEROSPACE MARKETS.PCC’S REVENUES WERE $1.8 BILLION IN Q2 DOWN 32.5% FROM THE SECOND QUARTER OF 2019.PCC INCURRED A PRE-TAX LOSS OF $78 MILLION IN Q2 COMPARED TO PRE-TAX EARNINGS OF $481 MILLION IN Q2 OF 2019.",
        "parentTopics": "Corporate Guidance"
    },
    "4300598": {
        "id": 4300598,
        "significance": "1",
        "headline": "Berkshire Says It Ended Q3 With $145.7 Billion Of Cash And Equivalents",
        "description": "Nov 7 (Reuters) - Berkshire Hathaway Inc <BRKa.N>::BERKSHIRE OWNED $111.7 BILLION APPLE <<<AAPL.O>>> SHARES AS OF SEPT 30, COMPARED WITH REPORTED $91.5 BILLION AS OF JUNE 30.BERKSHIRE OWNED $24.9 BILLION BANK OF AMERICA SHARES AS OF SEPT 30, COMPARED WITH REPORTED $22.6 BILLION AS OF JUNE 30.BERKSHIRE HATHAWAY-EFFECTS OF PREMIUM RATE REDUCTIONS FROM GEICO GIVEBACK PROGRAM ADDED TO SIGNIFICANT DECLINE IN Q3 UNDERWRITING EARNINGS VERSUS FIRST TWO 2020 QTRS.BERKSHIRE HATHAWAY-EFFECTS OF RATE REDUCTIONS UNDER GEICO PROGRAM TO CONTINUE OVER REMAINDER OF 2020 AND THROUGH Q1 OF 2021.BERKSHIRE HATHAWAY-LOSSES AND LOSS ADJUSTMENT EXPENSES IN 2020 INCLUDED ESTIMATED LOSSES OF $308 MILLION FROM HURRICANES LAURA AND SALLY IN Q3.BERKSHIRE SAYS IT ENDED Q3 WITH $145.7 BILLION OF CASH AND EQUIVALENTS.",
        "parentTopics": "Corporate Guidance"
    },
    "4338264": {
        "id": 4338264,
        "significance": "1",
        "headline": "Snap Inc Says More Than Doubled Number Of Active Advertisers Year-Over-Year In Q4",
        "description": "Feb 4 (Reuters) - :SNAP INC CEO SAYS DAILY ACTIVE USERS OPENED SNAPCHAT 30 TIMES PER DAY ON AVERAGE - PREPARED REMARKS.SNAP INC CEO SAYS REORGANIZING PRODUCT TEAM AROUND FIVE CORE PLATFORMS ON SNAPCHAT: MAP, COMMUNICATION, CAMERA, STORIES, SPOTLIGHT.SNAP INC EXEC SAYS ENDED 2020 WITH OVER $3.5 BILLION IN AVAILABLE WORKING CAPITAL INCLUSIVE OF CASH, MARKETABLE SECURITIES, EXISTING CREDIT FACILITIES.SNAP INC EXEC SAYS MORE THAN DOUBLED NUMBER OF ACTIVE ADVERTISERS YEAR-OVER-YEAR IN Q4.SNAP INC - STARTED QUARTER SLOWER THAN CO WOULD HAVE OTHERWISE EXPECTED DUE TO INTERRUPTION IN ADVERTISING DEMAND.SNAP INC - EXPERIENCED INTERRUPTION TO ADVERTISING DEMAND IN 1ST 2 WEEKS OF JAN AS MANY BRAND ADVERTISERS PAUSED CAMPAIGNS AMID EVENTS AT U.S. CAPITOL.SNAP INC - NOT CLEAR YET WHAT LONGER TERM IMPACT OF IOS PLATFORM POLICY CHANGES MAY BE FOR TOPLINE MOMENTUM OF BUSINESS.SNAP INC - ESTIMATE DAU WILL GROW Y-O-Y IN Q1 AT A RATE OF ABOUT 20% TO REACH 275 MILLION.SNAP INC - ANTICIPATE IOS PLATFORM POLICY CHANGES TO BE IMPLEMENTED LATER THIS QUARTER TO PRESENT RISK OF INTERRUPTION TO ADVERTISING DEMAND. ((Reuters.Briefs@thomsonreuters.com;)).",
        "parentTopics": "Corporate Guidance"
    },
    "4340594": {
        "id": 4340594,
        "significance": "1",
        "headline": "Twitter Qtrly GAAP EPS $0.27",
        "description": "Feb 9 (Reuters) - :TWITTER INC - QTRLY GAAP SHR $0.27; QTRLY NON-GAAP SHR $0.38; QTRLY REV $1.29 BLN, UP 28%.TWITTER INC Q4 SHR VIEW $0.31, REV VIEW $1.19 BLN -- REFINITIV IBES DATA.TWITTER SEES Q1 TOTAL REV BETWEEN $940 MLN AND $1.04 BLN.TWITTER SEES Q1 GAAP OPER INCOME TO BE BETWEEN A LOSS OF $50 MLN AND BREAK EVEN.TWITTER - ASSUMING PANDEMIC CONTINUES TO IMPROVE & IMPACT FROM ROLLOUT OF IOS 14 CHANGES IS MODEST, CO SEES 2021 REV TO GROW FASTER THAN EXPENSES‍.TWITTER INC Q1 REV VIEW $965.1 MLN -- REFINITIV IBES DATA.TWITTER INC - QTRLY ADVERTISING REV $1.15 BLN, UP 31%.TWITTER INC - AVERAGE MONETIZABLE DAILY ACTIVE USAGE GROWTH OF 27% TO 192 MLN IN Q4.TWITTER INC - QTRLY AVERAGE U.S. MDAU WAS 37 MLN VS 31 MLN; QTRLY AVERAGE INTERNATIONAL MDAU WAS 155 MLN VS 121 MLN.TWITTER INC - QTRLY TOTAL AD ENGAGEMENTS INCREASED 35%; QTRLY COST PER ENGAGEMENT DECREASED 3%.TWITTER INC - EXPECT TO GROW HEADCOUNT BY OVER 20% IN 2021, ESPECIALLY IN ENGINEERING, PRODUCT, DESIGN & RESEARCH.TWITTER INC - EXPECT TOTAL COSTS & EXPENSES TO GROW 25% OR MORE IN 2021, RAMPING IN ABSOLUTE DOLLARS OVER COURSE OF THE YEAR.TWITTER SEES FY21 CAPITAL EXPENDITURES TO BE BETWEEN $900 MLN AND $950 MLN.TWITTER - EXPECT TO SEE MDAU GROWTH OF ABOUT 20% YEAR OVER YEAR IN Q1’21.TWITTER - PANDEMIC-RELATED MDAU SURGE MAY LEAD TO QTRLY GROWTH RATES IN LOW DOUBLE DIGITS ON YOY BASIS BEYOND Q1 WITH LOW POINT LIKELY IN Q2.TWITTER SEES AVERAGE ANNUAL MDAU GROWTH RATE OF ABOUT 20% FROM Q4’19 TO Q4’21.",
        "parentTopics": "Corporate Guidance"
    },
    "4376775": {
        "id": 4376775,
        "significance": "1",
        "headline": "Snap Inc Says Continue To See Over Half Of Co's Rev Come From Direct Response Campaigns",
        "description": "April 22 (Reuters) - Snap Inc::SNAP INC CEO SAYS REACHED MORE THAN 125 MILLION MONTHLY ACTIVE USERS ON SPOTLIGHT IN MARCH.SNAP INC EXEC SAYS CONTINUE TO SEE OVER HALF OF CO'S REVENUE COME FROM DIRECT RESPONSE CAMPAIGNS.SNAP INC CFO SAYS Q2 REVENUE RANGE REFLECTS BEST CURRENT ESTIMATE OF POTENTIAL IMPACT OF ANTICIPATED DISRUPTIONS ASSOCIATED WITH IOS PLATFORM CHANGES.SNAP INC EXEC SAYS COMMITTED TO WORKING WITH ADVERTISERS AS WE NAVIGATE THE APP TRACKING TRANSPARENCY-RELATED CHANGES FROM APPLE.SNAP CFO SAYS IMPACT OF IOS PLATFORM CHANGES TO TOPLINE MOMENTUM OF BUSINESS MAY NOT BE CLEAR UNTIL MANY  MONTHS\\/MORE AFTER CHANGES ARE IMPLEMENTED.SNAP INC CFO SAYS ESTIMATE THAT DAU WILL GROW AT RATE CONSISTENT WITH PRIOR QUARTER, OR ABOUT 22% Y-O-Y, TO REACH 290 MILLION IN Q2.SNAP INC CFO SAYS IOS PLATFORM POLICY CHANGES DID NOT OCCUR IN QUARTER & THUS WERE NOT A HEADWIND TO DEMAND.",
        "parentTopics": "Restructuring\\/Reorganization\\/Related"
    },
    "4377755": {
        "id": 4377755,
        "significance": "1",
        "headline": "Apple Plans To Invest Over $1 Billion In North Carolina",
        "description": "April 26 (Reuters) - Apple Inc <AAPL.O>: :APPLE- PLANS TO INVEST OVER $1 BILLION IN NORTH CAROLINA AND WILL BEGIN CONSTRUCTIONON A NEW CAMPUS AND ENGINEERING HUB IN RESEARCH TRIANGLE AREA.APPLE - IS SETTING A TARGET OF CREATING 20,000 ADDITIONAL JOBS IN STATES ACROSS U.S. OVER NEXT 5 YEARS.APPLE - IS ON TRACK TO MEET ITS 2018 GOAL OF CREATING 20,000 NEW JOBS IN THE U.S. BY 2023.",
        "parentTopics": "Products"
    },
    "4382240": {
        "id": 4382240,
        "significance": "1",
        "headline": "Buffett, Munger discuss Apple, taxes, 'gambling' in market, other issues at Berkshire meeting",
        "description": "May 1 (Reuters) - Munger, asked about prospect of rising taxes, says he's a little wary of constantly being mad at people because they have a little more money:Munger says it wouldn't be the end of the world for berkshire if u.s. Corporate tax rate were increased to 25% or 28%.Warren buffett, chairman of berkshire hathaway, says he sold some apple inc <AAPL.O> stock last year and it was probably a mistake, says vice chairman charlie munger agrees -- berkshire hathaway annual meeting.Buffett says apple is an 'extraordinary' business with 'indispensable' products, says ceo tim cook has made accomplishments that steve jobs could not.Buffett, asked about impact of special purpose acquisition companies on berkshire's ability to make acquisitions, says: 'it's a killer'.Buffett laments rise of 'gambling impulse' among people who treat markets as a casino.Warren buffett says he voted for joe biden in 2020 u.s. Presidential election.Buffett says he did not foresee precision castparts unit would enter 'something close to a depression' because of the covid-19 pandemic; buffett has admitted overpaying for the aircraft and industrial parts unit. munger says 'of course i hate the bitcoin success,' and that 'the whole development is disgusting and contrary to the interests of civilization'.Buffett says berkshire investment managers todd combs and ted weschler are 'absolutely terrific' and 'assets' to berkshire, doesn't want them having to publicly field questions about stocks at annual meeting.",
        "parentTopics": "Corporate Guidance"
    },
    "4384754": {
        "id": 4384754,
        "significance": "1",
        "headline": "Zynga Reports Q1 Loss Of $0.02 Per Share",
        "description": "May 5 (Reuters) - Zynga Inc::QUARTERLY LOSS PER SHARE $0.02.QUARTERLY REVENUE $680 MILLION, UP 68%.NET INCREASE IN QUARTERLY DEFERRED REVENUE WAS $39 MILLION.QUARTERLY BOOKINGS $720 MILLION, UP 69%.QUARTERLY AVERAGE MOBILE DAUS 38 MILLION, UP 85%.QUARTERLY AVERAGE MOBILE MAUS 164 MILLION, UP 139%.QUARTERLY USER PAY REVENUE OF $557 MILLION, UP 62%.QUARTERLY USER PAY BOOKINGS $596 MILLION, UP 63%.SEES FY 2021 REVENUE OF $2.7 BILLION.SEES FY 2021 BOOKINGS OF $2.9 BILLION.SEES FY 2021 NET LOSS OF $135 MILLION.2021 GUIDANCE FACTORS IN APPLE’S RECENT CHANGES TO IDFA THAT WILL CREATE SOME SHORT-TERM PRESSURE ON ADVERTISING YIELDS PRIMARILY IN Q2 & Q3.HAVE MULTIPLE STRATEGIES IN PLACE THAT SHOULD MORE THAN OFFSET POTENTIAL HEADWIND FROM APPLE’S RECENT CHANGES TO IDFA.EXPECT TO MEANINGFULLY GROW AD REVENUE, BOOKINGS IN 2021, DRIVEN BY FY CONTRIBUTION FROM HYPER-CASUAL TITLES, SOME GROWTH ACROSS REST OF PORTFOLIO.ZYNGA INC - SEES NET INCREASE IN DEFERRED REVENUE OF $200 MILLION IN FY 2021.SEES Q2 REVENUE OF $675 MILLION; SEES Q2 BOOKINGS OF $710 MILLION.SEES Q2 NET LOSS OF $30 MILLION.IN 2022 EXPECT LOW DOUBLE-DIGIT TOPLINE ORGANIC GROWTH AS WELL AS IMPROVED OPERATING LEVERAGE FROM LIVE SERVICES PORTFOLIO.SEES NET INCREASE IN DEFERRED REVENUE OF $35 MILLION IN Q2.Q2 & FY 2021 GUIDANCE DOES NOT INCLUDE ANY CONTRIBUTIONS FROM CHARTBOOST.DEAL TO ACQUIRE CHARTBOOST FOR ABOUT $250 MILLION IN CASH, IS EXPECTED TO BE IMMEDIATELY ACCRETIVE.",
        "parentTopics": "Corporate Guidance"
    },
    "4461567": {
        "id": 4461567,
        "significance": "1",
        "headline": "Apple's Tim Cook Says Supply Chain Constraints Had Larger Than Expected Impact Of $6 Bln On Q4 Sales",
        "description": "Oct 28 (Reuters) - Apple Inc::CEO TIM COOK SAYS SUPPLY CHAIN CONSTRAINTS HAD LARGER THAN EXPECTED IMPACT OF $6 BILLION ON Q4 SALES - INTERVIEW.CEO TIM COOK SAYS CHIP SHORTAGES, COVID-RELATED SUPPLY CHAIN DISRUPTIONS IN SOUTHEAST ASIA IMPACTED Q4 SALES - INTERVIEW.TIM COOK SAYS SUPPLY CONSTRAINTS NOW AFFECTING ALL OF APPLE'S PRODUCT LINES - INTERVIEW.TIM COOK SAYS SUPPLY CHAIN CONSTRAINTS WILL HAVE GREATER THAN $6 BILLION IMPACT ON DECEMBER QUARTER SALES - INTERVIEW.TIM COOK SAYS APPLE HAS SEEN IMPROVEMENT IN SUPPLY CHAIN DISRUPTIONS IN SOUTHEAST ASIA AS OF LATE OCTOBER - INTERVIEW.CEO TIM COOK SAYS APPLE EXPECTS YEAR-OVER-YEAR REVENUE GROWTH FOR DECEMBER QUARTER - INTERVIEW.TIM COOK SAYS APPLE IS UNSURE WHETHER SHORTAGES OF LEGACY NODE CHIPS WILL EASE AFTER START OF 2022 - INTERVIEW.Further company coverage: AAPL.O. ((Reuters.Briefs@thomsonreuters.com;)).",
        "parentTopics": "Corporate Guidance"
    },
    "4466942": {
        "id": 4466942,
        "significance": "1",
        "headline": "Berkshire Hathaway Says It Ended September With About $149.2 Bln Of Cash And Equivalents",
        "description": "Nov 6 (Reuters) - Berkshire Hathaway Inc- Berkshire Owned $43.9 Bln Bank Of America <BRKa.N>::BERKSHIRE OWNED $128.4 BILLION APPLE <<<AAPL.O>>> SHARES AS OF SEPT 30, COMPARED WITH REPORTED $124.3 BILLION AS OF JUNE 30.SHARES AS OF SEPT 30, COMPARED WITH REPORTED $42.6 BILLION AS OF JUNE 30.BERKSHIRE HATHAWAY INC- LOSSES AND LOSS ADJUSTMENT EXPENSES INCREASED $1.6 BILLION (23.7%) IN Q3 2021.BERKSHIRE HATHAWAY-INCREASES REFLECTED OVERALL INCREASES IN AVERAGE CLAIMS FREQUENCIES,SEVERITIES,ABOUT $400 MILLION IN PRE-TAX LOSSES DUE TO HURRICANE IDA.BERKSHIRE HATHAWAY-BERKSHIRE SAYS IT ENDED SEPTEMBER WITH ABOUT $149.2 BILLION OF CASH AND EQUIVALENTS.BERKSHIRE HATHAWAY-IT HAS REDUCED ITS CLASS A EQUIVALENT SHARE COUNT BY MORE THAN 4,100 FROM OCT 1 TO OCT 27, SUGGESTING IT MADE AT LEAST $1.7 BILLION ADDITIONAL STOCK REPURCHASES.BERKSHIRE SAYS IT SOLD ABOUT $2 BILLION MORE EQUITIES THAN IT PURCHASED IN Q3 -- QUARTERLY REPORT.",
        "parentTopics": "Corporate Guidance"
    },
    "4498424": {
        "id": 4498424,
        "significance": "1",
        "headline": "Apple CFO Expects Sales Hit In Current Quarter From Supply Chain Issues To Be Under $6 Billion",
        "description": "Jan 27 (Reuters) - APPLE CFO::APPLE CFO SAYS 'VERY SIGNIFICANT SUPPLY CONSTRAINTS' LED TO IPAD SHORTAGES.APPLE CFO SAYS 1.8 BILLION ACTIVE DEVICES.APPLE CFO SAYS ALL TOP 4 HIGHEST-SELLING PHONES IN URBAN CHINA IN QUARTER WERE IPHONES.APPLE CFO SAYS 'WEARABLES BUSINESS ALMOST THE SIZE OF A FORTUNE 100 CO'.APPLE CFO SAYS 785 MILLION PAID SUBSCRIBERS.APPLE CFO SAYS EXPECT TO SET MARCH QUARTER REVENUE RECORD IN CURRENT QUARTER.APPLE CFO SAYS EASING OF SUPPLY CHAIN ISSUES IN CURRENT QUARTER DUE TO ONGOING WORK WITH SUPPLIERS.APPLE CFO SAYS SUPPLY CHAIN ISSUES PRIMARLY CHIP SHORTAGES FOR OLDER MODELS OF PRODUCTS.APPLE CFO SAYS EXPECT TO SET MARCH QUARTER REVENUE RECORD IN CURRENT QUARTER.APPLE CFO SAYS EXPECT LESS SUPPLY CHAIN ISSUES IN CURRENT QUARTER, SALES HIT IN CURRENT QUARTER FROM SUPPLY CHAIN ISSUES EXPECTED TO BE LESS THAN $6 BILLION.APPLE CFO SAYS SUPPLY CHAIN ISSUES COST MORE THAN $6 BILLION IN QUARTER, IN LINE WITH GUIDANCE.Further company coverage: AAPL.O. ((Reuters.Briefs@thomsonreuters.com;)).",
        "parentTopics": "Corporate Guidance"
    },
    "4503980": {
        "id": 4503980,
        "significance": "1",
        "headline": "Twitter Expects 2022 Revenue To Grow In The Low To Mid 20% Range, Excluding Mopub And Mopub Deals",
        "description": "Feb 10 (Reuters) - :TWITTER INC - SEES 2022 REVENUE TO GROW IN THE LOW TO MID 20% RANGE, EXCLUDING MOPUB AND MOPUB ACQUIRE.TWITTER INC - REVENUE IMPACT ASSOCIATED WITH APP TRACKING TRANSPARENCY IN Q4 REMAINED MODEST.TWITTER INC - HAVE INCORPORATED AN ONGOING MODEST IMPACT OF APP TRACKING TRANSPARENCY INTO Q1 GUIDANCE.TWITTER INC - RETOOLING REVENUE PRODUCTS IN LIGHT OF APPLE’S PRIVACY-RELATED IOS CHANGES TOOK ADDITIONAL TIME, AND RESOURCES IN 2020 AND 2021.TWITTER INC - BELIEVE THAT PRODUCT IMPROVEMENTS IN LIGHT OF PRIVACY-RELATED IOS CHANGES HAVE HELPED REDUCE ATT IMPACT ON TWITTER.TWITTER INC - SINCE INTRODUCING PROFESSIONAL ACCOUNTS IN Q3, CO HAS SEEN MORE THAN 2 MILLION SIGN-UPS.TWITTER INC - SEES 2022 EXPENSES TO RAMP IN ABSOLUTE DOLLARS CO INVESTS, WITH EXPECTED HEADCOUNT GROWTH OF ABOUT 20% AND A FOCUS ON RESEARCH AND DEVELOPMENT.TWITTER INC - EXPECT TOTAL COSTS AND EXPENSES TO GROW IN THE MID 20% RANGE IN 2022 VERSUS. 2021  (EXCLUDING ONE-TIME ITEMS).TWITTER INC - THERE WILL LIKELY BE LARGER SEQUENTIAL RISE IN SBC EXPENSES FOR Q1 RELATIVE TO PRIOR YEARS.TWITTER INC - SEQUENTIAL RISE IN SBC EXPENSES FOR Q1, DRIVEN BY A COMPETITIVE LABOR MARKET AND THE ANTICIPATED EARLIER ISSUANCE OF ANNUAL EQUITY GRANTS.",
        "parentTopics": "Corporate Guidance"
    },
    "4516388": {
        "id": 4516388,
        "significance": "1",
        "headline": "Apple Announces New iPhone SE Starting At $429",
        "description": "March 8 (Reuters) - Apple Inc <AAPL.O>::APPLE INC EVENT GETS UNDERWAY.APPLE INC SAYS APPLE TV+ TO GET FRIDAY NIGHT BASEBALL.APPLE INC SAYS IPHONE 13 TO GET 2 NEW FINISHES.APPLE INC SAYS NEW IPHONE 13 MODELS AVAILABLE FROM MARCH 18.APPLE INC ANNOUNCES NEW IPHONE SE.APPLE INC SAYS NEW IPHONE SE TO HAVE 4.7 INCH RETINA HD.APPLE INC SAYS NEW IPHONE SE TO HAVE 5G.APPLE INC NEW IPHONE SE STARTS AT $429.APPLE ANNOUNCES NEW IPAD AIR.APPLE SAYS NEW IPAD AIR TO HAVE M1 CHIP.APPLE SAYS NEW IPAD AIR TO HAVE 5G.APPLE SAYS NEW IPAD AIR STARTS AT $599.APPLE ANNOUNCES NEW M1 CHIP.APPLE SAYS NEW M1 CHIP TO BE CALLED M1 ULTRA.APPLE SAYS M1 ULTRA IS MADE BY CONNECTING TWO M1 MAX CHIPS.APPLE ANNOUNCES MAC STUDIO.APPLE ANNOUNCES NEW STUDIO DISPLAY.APPLE SAYS STUDIO DISPLAY TO HAVE 27-INCH DISPLAY.APPLE SAYS STUDIO DISPLAY STARTS AT $1599.Further company coverage: AAPL.O. ((Reuters.Briefs@thomsonreuters.com;)).",
        "parentTopics": "Corporate Guidance"
    },
    "4613461": {
        "id": 4613461,
        "significance": "1",
        "headline": "Apple Inc Reports Q4 Earnings Per Share Of $1.29",
        "description": "Oct 27 (Reuters) - Apple Inc <AAPL.O>::QTRLY EARNINGS PER SHARE $1.29.QTRLY NET SALES $90.15 BILLION VERSUS $83.36 BILLION.QTRLY GREATER CHINA NET SALES $15.47 BILLION VERSUS $14.56 BILLION LAST YEAR.Q4 EARNINGS PER SHARE VIEW $1.27, REVENUE VIEW $88.90 BILLION -- REFINITIV IBES DATA.QTRLY IPHONE NET SALES $42.63 BILLION VERSUS $38.87 BILLION LAST YEAR.QTRLY IPAD NET SALES $7.17 BILLION VERSUS $8.26 BILLION LAST YEAR.QTRLY MAC NET SALES $11.51 BILLION VERSUS $9.18 BILLION LAST YEAR.QTRLY WEARABLES, HOME AND ACCESSORIES NET SALES $9.65 BILLION VERSUS $8.79 BILLION LAST YEAR.QTRLY SERVICES NET SALES $19.19 BILLION VERSUS $18.28 BILLION LAST YEAR.",
        "parentTopics": "Corporate Guidance"
    },
    "4729098": {
        "id": 4729098,
        "significance": "1",
        "headline": "Nokia And Apple Sign Long-Term Patent License Agreement",
        "description": "June 30 (Reuters) - Nokia Oyj <NOKIA.HE>::NOKIA AND APPLE SIGN LONG-TERM PATENT LICENSE AGREEMENT.NOKIA TO RECEIVE PAYMENTS FROM APPLE FOR A MULTI-YEAR PERIOD ESPOO, FINLAND.TERMS OF AGREEMENT REMAIN CONFIDENTIAL BETWEEN PARTIES.LICENSE COVERS NOKIA’S FUNDAMENTAL INVENTIONS IN 5G AND OTHER TECHNOLOGIES.EXPECTS TO RECOGNIZE REVENUE RELATED TO THIS NEW PATENT LICENSE AGREEMENT STARTING IN JANUARY 2024.",
        "parentTopics": "Corporate Deals"
    },
    "4729108": {
        "id": 4729108,
        "significance": "1",
        "headline": "Nokia And Apple Sign Long-Term Patent License Agreement",
        "description": "Nokia Oyj <NOKIA.HE>::NOKIA AND APPLE SIGN LONG-TERM PATENT LICENSE AGREEMENT.NOKIA OYJ - LICENSE COVERS NOKIA'S FUNDAMENTAL INVENTIONS IN 5G AND OTHER TECHNOLOGIES.NOKIA OYJ - HAS SIGNED A NEW PATENT CROSS-LICENSE AGREEMENT WITH APPLE WHICH WILL REPLACE CURRENT LICENSE THAT IS DUE TO EXPIRE AT END OF 2023.NOKIA OYJ - NOKIA TO RECEIVE PAYMENTS FROM APPLE FOR A MULTI-YEAR PERIOD.NOKIA OYJ - TERMS OF AGREEMENT REMAIN CONFIDENTIAL BETWEEN PARTIES.NOKIA OYJ - HAS SIGNED A NEW PATENT CROSS-LICENSE AGREEMENT WITH APPLE WHICH WILL REPLACE CURRENT LICENSE THAT IS DUE TO EXPIRE AT END OF 2023.NOKIA OYJ - NOKIA EXPECTS TO RECOGNIZE REVENUE RELATED TO NEW PATENT LICENSE AGREEMENT STARTING IN JANUARY 2024.",
        "parentTopics": "Corporate Guidance"
    },
    "4738309": {
        "id": 4738309,
        "significance": "1",
        "headline": "LG Display expects to turn to profit in Q4",
        "description": "July 26 (Reuters) - LG Display Co Ltd <034220.KS>::LG DISPLAY:  EXPECTS Q3 SHIPMENT OF MID AND LARGE SIZED PRODUCTS TO GROW.LG DISPLAY:  MARKET HAS BEEN OVER THE WORST, BUT RECOVERY IS NOT IN FULL SWING YET.LG DISPLAY: EXPECTS TO TURN TO PROFIT IN Q4.LG DISPLAY: NEXT YEAR'S ANNUAL INVESTMENT LIKELY MEANINGFUL REDUCTION FROM MID TO HIGH 3 TRILLION WON LEVEL.",
        "parentTopics": "Corporate Guidance"
    },
    "4750625": {
        "id": 4750625,
        "significance": "1",
        "headline": "Ford Hires Apple Veteran Peter Stern As President Of Ford Integrated Services",
        "description": "Aug 14 (Reuters) - Ford Motor Co <F.N>::FORD HIRES APPLE VETERAN PETER STERN TO LEAD NEW ERA OF CUSTOMER EXPERIENCES POWERED BY SOFTWARE AND SERVICES.FORD MOTOR CO: STERN IS NAMED PRESIDENT OF NEWLY FORMED FORD INTEGRATED SERVICES.FORD MOTOR CO: STERN REPORTS TO PRESIDENT AND CEO JIM FARLEY.FORD MOTOR CO: STERN WAS FORMERLY VICE PRESIDENT OF SERVICES AT APPLE.",
        "parentTopics": "Restructuring\\/Reorganization\\/Related"
    }
}