{
    "4300347": {
        "id": 4300347,
        "significance": "1",
        "headline": "Enbridge Reports Q3 Adjusted Earnings Per Share C$0.48",
        "description": "Nov 6 (Reuters) - Enbridge Inc <ENB.TO>::ENBRIDGE REPORTS STRONG THIRD QUARTER AND REAFFIRMS 2020 FINANCIAL GUIDANCE.Q3 ADJUSTED EARNINGS PER SHARE C$0.48.Q3 GAAP EARNINGS PER SHARE C$0.49.Q3 EARNINGS PER SHARE ESTIMATE C$0.53 -- REFINITIV IBES DATA.REAFFIRMED 2020 FINANCIAL GUIDANCE RANGE FOR 2020 OF $4.50 TO $4.80 DCF\\/SHARE.QTRLY DISTRIBUTABLE CASH FLOW (DCF) OF $2,088 MILLION, COMPARED WITH $2,105 MILLION.IN LIQUIDS, MAINLINE HEAVY CAPACITY IS NOW FULLY UTILIZED AND FULL YEAR VOLUMES ARE TRACKING TO GUIDANCE RANGE.ANNOUNCED $0.2 BILLION OF UTILITY GROWTH CAPITAL FOR THE LONDON LINE REPLACEMENT PROJECT., ON LINE 3 PERMITTING PROCESS, SAYS ANTICIPATE MPCA COMMISSIONER TO ISSUE THE 401 WATER QUALITY CERTIFICATE BY NOVEMBER 14TH.",
        "parentTopics": "Corporate Guidance"
    },
    "4316040": {
        "id": 4316040,
        "significance": "1",
        "headline": "Enbridge sees Canadian oil output rising, taking larger global heavy crude share",
        "description": "Dec 8 (Reuters) - Enbridge Inc <ENB.TO> executives, speaking at the company's investor day::PIPELINE COMPANY ENBRIDGE NOT PURSUING LARGE-SCALE M&A - CEO.ENBRIDGE CFO SAYS DOES NOT SEE ROOM FOR SHARE BUYBACKS IN 2021.ENBRIDGE CEO SAYS LIKELY TO FOCUS ON DEVELOPING OWN RENEWABLES RATHER THAN M&A.ENBRIDGE EXECUTIVE VP LIQUIDS SEES CANADIAN HEAVY OIL ACHIEVING GREATER GLOBAL SHARE TO 2040.ENBRIDGE SEES W.CANADA CRUDE SUPPLIES INCREASING 1 MILLION BARRELS PER DAY OVER NEXT DECADE - EVP LIQUIDS.ENBRIDGE EXPECTS ADDITIONAL COST TO BUILD LINE 3 FROM DELAYS, COVID-19, WINTER CONDITIONS - EXEC VP LIQUIDS.Further company coverage: ENB.TO. (Reporting by Rod Nickel). ((rod.nickel@tr.com;)).",
        "parentTopics": "Restructuring\\/Reorganization\\/Related"
    },
    "4315863": {
        "id": 4315863,
        "significance": "1",
        "headline": "Enbridge Announces 2021 Financial Guidance, Increases Dividend, Provides Update On Strategic Priorities",
        "description": "Dec 8 (Reuters) - Enbridge Inc <ENB.TO>::ENBRIDGE ANNOUNCES 2021 FINANCIAL GUIDANCE, INCREASES DIVIDEND, AND PROVIDES UPDATE ON STRATEGIC PRIORITIES.ENBRIDGE INC - EXPECTS FULL-YEAR 2020 DCF PER SHARE TO BE NEAR MID-POINT OF $4.50 TO $4.80 GUIDANCE RANGE.ENBRIDGE INC -SEES 2021 PROJECTED DCF PER SHARE OF $4.70 TO $5.00.ENBRIDGE INC - SEES 2021 EBITDA OF $13.9 BILLION TO $14.3 BILLION.ENBRIDGE - EXECUTION OF $16 BILLION SECURED GROWTH CAPITAL PROGRAM CONTINUES TO ADVANCE, GENERATING ABOUT $2 BILLION OF EXPECTED EBITDA GROWTH FROM 2021-2023.ENBRIDGE INC - CONSTRUCTION HAS COMMENCED ON REMAINING MINNESOTA LEG OF U.S. LINE 3 REPLACEMENT PROJECT.ENBRIDGE INC - ANTICIPATES THAT LINE 3 REPLACEMENT PROJECT WILL BE IN SERVICE IN Q4 OF 2021.ENBRIDGE INC - RE-AFFIRMATION OF 5-7% AVERAGE LONG-TERM ANNUAL DISTRIBUTABLE CASH FLOW PER SHARE GROWTH OUTLOOK.",
        "parentTopics": "Performance"
    },
    "4342864": {
        "id": 4342864,
        "significance": "1",
        "headline": "Enbridge Inc Posts Qtrly Earnings Per Common Share $0.88",
        "description": "Feb 12 (Reuters) - Enbridge Inc <ENB.TO>::ENBRIDGE REPORTS STRONG 2020 FINANCIAL RESULTS.QTRLY GAAP EARNINGS PER COMMON SHARE $0.88.QTRLY ADJUSTED EARNINGS PER COMMON SHARE $0.56.REAFFIRMED 2021 DCF PER SHARE GUIDANCE RANGE OF $4.70 TO $5.00 AND EBITDA RANGE OF $13.9 BILLION TO $14.3 BILLION.ENDED Q4 WITH OVER $13 BILLION OF AVAILABLE LIQUIDITY.Q4 EARNINGS PER SHARE VIEW C$0.61 -- REFINITIV IBES DATA.",
        "parentTopics": "Corporate Guidance"
    },
    "4386477": {
        "id": 4386477,
        "significance": "1",
        "headline": "Enbridge Reports First Quarter 2021 Financial Results",
        "description": "May 7 (Reuters) - Enbridge Inc <ENB.TO>::ENBRIDGE REPORTS STRONG FIRST QUARTER 2021 FINANCIAL RESULTS; REAFFIRMS 2021 FINANCIAL OUTLOOK.Q1 ADJUSTED EARNINGS PER SHARE C$0.81.Q1 GAAP EARNINGS PER SHARE C$0.94.DCF FOR Q1 WAS $2.8 BILLION, AN INCREASE OF $55 MILLION OVER Q1 OF 2020.ENBRIDGE - SEES FY 2021 EBITDA, DCF WITHIN PREVIOUSLY PROVIDED GUIDANCE RANGE OF $13.9 TO $14.3 BILLION & $4.70 TO $5.00 PER SHARE, RESPECTIVELY.ENBRIDGE - WORK ON PERMITS AND APPROVALS FOR LINE 5 FROM USACE AND MICHIGAN PUBLIC SERVICE COMMISSION CONTINUE TO PROGRESS.DURING Q1, ENBRIDGE CONTINUED TO ADVANCE LINE 5 TUNNEL PROJECT BY COMPLETING ENGINEERING AND DESIGN PHASE.",
        "parentTopics": "Corporate Guidance"
    },
    "4422713": {
        "id": 4422713,
        "significance": "1",
        "headline": "Enbridge Reports Q2 GAAP Earnings Per Share C$0.69",
        "description": "July 30 (Reuters) - Enbridge Inc <ENB.TO>::ENBRIDGE REPORTS STRONG SECOND QUARTER 2021 FINANCIAL RESULTS AND ADVANCES STRATEGIC PRIORITIES.Q2 GAAP EARNINGS PER SHARE C$0.69.Q2 EARNINGS PER SHARE ESTIMATE C$0.57 -- REFINITIV IBES DATA.Q2 ADJUSTED EARNINGS PER SHARE C$0.67.QTRLY DISTRIBUTABLE CASH FLOW (DCF) OF $2.5 BILLION OR $1.24 PER COMMON SHARE.REAFFIRMED 2021 FULL YEAR GUIDANCE RANGE OF EBITDA OF $13.9 BILLION TO $14.3 BILLION AND DCF PER SHARE OF $4.70 TO $5.00.CONSTRUCTION OF FINAL LEG OF U.S. LINE 3 REPLACEMENT PROJECT IS PROGRESSING ON SCHEDULE WITH AN EXPECTED Q4 IN-SERVICE DATE.",
        "parentTopics": "Corporate Guidance"
    },
    "4441591": {
        "id": 4441591,
        "significance": "1",
        "headline": "Enbridge Advances U.S. Gulf Coast Strategy With Acquisition Of North America's Premier Crude Export Facility",
        "description": "Sept 7 (Reuters) - Enbridge Inc <ENB.TO>::ENBRIDGE ADVANCES U.S. GULF COAST STRATEGY WITH ACQUISITION OF NORTH AMERICA'S PREMIER CRUDE EXPORT FACILITY.ENBRIDGE INC - DEAL EXPECTED TO BE IMMEDIATELY ACCRETIVE TO ENBRIDGE'S FINANCIAL OUTLOOK.ENBRIDGE - TRANSACTION WILL BE INITIALLY FUNDED WITH EXISTING LIQUIDITY & CO ANTICIPATES 2022 DEBT TO EBITDA WILL BE AT LOWER END OF ITS TARGET RANGE.ENBRIDGE INC - ENBRIDGE WILL HOLD A 50% INTEREST IN A BROWNFIELD ST. JAMES DEEP-WATER CRUDE AND REFINED PRODUCTS TERMINAL DEVELOPMENT OPPORTUNITY.ENBRIDGE INC - ACQUIRED ASSETS STRONGLY ACCRETIVE TO DISTRIBUTABLE CASH FLOW PER SHARE AND EARNINGS PER SHARE.",
        "parentTopics": "Financing"
    },
    "4466755": {
        "id": 4466755,
        "significance": "1",
        "headline": "Enbridge Reports Strong Third Quarter 2021 Results, Executing On Business Priorities",
        "description": "Nov 5 (Reuters) - Enbridge Inc <ENB.TO>::ENBRIDGE REPORTS STRONG THIRD QUARTER 2021 RESULTS, EXECUTING ON BUSINESS PRIORITIES.Q3 ADJUSTED EARNINGS PER SHARE C$0.59.Q3 GAAP EARNINGS PER SHARE C$0.34.QTRLY DISTRIBUTABLE CASH FLOW (DCF) OF $2.3 BILLION OR $1.13 PER COMMON SHARE.COMPLETED AND PLACED INTO SERVICE U.S. LINE 3 REPLACEMENT PROJECT.REAFFIRMED 2021 FULL YEAR GUIDANCE RANGE FOR EBITDA OF $13.9 BILLION TO $14.3 BILLION AND DCF PER SHARE OF $4.70 TO $5.00.ON TRACK TO DELIVER MORE THAN $10 BILLION OF CAPITAL INTO SERVICE IN 2021.Q3 EARNINGS PER SHARE VIEW C$0.57 -- REFINITIV IBES DATA.",
        "parentTopics": "Corporate Guidance"
    },
    "4482292": {
        "id": 4482292,
        "significance": "1",
        "headline": "Enbridge Announces 2022 Financial Guidance, Increases Dividend, And Provides Update On Strategic Priorities",
        "description": "Dec 7 (Reuters) - Enbridge Inc <ENB.TO>::ENBRIDGE ANNOUNCES 2022 FINANCIAL GUIDANCE, INCREASES DIVIDEND, AND PROVIDES UPDATE ON STRATEGIC PRIORITIES.ENBRIDGE INC - REAFFIRMED 2021 FULL YEAR GUIDANCE RANGE FOR ADJUSTED EARNINGS BEFORE INTEREST, INCOME TAXES AND DEPRECIATION.ENBRIDGE INC - ANNOUNCED 2022 FINANCIAL GUIDANCE FOR EBITDA OF $15.0 TO $15.6 BILLION AND DCF PER SHARE OF $5.20 TO $5.50.ENBRIDGE INC - 5-7% AVERAGE ANNUAL DCF PER SHARE GROWTH OUTLOOK EXTENDED THROUGH 2024.ENBRIDGE - ANNOUNCED INTENT TO ESTABLISH A NORMAL COURSE ISSUER BID PROGRAM, ALLOWING FOR REPURCHASE OF UP TO $1.5 BILLION OF ITS OUTSTANDING COMMON SHARES.ENBRIDGE INC - QUARTERLY DIVIDEND FOR 2022 WILL BE INCREASED FROM $0.835 TO $0.86 PER SHARE.ENBRIDGE INC - HAS SANCTIONED $1.1 BILLION OF NEW CAPITAL PROJECTS ADDING TO ITS ORGANIC GROWTH CAPITAL BACKLOG.ENBRIDGE INC - REAFFIRMED 2021 FULL YEAR GUIDANCE RANGE FOR DISTRIBUTABLE CASH FLOW (DCF) PER SHARE OF $4.70 TO $5.00.",
        "parentTopics": "Performance"
    },
    "4504728": {
        "id": 4504728,
        "significance": "1",
        "headline": "Enbridge Inc - QTRLY Earnings Per Share C$0.91",
        "description": "Feb 11 (Reuters) - Enbridge Inc <ENB.TO>::QTRLY EARNINGS PER SHARE C$0.91.QTRLY ADJUSTED EARNINGS PER SHARE C$0.68.REAFFIRMS ITS 2022 FINANCIAL GUIDANCE.QTRLY DISTRIBUTABLE CASH FLOW C$2,487 MILLION VERSUS C$2,209 MILLION.INCREASED ITS 2022 QUARTERLY DIVIDEND BY 3% TO $0.86 ($3.44 ANNUALLY) PER SHARE.Q4 EARNINGS PER SHARE VIEW C$0.76 -- REFINITIV IBES DATA.PROCEEDING WITH TEXAS EASTERN MODERNIZATION PHASE II WITH A TOTAL CAPITAL COST OF APPROXIMATELY US$0.4 BILLION.ALSO ANNOUNCED US$0.1 BILLION APPALACHIA TO MARKET PHASE II EXPANSION OF TEXAS EASTERN SYSTEM.",
        "parentTopics": "Corporate Guidance"
    },
    "4542576": {
        "id": 4542576,
        "significance": "1",
        "headline": "Enbridge Reports First Quarter 2022 Financial Results",
        "description": "May 6 (Reuters) - Enbridge Inc <ENB.TO>::ENBRIDGE REPORTS FIRST QUARTER 2022 FINANCIAL RESULTS AND ADVANCES NEW ORGANIC GROWTH OPPORTUNITIES.Q1 ADJUSTED EARNINGS PER SHARE C$0.84.Q1 GAAP EARNINGS PER SHARE C$0.95.REAFFIRMED ITS 2022 FINANCIAL OUTLOOK.QTRLY DISTRIBUTABLE CASH FLOW OF $3.1 BILLION OR $1.52 PER COMMON SHARE, COMPARED WITH $2.8 BILLION OR $1.37 PER COMMON SHARE IN 2021.Q1 EARNINGS PER SHARE VIEW C$0.85 -- REFINITIV IBES DATA.",
        "parentTopics": "Corporate Guidance"
    },
    "4574405": {
        "id": 4574405,
        "significance": "1",
        "headline": "Enbridge Reports Second Quarter 2022 Financial Results",
        "description": "July 29 (Reuters) - Enbridge Inc <ENB.TO>::ENBRIDGE REPORTS SECOND QUARTER 2022 FINANCIAL RESULTS AND ANNOUNCES $3.6 BILLION OF NEWLY SECURED PROJECTS THIS QUARTER.Q2 ADJUSTED EARNINGS PER SHARE C$0.67.Q2 GAAP EARNINGS PER SHARE C$0.22.Q2 EARNINGS PER SHARE VIEW C$0.71 -- REFINITIV IBES DATA.REAFFIRMS ITS 2022 FINANCIAL GUIDANCE ANNOUNCED AT ITS DECEMBER INVESTOR DAY.QTRLY DISTRIBUTABLE CASH FLOW (DCF) OF $2.7 BILLION OR $1.36 PER COMMON SHARE.ANTICIPATES THAT ITS BUSINESSES WILL CONTINUE TO EXPERIENCE STRONG UTILIZATION AND GOOD OPERATING RESULTS THROUGH BALANCE OF YEAR.REMAINS COMMITTED TO ITS EQUITY SELF-FUNDING MODEL AND IS ON TRACK TO ACHIEVE DEBT TO EBITDA OF 4.7X OR LOWER BY YEAR END.",
        "parentTopics": "Corporate Guidance"
    },
    "4618641": {
        "id": 4618641,
        "significance": "1",
        "headline": "Enbridge Reports Third Quarter 2022 Financial Results",
        "description": "Nov 4 (Reuters) - Enbridge Inc <ENB.TO>::ENBRIDGE REPORTS STRONG THIRD QUARTER 2022 FINANCIAL RESULTS AND SECURES B.C. PIPELINE EXPANSION.Q3 ADJUSTED EARNINGS PER SHARE C$0.67.Q3 GAAP EARNINGS PER SHARE C$0.63.REAFFIRMED ITS 2022 FINANCIAL OUTLOOK.QTRLY DISTRIBUTABLE CASH FLOW $2.5 BILLION VERSUS $2.3 BILLION.Q3 EARNINGS PER SHARE VIEW C$0.64 -- REFINITIV IBES DATA.",
        "parentTopics": "Corporate Guidance"
    },
    "4631997": {
        "id": 4631997,
        "significance": "1",
        "headline": "Enbridge Announces 2023 Financial Guidance & Dividend Increase",
        "description": "Nov 30 (Reuters) - Enbridge Inc <ENB.TO>::ENBRIDGE ANNOUNCES 2023 FINANCIAL GUIDANCE AND DIVIDEND INCREASE.ENBRIDGE INC - ANNOUNCED 2023 EBITDA GUIDANCE OF $15.9 BILLION TO $16.5 BILLION AND DCF PER SHARE OF $5.25 TO $5.65.ENBRIDGE INC- REAFFIRMED 2022 FULL YEAR GUIDANCE FOR ADJUSTED EBITDA IN TOP HALF OF $15.0 BILLION TO $15.6 BILLION RANGE.ENBRIDGE INC - ANNOUNCED INTENT TO RENEW COMPANY'S NORMAL COURSE ISSUER BID PROGRAM FOR 2023.ENBRIDGE INC - REAFFIRMED 2022 DISTRIBUTABLE CASH FLOW (DCF) PER SHARE AT JUST ABOVE MIDPOINT OF $5.20 TO $5.50 RANGE.ENBRIDGE INC - EXPECTS TO DEPLOY APPROXIMATELY $6 BILLION OF CAPITAL IN 2023, INCLUSIVE OF MAINTENANCE CAPITAL.",
        "parentTopics": "Corporate Guidance"
    },
    "4658520": {
        "id": 4658520,
        "significance": "1",
        "headline": "Enbridge Reaffirms Its 2023 Financial Outlook",
        "description": "Feb 10 (Reuters) - Enbridge Inc <ENB.TO>::FY GAAP EARNINGS PER SHARE C$1.28.ENBRIDGE REPORTS STRONG 2022 FINANCIAL RESULTS AND ADVANCES STRATEGIC PRIORITIES.REAFFIRMED ITS 2023 FINANCIAL OUTLOOK.QTRLY ADJUSTED EARNINGS PER SHARE OF $0.63.Q4 EARNINGS PER SHARE VIEW C$0.73 -- REFINITIV IBES DATA.QTRLY DISTRIBUTABLE CASH FLOW C$2,663 MILLION VERSUS C$2,487 MILLION.QTRLY LOSS PER SHARE OF $0.53.FY2023 EARNINGS PER SHARE VIEW C$3.05, REVENUE VIEW C$53.35 BILLION -- REFINITIV IBES DATA.TOLL SETTLEMENT REACHED WITH B.C. PIPELINE SHIPPERS AND APPROVED BY CER FOR A FIVE-YEAR TERM ENDING IN 2026.WOODFIBRE LNG PROJECT REMAINS ON TRACK FOR ITS TARGETED IN-SERVICE DATE OF 2027.CURRENTLY NEGOTIATING WITH SHIPPERS A COST-OF-SERVICE APPLICATION WITH FERC IN U.S FOR BASE TOLL COMPONENT OF LAKEHEAD SYSTEM.ALL FINANCIAL FIGURES ARE EXPRESSED IN CANADIAN DOLLARS.",
        "parentTopics": "Corporate Guidance"
    },
    "4704315": {
        "id": 4704315,
        "significance": "1",
        "headline": "Enbridge Inc- Reaffirms Its 2023 Financial Guidance For EBITDA And Dcf",
        "description": "Enbridge Inc <ENB.TO>::ENBRIDGE REPORTS STRONG FIRST QUARTER 2023 FINANCIAL RESULTS AND REAFFIRMS FINANCIAL GUIDANCE AND OUTLOOK.ENBRIDGE INC- REAFFIRMS ITS 2023 FINANCIAL GUIDANCE FOR EBITDA AND DCF.ENBRIDGE INC- ANTICIPATES ITS BUSINESSES WILL CONTINUE TO EXPERIENCE STRONG CAPACITY UTILIZATION AND OPERATING PERFORMANCE THROUGH BALANCE OF YEAR.ENBRIDGE INC QTRLY DISTRIBUTABLE CASH FLOW  OF $3.2 BILLION, COMPARED WITH $3.1 BILLION IN 2022.",
        "parentTopics": "Corporate Guidance"
    },
    "4745355": {
        "id": 4745355,
        "significance": "1",
        "headline": "Enbridge: On Track To Achieve Full-Year EBITDA After Strong Q2 2023",
        "description": "Aug 4 (Reuters) - Enbridge Inc <ENB.TO>::ENBRIDGE REPORTS STRONG SECOND QUARTER 2023 FINANCIAL RESULTS AND REAFFIRMS FINANCIAL GUIDANCE AND OUTLOOK.ARE ON TRACK TO ACHIEVE FULL-YEAR EBITDA AND DCF PER SHARE GUIDANCE.FY2023 EARNINGS PER SHARE VIEW C$2.89, REVENUE VIEW C$47.47 BILLION -- REFINITIV IBES DATA.",
        "parentTopics": "Corporate Guidance"
    },
    "4760418": {
        "id": 4760418,
        "significance": "1",
        "headline": "Enbridge to acquire three utilities in deal valued at $14 bln",
        "description": "Sept 5 (Reuters) - Enbridge Inc <ENB.TO>::ENBRIDGE ANNOUNCES STRATEGIC ACQUISITION OF THREE U.S. BASED UTILITIES TO CREATE LARGEST NATURAL GAS UTILITY FRANCHISE IN NORTH AMERICA.ENBRIDGE INC - FINANCIAL GUIDANCE IN 2023, AND NEAR-TERM AND MEDIUM-TERM OUTLOOK IS MAINTAINED; LONG-TERM DIVIDEND GROWTH PROFILE IS STRENGTHENED..ENBRIDGE INC - PROPOSED DEAL FOR FOR AN AGGREGATE PURCHASE PRICE OF US$14.0 BILLION.ENBRIDGE INC - PROPOSED DEAL FOR FOR AN AGGREGATE PURCHASE PRICE OF US$14.0 BILLION.ENBRIDGE INC - REAFFIRMS ITS 2023 FINANCIAL GUIDANCE.ENBRIDGE - OBTAINED DEBT FINANCING COMMITMENTS TOTALING $9.4 BILLION FROM MORGAN STANLEY, ROYAL BANK OF CANADA FOR CASH CONSIDERATION OF ACQUISITIONS.ENBRIDGE- EXPECTS ACQUISITIONS TO BE ACCRETIVE TO ENBRIDGE'S FINANCIAL DCFPS AND ADJUSTED EPS OUTLOOK IN FIRST FY OF OWNERSHIP ADDING SHAREHOLDER VALUE.",
        "parentTopics": "Corporate Guidance"
    },
    "4801347": {
        "id": 4801347,
        "significance": "1",
        "headline": "Enbridge Announces $3.1 Bln Sale Of Its Interests In Alliance Pipeline And Aux Sable",
        "description": "Dec 13 (Reuters) - Enbridge Inc <ENB.TO>::ENBRIDGE ANNOUNCES $3.1 BILLION SALE OF ITS INTERESTS IN ALLIANCE PIPELINE AND AUX SABLE.ENBRIDGE INC - ENBRIDGE'S 2024 FINANCIAL GUIDANCE AND NEAR-TERM GROWTH OUTLOOK THROUGH 2025 REMAIN UNCHANGED.ENBRIDGE INC - PROPOSED DEAL INCLUDES NON-RECOURSE DEBT AT ALLIANCE OF APPROXIMATELY $0.3 BILLION, AND SUBJECT TO CUSTOMARY CLOSING ADJUSTMENTS.ENBRIDGE INC: AS PART OF TRANSACTION, PEMBINA AND CURRENT OPERATOR OF AUX SABLE, WILL ALSO ASSUME OPERATORSHIP OF ALLIANCE.ENBRIDGE INC- SALES PROCEEDS WILL FUND A PORTION OF STRATEGIC U.S. GAS UTILITIES ACQUISITIONS AND BE USED FOR DEBT REDUCTION.ENBRIDGE INC: ENBRIDGE'S 2024 FINANCIAL GUIDANCE AND NEAR-TERM GROWTH OUTLOOK THROUGH 2025 REMAIN UNCHANGED.ENBRIDGE INC -  AGREEMENT TO SELL 50.0% INTEREST IN ALLIANCE PIPELINE AND 42.7% INTEREST IN AUX SABLE TO PEMBINA PIPELINE CORPORATION.",
        "parentTopics": "Ownership\\/Control"
    },
    "4833888": {
        "id": 4833888,
        "significance": "1",
        "headline": "Enbridge Announces Accretive Investments",
        "description": "March 6 (Reuters) - Enbridge Inc <ENB.TO>::ENBRIDGE EXTENDS VISIBLE GROWTH OUTLOOK, REITERATES STRATEGIC PRIORITIES AND ANNOUNCES ACCRETIVE INVESTMENTS.ENBRIDGE INC - REAFFIRMING AVERAGE ANNUAL GROWTH RATE OF ABOUT 5% POST 2026 FOR ADJUSTED EBITDA, DCF PER SHARE AND ADJUSTED EPS.ENBRIDGE INC: EXTENDING AVERAGE ANNUAL GROWTH RATE THROUGH 2026 4%-6% FOR EARNINGS PER SHARE.ENBRIDGE INC - REAFFIRMED 2024 FULL YEAR FINANCIAL GUIDANCE FOR EBITDA AND DCF PER SHARE.ENBRIDGE INC: INVESTING APPROXIMATELY $3+ BILLION ANNUALLY IN LOW-RISK NATURAL GAS UTILITY INFRASTRUCTURE.ENBRIDGE INC: PLANNING GRAY OAK PIPELINE EXPANSION OF APPROXIMATELY 120KBPD.ENBRIDGE INC - ANNOUNCING ACCRETIVE NEW CAPITAL INVESTMENTS FOCUSED ON OUR U.S. GULF COAST STRATEGY.ENBRIDGE INC: GENERATING ANNUAL INVESTMENT CAPACITY, AFTER DIVIDENDS, OF UP TO $9 BILLION.ENBRIDGE INC: SANCTIONED US$0.2 BILLION OF OFFSHORE PIPELINES TO SERVICE SHELL AND EQUINOR'S SANCTIONED SPARTA DEVELOPMENT.ENBRIDGE INC: PLAN TO INVEST $6-$7 BILLION ANNUALLY ON SECURED PROJECTS.ENBRIDGE INC - ENBRIDGE AND SHELL PIPELINE HAVE EXTENDED THEIR RELATIONSHIP THROUGH ADDITIONAL INVESTMENT IN GROWING GULF OF MEXICO OFFSHORE PLAYS.ENBRIDGE - HAS ALSO SIGNED AGREEMENT TO ACQUIRE TWO MARINE DOCKS AND NEARBY LAND ADJACENT TO EIEC FROM FLINT HILLS RESOURCES FOR ABOUT US$0.2 BILLION.",
        "parentTopics": "Restructuring\\/Reorganization\\/Related"
    }
}