{
    "ENB": [
        {
            "symbol": "ENB",
            "time": 1707436800000000000,
            "displayTime": "Friday, February 9 2024",
            "title": "Enbridge Q4 Adjusted EPS CAD 0.64 Vs. IBES Estimate CAD 0.68",
            "text": "Feb 09 (Reuters) - Enbridge Q4 adjusted net income CAD 1,363 million vs. IBES estimate CAD 1,417 million.:"
        },
        {
            "symbol": "ENB",
            "time": 1707436800000000000,
            "displayTime": "Friday, February 9 2024",
            "title": "Enbridge Q4 Adjusted EPS CAD 0.64 Vs. IBES Estimate CAD 0.68",
            "text": "Feb 09 (Reuters) - Enbridge Q4 adjusted net income CAD 1,363 million vs. IBES estimate CAD 1,417 million.:."
        },
        {
            "symbol": "ENB",
            "time": 1711411200000000000,
            "displayTime": "Tuesday, March 26 2024",
            "title": "Enbridge To Enter Into JV Connecting Permian Basin Natural Gas Supply To Growing LNG And USGC Demand",
            "text": "March 26 (Reuters) - Enbridge Inc <ENB.TO>::ENBRIDGE TO ENTER INTO JV CONNECTING PERMIAN BASIN NATURAL GAS SUPPLY TO GROWING LNG AND USGC DEMAND.ENBRIDGE INC - JV IMMEDIATELY ACCRETIVE TO DCF PER SHARE, WITH ABOUT 90% CONTRACTED CASH FLOWS.ENBRIDGE INC: JV WILL BE OWNED BY WHITEWATER/I SQUARED (50.6%), MPLX (30.4%), AND ENBRIDGE (19.0%).ENBRIDGE - UPON CLOSING, ENBRIDGE WILL CONTRIBUTE ITS WHOLLY-OWNED RIO BRAVO PIPELINE PROJECT AND ABOUT US$350MM IN CASH TO JOINT VENTURE.ENBRIDGE INC: UPON CLOSING OF TRANSACTION, ENBRIDGE WILL FUND FIRST ABOUT US$150 MILLION OF POST-CLOSING CAPEX TO COMPLETE RIO BRAVO PIPELINE PROJECT."
        },
        {
            "symbol": "ENB",
            "time": 1709683200000000000,
            "displayTime": "Wednesday, March 6 2024",
            "title": "Enbridge Announces Accretive Investments",
            "text": "March 6 (Reuters) - Enbridge Inc <ENB.TO>::ENBRIDGE EXTENDS VISIBLE GROWTH OUTLOOK, REITERATES STRATEGIC PRIORITIES AND ANNOUNCES ACCRETIVE INVESTMENTS.ENBRIDGE INC - REAFFIRMING AVERAGE ANNUAL GROWTH RATE OF ABOUT 5% POST 2026 FOR ADJUSTED EBITDA, DCF PER SHARE AND ADJUSTED EPS.ENBRIDGE INC: EXTENDING AVERAGE ANNUAL GROWTH RATE THROUGH 2026 4%-6% FOR EARNINGS PER SHARE.ENBRIDGE INC - REAFFIRMED 2024 FULL YEAR FINANCIAL GUIDANCE FOR EBITDA AND DCF PER SHARE.ENBRIDGE INC: INVESTING APPROXIMATELY $3+ BILLION ANNUALLY IN LOW-RISK NATURAL GAS UTILITY INFRASTRUCTURE.ENBRIDGE INC: PLANNING GRAY OAK PIPELINE EXPANSION OF APPROXIMATELY 120KBPD.ENBRIDGE INC - ANNOUNCING ACCRETIVE NEW CAPITAL INVESTMENTS FOCUSED ON OUR U.S. GULF COAST STRATEGY.ENBRIDGE INC: GENERATING ANNUAL INVESTMENT CAPACITY, AFTER DIVIDENDS, OF UP TO $9 BILLION.ENBRIDGE INC: SANCTIONED US$0.2 BILLION OF OFFSHORE PIPELINES TO SERVICE SHELL AND EQUINOR'S SANCTIONED SPARTA DEVELOPMENT.ENBRIDGE INC: PLAN TO INVEST $6-$7 BILLION ANNUALLY ON SECURED PROJECTS.ENBRIDGE INC - ENBRIDGE AND SHELL PIPELINE HAVE EXTENDED THEIR RELATIONSHIP THROUGH ADDITIONAL INVESTMENT IN GROWING GULF OF MEXICO OFFSHORE PLAYS.ENBRIDGE - HAS ALSO SIGNED AGREEMENT TO ACQUIRE TWO MARINE DOCKS AND NEARBY LAND ADJACENT TO EIEC FROM FLINT HILLS RESOURCES FOR ABOUT US$0.2 BILLION."
        }
    ]
}