{
    "4773038": {
        "id": 4773038,
        "significance": "1",
        "headline": "Pfizer Sees FY revenue USD 58,000 million -61,000 million",
        "description": "Oct 13 (Reuters) - Pfizer Outlook FY revenue USD 58,000-61,000 million.:.",
        "parentTopics": "Corporate Guidance"
    },
    "4773024": {
        "id": 4773024,
        "significance": "1",
        "headline": "Pfizer Amends U.S. Government Paxlovid Supply Agreement And Updates Full-Year 2023 Guidance",
        "description": "Oct 13 (Reuters) - Pfizer Inc <PFE.N>::PFIZER AMENDS U.S. GOVERNMENT PAXLOVID SUPPLY AGREEMENT AND UPDATES FULL-YEAR 2023 GUIDANCE.PFIZER INC - UPDATES FULL-YEAR 2023 GUIDANCE.PFIZER INC - REVISES 2023 REVENUE GUIDANCE RANGE TO $58.0 TO $61.0 BILLION SOLELY DUE TO COVID PRODUCTS.PFIZER INC- RECORDS $5.5 BILLION NON-CASH CHARGE IN 2023 Q3 PRIMARILY FOR COVID INVENTORY WRITE-OFFS.PFIZER INC - REVISES 2023 ADJUSTED DILUTED EPS GUIDANCE TO $1.45 TO $1.65 TO ACCOUNT FOR LOWER EXPECTED REVENUES FOR COVID PRODUCTS AND INVENTORY WRITE-OFFS.PFIZER INC - REAFFIRMS FULL-YEAR 2023 NON-COVID PRODUCT OPERATIONAL REVENUE GROWTH EXPECTATIONS OF 6% TO 8%.PFIZER INC- LAUNCHES ENTERPRISE-WIDE COST REALIGNMENT PROGRAM EXPECTED TO DELIVER TARGETED SAVINGS OF AT LEAST $3.5 BILLION.PFIZER INC - EXPECTS TO DELIVER APPROXIMATELY $1.0 BILLION IN SAVINGS IN 2023 THROUGH ITS COST REALIGNMENT PROGRAM.PFIZER INC - COMPANY IS ALSO REDUCING ITS FULL-YEAR 2023 REVENUE EXPECTATIONS FOR COMIRNATY BY APPROXIMATELY $2.0 BILLION DUE TO LOWER-THAN-EXPECTED VACCINATION RATES.PFIZER INC: REDUCES FY GUIDANCE FOR COMIRNATY REVENUES BY APPROXIMATELY $2.0 BILLION.PFIZER INC - PFIZER'S NON-COVID PRODUCTS REMAIN ON TRACK TO ACHIEVE AN EXPECTED 6% TO 8% OPERATIONAL REVENUE GROWTH YEAR OVER YEAR IN 2023..PFIZER INC- IN A NON-CASH TRANSACTION, U.S. GOVERNMENT TO RETURN ESTIMATED 7.9 MILLION EUA-LABELED PAXLOVID TREATMENT COURSES AT END OF 2023.",
        "parentTopics": "Litigation\\/Regulatory"
    },
    "4781478": {
        "id": 4781478,
        "significance": "1",
        "headline": "Pfizer Says In Qtr, RSV Vaccine, Abrysvo, Contributed $375 Mln In U.S. Revenues",
        "description": "Oct 31 (Reuters) - Pfizer Inc <PFE.N>::PFIZER INC - IN QUARTER, RECENTLY LAUNCHED RESPIRATORY SYNCYTIAL VIRUS (RSV) VACCINE, ABRYSVO, CONTRIBUTED $375 MILLION IN U.S. REVENUES- PREPARED REMARKS.PFIZER INC- NEXT-GENERATION MRNA FLU\\/COVID COMBINATION CANDIDATE IS EXPECTED TO MARKET IN 2025.PFIZER INC- CONTINUE TO EXPECT THE TRANSACTION WITH SEAGEN TO CLOSE IN LATE 2023 OR EARLY 2024.PFIZER INC- CONTINUE TO EXPECT 6% TO 8% FULL YEAR OPERATIONAL REVENUE GROWTH FOR NON-COVID PRODUCTS YEAR OVER YEAR.PFIZER INC - TIMING FOR OUR STANDALONE MRNA FLU CANDIDATE IS NOW EXPECTED AFTER 2024.PFIZER INC- NOW ADVANCING OUR  FOURTH-GENERATION PCV CANDIDATE  INTO A FIRST-IN-HUMAN TRIAL, WHICH IS EXPECTED TO BEGIN IN THE FOURTH QUARTER OF 2023.PFIZER INC - ACHIEVED BOTH PRIMARY ENDPOINTS IN THE 18–64-YEAR-OLD COHORT OF OUR ONGOING PHASE 3 FLU TRIAL.PFIZER INC - FLU VACCINE MET SECONDARY IMMUNOGENICITY ENDPOINTS ONLY FOR A STRAINS, NOT B STRAINS OF INFLUENZA.Further company coverage: PFE.N. ((Reuters.Briefs@thomsonreuters.com;)).",
        "parentTopics": "Corporate Guidance"
    },
    "4781447": {
        "id": 4781447,
        "significance": "1",
        "headline": "Pfizer reports Q3 revenue USD 13,232 million",
        "description": "Oct 31 (Reuters) - Pfizer Q3 revenue USD 13,232 million vs. IBES estimate USD 13,341 million.:.",
        "parentTopics": "Corporate Guidance"
    },
    "4801227": {
        "id": 4801227,
        "significance": "1",
        "headline": "Pfizer Still Expects 2023 Revenue Of $58 Billion – $61 Billion",
        "description": "Dec 13 (Reuters) - Pfizer Inc <PFE.N>::PFIZER CFO SAYS STILL EXPECTS 2023 REVENUE OF $58.0 BILLION – $61.0 BILLION - CONF. CALL.PFIZER CFO SAYS EXPECTS 2023 EPS $1.45 TO $1.65 - CONF. CALL.PFIZER CFO SAYS EXPECTS 2024 COVID VACCINATION AND INFECTION RATES LARGELY CONSISTENT WITH 2023 \"BUT WE SET GUIDANCE LOWER THAN THAT\" - CONF. CALL.PFIZER CFO SAYS COMMITTED TO MAINTAINING AND GROWING DIVIDEND OVER TIME - CONF. CALL.PFIZER CFO SAYS NO LONGER EXPECTS TO HIT CAGR OF 6% FOR 2022 TO 2025 - CONF. CALL.Further company coverage: PFE.N. ((Reuters.Briefs@thomsonreuters.com;)).",
        "parentTopics": "Corporate Guidance"
    },
    "4801133": {
        "id": 4801133,
        "significance": "1",
        "headline": "Pfizer Sees Full-Year 2024 Operational Revenue Growth Of 8%-10%",
        "description": "Dec 13 (Reuters) - Pfizer Inc <PFE.N>::PFIZER PROVIDES FULL-YEAR 2024 GUIDANCE.FULL-YEAR 2024 REVENUE GUIDANCE RANGE OF $58.5 TO $61.5 BILLION INCLUDES EXPECTED CONTRIBUTION FROM SEAGEN ACQUISITION.EXPECTS FULL-YEAR 2024 OPERATIONAL REVENUE GROWTH OF 8%-10%.2024 ADJUSTED DILUTED EPS GUIDANCE RANGE OF $2.05 TO $2.25 INCLUDES EXPECTED IMPACT OF SEAGEN ACQUISITION.ENTERPRISE-WIDE COST REALIGNMENT PROGRAM NOW EXPECTED TO DELIVER ANNUAL NET COST SAVINGS OF AT LEAST $4.0 BILLION.SEAGEN EXPECTED TO CONTRIBUTE APPROXIMATELY $3.1 BILLION OF REVENUES IN FULL-YEAR 2024.ANTICIPATES APPROXIMATELY $8 BILLION IN REVENUES FOR COMIRNATY AND PAXLOVID FOR 2024.FY2024 EARNINGS PER SHARE VIEW $3.17, REVENUE VIEW $63.17 BILLION -- LSEG IBES DATA.INCLUDING IMPACT OF SEAGEN, PFIZER ANTICIPATES FULL-YEAR 2024 ADJUSTED SI&A EXPENSES TO BE IN RANGE OF $13.8 BILLION TO $14.8 BILLION.WE EXPECT OUR COST REALIGNMENT PROGRAM TO DELIVER SAVINGS OF AT LEAST $4.0 BILLION BY END OF 2024.",
        "parentTopics": "Corporate Guidance"
    },
    "4815333": {
        "id": 4815333,
        "significance": "1",
        "headline": "Pfizer Says Paxlovid Revenue Adjustment In Q1 Is Possible",
        "description": "Jan 30 (Reuters) - Pfizer Inc <PFE.N>::PFIZER SPOKESPERSON SAYS POSSIBLE THERE COULD BE REVENUE ADJUSTMENT IN Q1 FOR PAXLOVID AS WINDOW FOR U.S. GOVERNMENT RETURNS STILL OPEN.Further company coverage: PFE.N. ((Reuters.Briefs@thomsonreuters.com;)).",
        "parentTopics": "Corporate Guidance"
    },
    "4815201": {
        "id": 4815201,
        "significance": "1",
        "headline": "Pfizer Records $3.5 Bln Revenue Reversal For COVID Pill Paxlovid In Q4",
        "description": "Jan 30 (Reuters) - Pfizer Inc <PFE.N>::PFIZER CEO, IN PREPARED REMARKS, SAYS THAT CO IS FOCUSED ON EXPANDING RETAIL CONTRACTING AND OFFERINGS TO GAIN MARKET SHARE IN THE RSV VACCINE MARKET.PFIZER EXEC SAYS RECORDED $3.5 BILLION REVENUE REVERSAL FOR COVID PILL PAXLOVID IN THE FOURTH QUARTER.PFIZER SAYS Q4 RESULTS INCLUDED A $1.4 BILLION INTANGIBLE ASSET IMPAIRMENT CHARGE ASSOCIATED WITH ULCERATIVE COLITIS DRUG ETRASIMOD.PFIZER SAYS RECORDED A NEARLY $1 BILLION INTANGIBLE ASSET IMPAIRMENT FOR PNEUMOCOCCAL DISEASE PREVENTION VACCINE PREVNAR 13.Further company coverage: PFE.N. ((Reuters.Briefs@thomsonreuters.com;)).",
        "parentTopics": "Corporate Guidance"
    }
}